{
    "title": "DoD Will Revisit JEDI Cloud Contract",
    "text": "The Pentagon will reboot its department-wide cloud contract after a federal judge refereeing a protest filed by Amazon Web Services indicated the cloud giant was likely to succeed in making its case on technical and legal grounds.The Defense Department petitioned a federal judge on Thursday evening (March 12) to pause legal proceedings while it reworks the solicitation for the Joint Enterprise Defense Infrastructure (JEDI) contract. The cloud contract awarded to Microsoft (NASDAQ: MSFT) last October could be worth up $10 billion over the next decade.The reevaluation in response to the AWS (NASDAQ: AMZN) protest means DoD would accept “limited proposal revisions” for a reworked JEDI solicitation that would allow cloud vendors to submit new bids. Among the technical issues identified in a February injunction halting the JEDI contact were DoD errors in evaluating a “noncompliant storage” framework in Microsoft’s JEDI proposal.A federal court blocked the JEDI rollout last month in response to an AWS discovery motion alleging political interference and resulting bias in the contract award. It also seeks to depose President Trump and DoD officials.AWS also has alleged evaluation errors and bias in six of eight categories used in selecting a single JEDI contractor.“We are pleased that the DoD has acknowledged ‘substantial and legitimate' issues that affected the JEDI award decision, and that corrective action is necessary. We look forward to complete, fair, and effective corrective action that fully insulates the reevaluation from political influence and corrects the many issues affecting the initial flawed award,” and AWS spokesperson said.“We believe the Department of Defense made the correct decision when they awarded the contract,” countered Microsoft spokesman Frank Shaw. “However, we support their decision to reconsider a small number of factors as it is likely the fastest way to resolve all issues and quickly provide the needed modern technology to people across our armed forces.“Throughout this process, we’ve focused on listening to the needs of the DoD, delivering the best product, and making sure nothing we did delayed the procurement process. We are not going to change this approach now,” Shaw added.A revised JEDI solicitation raises the possibility that DoD would abandon its sole-source approach and select multiple cloud vendors. On the earlier assumption AWS was the front-runner to win the JEDI contract, previous JEDI protests by IBM (NYSE: IBM) and Oracle (NYSE: ORCL) argued that enterprise cloud deployments were trending toward multiple cloud providers as a way to avoid vendor lock-in and infrastructure downtime.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2020-03-13 00:00:00",
    "cats": [
        "Cloud",
        "Government",
        "Slider: Cloud",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/sectors/government-sectors/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS",
        "cloud",
        "DoD",
        "JEDI",
        "microsoft",
        "procurement",
        "protest"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/dod/",
        "https://www.enterpriseai.news/tag/jedi/",
        "https://www.enterpriseai.news/tag/microsoft/",
        "https://www.enterpriseai.news/tag/procurement/",
        "https://www.enterpriseai.news/tag/protest/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/DoD_cloud_mil_JEDI-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}