{
    "title": "Pure Storage Acquires Cloud Backup Startup",
    "text": "Pure Storage has boosted its ability to manage big data migrating to the cloud with the acquisition of privately-held StorReduce.Terms of the acquisition, which closed earlier this month, were not disclosed.StorReduce, Sunnyvale, Calif., was founded in 2014. The software-defined storage specialist focuses on storage applications designed to help users migrate on-premises backups of big data to the cloud while providing inline deduplication and data replication for backing up unstructured data in the cloud.In announcing the deal on Tuesday (Aug. 21), Pure Storage (NYSE: PSTG) said it would expand its public cloud integration offerings needed to meet growing demand for managing large volumes of unstructured data across multi-cloud deployments.Specifically, the deal gives Pure Storage a hybrid flash storage capability that could be coupled with cloud storage to replace disk storage for cloud migrations and multi-cloud data tiering. It also adds deduplication technology to the company’s object storage capabilities.“With the combination of StorReduce's data reduction capabilities and Pure [Storage’s] flash and object storage technologies, we can now optimize many modern cloud-native applications as well as many existing unstructured data workloads, in particular rapid recovery, at a faster rate,” said StorReduce CEO Vanessa Wilson.Pure Storage CEOCharles Giancarlosaid the deal would allow the Mountain View, Calif., company to offer a “data-centric architectures” that operate on-premises and in the cloud.The acquisition also illustrates how the storage sector is consolidating with an eye toward offering new tools for enterprise hybrid and multi-cloud deployments, including what Pure Storage bills as “cloud-optimized deduplication technology.” George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-08-21 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "data reduction",
        "deduplication",
        "flash storage",
        "Hybrid Cloud",
        "multi-cloud",
        "Pure Storage",
        "StorReduce"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/data-reduction/",
        "https://www.enterpriseai.news/tag/deduplication/",
        "https://www.enterpriseai.news/tag/flash-storage/",
        "https://www.enterpriseai.news/tag/hybrid-cloud/",
        "https://www.enterpriseai.news/tag/multi-cloud/",
        "https://www.enterpriseai.news/tag/pure-storage/",
        "https://www.enterpriseai.news/tag/storreduce/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-28-at-9.34.16-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}