{
    "title": "Dell Extends VMware Cloud",
    "author": "George Leopold",
    "date": "2019-04-29 00:00:00",
    "text": "Dell Technologies unveiled what amounts to a one-stop shop for cloud datacenter services built upon a VMware cloud running on hyperconverged Dell EMC infrastructure and aimed at edge computing as well as datacenters.The company (NYSE: DELL) also this week announced an expansion of its partnership with Microsoft (NASDAQ: MSFT) to supply VMware infrastructure on the Microsoft Azure cloud.The VMware scalable infrastructure delivered as a service to on-premises datacenters and edge devices is billed as the “core” of Dell’s cloud datacenter service unveiled at a company event in Las Vegas on Monday (April 29).The VMware cloud that includes vSphere computing, vSAN storage and NSX networking software is being packaged with Dell EMC’s VxRail hyperconverged infrastructure. VMware (NYSE: VMW) will manage the new service.Among the selling points is providing “consistent infrastructure and operations across cloud, datacenter and edge” deployments, a capability Dell said would appeal to customers keeping key applications and data in-house. Those operations include processors, storage and networking delivered as services, easing the modernization of datacenters and edge installations as well as upgrading existing applications to support micro-services such as containers and accompanying Kubernetes cluster orchestration.Along with storage, Dell EMC’s enterprise services include data backup, disaster recovery and cloud “bursting,” the cloud deployment model in which popular applications running in private clouds shift to public clouds when demand for computing capacity spikes.The cloud services platform also emphasizes security features that rely on VMware NSX micro-segmentation capabilities that assign security policies to datacenter applications. Meanwhile, the cloud service will include data encryption for both data at-rest and in-transit.The converged offering would allow VMware customers to use familiar tools to provision and migrate on-premise workloads to the public cloud.Dell said its VMware cloud on Dell EMC is currently in beta testing. It is expected to become available in the U.S. during the second half of 2019.Meanwhile, the expanded cloud partnership with Microsoft would allow joint customers to manage Office applications across devices via Microsoft Azure Active Directory and Microsoft Intune.The partners said the Azure tools are based on VMware’s “Cloud Foundation” suite of software-defined computing, storage and networking deployed on the Microsoft public cloud service.“Our goal is to provide a single view from edge to core to cloud,” said Michael Dell, chairman and CEO of Dell Technologies.The companies also emphasized the ability to migrate and run existing VMware workloads from on-premise datacenters to Azure without the need for re-coding applications or re-tooling operations.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/Michael_Dell-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}