{
    "title": "EMC Seeking Merger Partner?",
    "text": "Storage specialist EMC is looking for another merger partner while exploring other options after negotiations with rival Hewlett-Packard on a blockbuster corporate marriage reportedly broke down in recent weeks.Unconfirmed reports surfaced in mid-September that EMC was considering selling off its stake in VMware. An unidentified source later told Reuters that the reports were inaccurate and that EMC planned to retain its roughly 80 percent stake in the virtualization specialist.Besides its core data storage business under the EMC Information Infrastructure unit, the other key component is its Pivotal enterprise platform-as-a-service unit that was previously spun out from VMware. Pivotal recently announced a batch of new data services for its Cloud Foundry-based PaaS offering.The moves come amid growing pressure from the activist hedge fund Elliot Management, which in July acquired a large stake in EMC, thought to be more than 2 percent. The activist hedge fund was said to be pressing outgoing CEO Joseph Tucci to spin off VMware as a way to boost the value of both companies.Tucci is expected to step down as head of EMC early next year. The company has yet to name his successor. Earlier this year, EMC Information Infrastructure announced three executive appointments: Jeremy Burton was named president of product and marketing; Denis Cashman was appointed chief financial officer; and Jonathan Martin was tapped as chief marketing officer. Burton and Cashman report to EMC Information Infrastructure CEO David Goulden, who retained the role of EMC CFO.Goulden was named CEO of EMC Information Infrastructure in January.Tucci took the helm as CEO in 2001 and transformed EMC into a diversified hardware, software, and services company. The impetus for the change, according to market watcher Quocirca, was the realization that EMC could help customers manage information they stored.Tucci, who took on the additional title of EMC board chairman in 2006, is expected to step down as EMC's CEO in early 2015.The potential moves toward industry consolidation serve to underscore how the commodity cloud storage market is maturing as hybrid cloud networks, even \"intercloud\" strategies, begin to emerge.The pace of acquisitions appears to be picking up as major players seek to shape technology trends like the OpenStack movement. To that end, Cisco Systems announced last week it was acquiring privately-held Metacloud as a way to advance its intercloud initiative intended to connect private, public and hybrid clouds.As cloud storage increasingly moves toward commodity pricing, industry consolidation via mergers and acquisitions appear likely as rivals struggle to identify new revenue sources.EMC, based in Hopkinton, Massacusetts, also has reportedly held preliminary merger talks with Dell, which was said to be interested in acquiring EMC's core storage unit. Cisco and Oracle are also considered potential merger partners.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-09-22 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/07/EMC-Sustainability-Report-2012_420x515-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}