{
    "title": "Researchers Put a New Spin on Graphene Chips",
    "author": "no author",
    "date": "2015-01-26 00:00:00",
    "text": "Among the post-silicon candidate materials for future chip manufacturing is graphene, a sheet of carbon atoms arranged in hexagonal lattice. One hurdle to the use of graphene as a foundational semiconductor material in chips and for storage is a confounding lack of magnetism.A semiconductor technique known as doping can be used to induce magnetism in graphene by adding magnetic impurities. But the doping process tends to disrupt the material's beneficial electronic properties.Researchers at the University of California at Riverside may have found a way to induce magnetism in graphene while preserving electronics properties. They claim to have overcome the problem by moving a graphene sheet very close to an electrical insulator with magnetic properties.If perfected, the researchers said the technique could be applied in chips that use electronic spin to store data, also known as spintronics. Their study results were published earlier this month in Physical Review Letters.\"Placing graphene on an insulating magnetic substrate can make the material ferromagnetic without disturbing its exceptional conductivity,\" the researchers claimed in summarizing the results.\"This is the first time that graphene has been made magnetic this way,” added Jing Shi, a physics and astronomy professor at UC-Riverside whose laboratory led the research. “The magnetic graphene acquires new electronic properties so that new quantum phenomena can arise. These properties can lead to new electronic devices that are more robust and multi-functional.\"Among those new functions is the prospect of using spintronics to store ever-larger volumes of data.Shi and his research team used a material called yttrium iron garnet grown using a technique called laser molecular beam epitaxy. They placed a single layer of graphene on an atom-thick sheet of yttrium iron garnet. They discovered that graphene \"borrowed\" the magnetic properties of the material.The researchers added that they managed to avoid interfering with graphene's electrical transport properties by using the electric insulator compound. Iron alone, they noted, would disrupt graphene's electrical conductance.They confirmed that a graphene sheet had indeed been magnetized after exposing it to an external magnetic field. Using the magnetic properties of yttrium iron garnet, the researchers found that graphene's Hall voltage—its voltage perpendicular to the direction of a current flow—depended on the magnetism of yttrium iron garnet.Storage techniques like spintronics, or spin transport electronics, remain a long way from commercialization, but academic research is growing as silicon technology runs out of steam. Prototype devices already in use include a giant-magneto-resistive structure used as a read head and as a memory storage cell, according to researchers at the University of Maryland.The UC-Riverside researchers noted that their technique also enhanced spin-orbit coupling that is believed to be inherently weak in graphene. The proximity-induced magnetism in graphene could lead to novel transport phenomena that are potentially useful for spintronics, they claimed.The U.S. military and the National Science Foundation (NSF) are funding university research on spintronics. NSF and the U.S. Energy Department funded the UC-Riverside graphene research.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-26-at-2.10.59-PM-370x290.png"
    ]
}