{
    "title": "GE, Apple Bringing Predix IIoT Apps to iPhones/iPads",
    "author": "Doug Black",
    "date": "2017-10-18 00:00:00",
    "text": "The powerhouse team of Apple and General Electric are joining forces to offer predictive data and analytics industrial apps from Predix, GE’s IIoT platform, to Apple iPhones and iPads. Today, the two companies unveiled a new Predix software development kit (SDK) for Apple’s iOS, tools for developers to make their own industrial IoT apps.The companies said Predix SDK for iOS, which will be available for download tomorrow, enables developers to make native apps that leverage Predix industrial analytics along with “the power and ease of use of iOS, the world’s most advanced mobile operating system.” Apps will be used to give industrial operators insight into the performance of their equipment and operations from their iPhone or iPad.“For example, a Predix app can notify a worker on their iPhone of a potential issue with equipment, such as a wind turbine, and allow them to collaborate with remote teams when performing inspections and repairs, collecting relevant data instantly. These industrial apps will close the information loop faster, ultimately increasing cost savings and minimizing unplanned downtime,” the companies said in a prepared announcement.The two companies also are collaborating on new apps for both internal use and for GE customers. GE’s Asset Performance Management (APM) Cases app, which is available in the App Store, is designed to help industrial businesses increase machine reliability and availability and reduce maintenance costs while managing operations risks.GE cited Exelon Corp., Chicago, a Fortune 100 energy company with 34,000 employees, as an adopter of APM for improving equipment uptime and overall productivity.“Apple is known for setting the standard on hardware and simple software interfaces,” said Brian Hoff, director of corporate innovation at Exelon. “When you combine this with the power of Predix and all of the data Exelon is aggregating and analyzing, the possibilities for game-changing solutions are endless.”GE said it will standardize on iPhone and iPad for mobile devices and also promote the Mac personal computer as a choice for its 330,000 global employee workforce. Apple will promote GE’s Predix as the IIoT analytics platform of choice to its customers and developers.“Our customers increasingly need to arm their workforces through mobility,” said John Flannery, chairman/CEO, GE. “Working together, GE and Apple are giving industrial companies access to powerful apps that help them tap into the predictive data and analytics of Predix right on their iPhone or iPad.”“GE is an ideal partner with a rich history of innovation across the industrial world in areas like aviation, manufacturing, healthcare and energy,” said Tim Cook, Apple’s CEO. “Together, Apple and GE are fundamentally changing how the industrial world works by combining GE’s Predix platform with the power and simplicity of iPhone and iPad.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/IndustrialInternet-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/Apple-GE-logos-300x168.jpg"
    ]
}