{
    "title": "Panasas Secures Growth Investment, Jorge Titinger Joins Board",
    "text": "High performance storage supplier Panasas, maker of scale-out NAS appliances, has announced a funding round and an expansion to its board of directors that it says will enable the acceleration of its technology roadmap. The funding round, of an unspecified sum, comes from the investing arm of KEWA Financial, a U.S. insurance company, and Dowroc Partners, a private investment fund focused on storage technology, cloud computing and the energy sector.Expanding market reach is a major thrust of the investment tied to the launch of Panasas ActiveStor Ultra with PanFS 8 at SC18. With PanFS reengineered to be portable across any properly configured hardware, Panasas is exploring OEM partnerships and seeking entrée into new markets, traditional as well as commercial HPC. Emerging workloads such as AI and autonomous driving are also being targeted.“This wasn’t a funding that was driven by the company’s need to raise immediate financing,” said Panasas CEO Faye Pairman. “The funding is really designed to accelerate the delivery the [ActiveStor Ultra] product and the features and enhancements we’d like to add. It also allows us to write to more platforms, which means we’ll be delivering it as an appliance but also have the ability to port to additional platforms.”When it comes to OEM relationships, Panasas is still in the courting phase. “We have a lot of interest from OEMs and we are interested in some of those,” Pairman reported. “We are going to be very thoughtful about OEM relationships that are incremental to the customer sets that we can reach, and we are in the middle of discussions.”As you’d probably expect given momentum in the space, building advanced storage solutions for AI is part of the conversation they are having. “I can’t give you details at the moment,” said Jim Donovan, Panasas chief sales and marketing officer, “but rest assured we are looking at an innovative approach for how you economically approach storage requirements from an AI standpoint.”The investment comes with the addition of four new members to Panasas’ board, including HPC heavyweight, former SGI chief Jorge Titinger, now chief executive officer of Titinger Consulting. Titinger negotiated the acquisition of SGI by Hewlett Packard Enterprise in 2016 for $275 million.“The PanFS portable parallel filesystem is a game changer for the HPC industry, opening new opportunities with customers who are frustrated with the complexities of open source filesystem solutions,” Titinger said in a press statement. “The ease of use of PanFS combined with performance and cost efficiency of an integrated ActiveStor or OEM-certified deployment will make it a highly attractive value proposition for commercial and traditional HPC applications alike.”The board also welcomed David Wiley, founder and chief executive officer of KEWA; Robert Cihra, partner at Dowroc Partners and a veteran Wall Street technology analyst; and Jonathan Lister, vice president of global sales solutions at LinkedIn and former Google and AOL alum.“Both the investment arm of KEWA and Dowroc Partners, which is a private investment fund, look to invest in growth, particularly in companies that are at some sort of positive inflection point,” Cihra told HPCwire. “We believe Panasas fits that bill. Broadly speaking we see high performance storage as a great growth market and one that I think is getting bigger as computing gets more complex. So we like the overall performance storage market, and within that market, we think Panasas has a really innovative way of capitalizing on that growth.”Cihra, speaking on behalf of KEWA and Dowroc Partners, also characterized the funding as “an initial equity investment,” adding, “like other growth investors, we will continue to invest as the company performs.”With these new appointments, the Panasas board now consists of seven members including Faye Pairman, president and chief executive officer, Panasas; Elliot Carpenter, chief financial officer, Panasas; and Andre A. Hakkak, founder and managing partner, White Oak Global Advisors.Panasas confirmed that ActiveStor Ultra is on track to begin GA shipments this summer.This article originally appeared in sister publication HPCwire.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2019-02-27 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "high performance storage",
        "Panasas",
        "scale-out NAS"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/high-performance-storage/",
        "https://www.enterpriseai.news/tag/panasas/",
        "https://www.enterpriseai.news/tag/scale-out-nas/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/Panasas-ActiveStor-Ultra-front-straight_Nov-2018_close-crop_750x-675x380-370x290.jpg",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/Panasas-logo-2014.jpeg",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/Jorge-Titinger-300x300.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}