{
    "title": "Chip Market Soared on Memory Demand",
    "text": "Global spending on semiconductors jumped a hefty 17 percent in 2017, driven by demand and corresponding price hikes for memory in datacenters and early industrial deployments of the Internet of Things.While memory prices and demand are expected to stabilize this year, a new round of AI and IoT deployments could fuel continuing growth in chip consumption, market watchers predict.Industry analyst IHS Markit reported this week that global chip spending reached $292 billion in 2017, a five-year high driven by price spikes for DRAM and NAND flash memory. The chip sector was contracting just two years ago but reach $250 billion in 2016.Last year's memory shortages were driven largely by growing demand by datacenter operators as they rolled out all-flash storage options used to speed access to big data. Meanwhile, analysts predicted last summer that server memory supplies would remain tight through the end of 2017.IHS said it expects memory prices to stabilize, with chip spending returning to single-digit growth this year. Nevertheless, other analysts are forecasting a wave of new memory technology deployments over the next five years. Last month, for exampled Gartner Inc. (NYSE: IT) cited continuing shortages of flash memory.Gartner also reported that memory chips accounted for more than two thirds of all semiconductor revenue growth last year, making it the largest chip category. \"If market equilibrium between supply and demand is reestablished for those memory components this year, prices will likely normalize,\" IHS predicted.Another reason why memory prices are expected to stabilize is the ramping of Chinese memory production over the next year, Gartner said last month.On the demand side, Apple and Samsung remain the largest consumers of semiconductors, while server makers Lenovo (third) and Dell Technologies (fifth) were among the top five largest buyers of memory and other devices last year.Wireless technology still accounts for more than one-third of global chip consumption. Manufacturers of servers and other \"computer platforms\" drove about 17 percent of annual sales last year. IHS also noted that the industrial and automotive sectors also fueled last year's robust chip growth as early IoT deployments ramp up.Server maker Lenovo accounted to an estimated $15 billion in chip spending last year as it targets the Asian server market. IHS reported that the Asian Pacific region is the largest consumer of semiconductors, followed by the Americas and Europe, the Middle East and Africa.Dell's chip purchases totaled about $9 billion last year. Hewlett Packard Enterprise accounted for about $6.9 billion in chip consumption, an annual increase of 28 percent. (See chart.)As the traditional memory chip market stabilizes, other market watchers are forecasting continuing growth in the so-called \"next-generation memory market.\" The main drivers are big data demand for in-memory processing, increasing requirements for enterprise storage of big data and the need for more bandwidth and scalable memory technologies for AI and IoT applications, according to Dublin-based analyst Markets and Research.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-02-07 00:00:00",
    "cats": [
        "Datacenter",
        "Manufacturing",
        "Slider: Datacenter",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/sectors/manufacturing-sectors/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "all-flash memory",
        "datacenters",
        "Dell",
        "global semiconductor consumption",
        "HPE",
        "IHS",
        "Lenovo",
        "Memory",
        "servers"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-memory/",
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/dell/",
        "https://www.enterpriseai.news/tag/global-semiconductor-consumption/",
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/ihs/",
        "https://www.enterpriseai.news/tag/lenovo/",
        "https://www.enterpriseai.news/tag/memory/",
        "https://www.enterpriseai.news/tag/servers/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/IBM-PCM-In-Memory-1017.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-07-at-11.13.32-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}