{
    "title": "At ISC: DDN Launches EXA5 for AI, Big Data, HPC Workloads",
    "text": "DDN, for two decades competing at the headwaters of high performance storage, this morning announced an enterprise-oriented end-to-end high performance storage and data management for AI, big data and HPC acceleration. In so doing, the company said it’s bringing to the burgeoning enterprise market for AI some of the transferable capabilities – with an emphasis on small file speed-ups required in AI workloads –that the company has developed for HPC.Launched here at the ISC High Performance Conference in Frankfurt, EXA5 is the newest version of DDN’s EXAscaler Storage, designed to make the EXAscaler infrastructure easier to consume by offering what the company said are deeper integrations into AI and HPC ecosystems through simpler implementation and scaling models, visibility into workflows and global data management features.DDN said EXA5 allows for scaling either with flash or with a hybrid approach “offering flexible scaling according to needs with the performance of flash or the economics of HDDs.” EXA5 is compatible with DDN’s AI pre-configured A3I storage appliances, reducing deployment time, the company said. Together they provide benchmarking, documentation and qualification with AI and GPU environments.“We’re looking to eliminate some of that sprawl going on at the back end,” Kurt Kuckein, DDN director of marketing, told us. “Data lakes and distributed types of architectures with tightly coupled compute and storage are not able to drive the performance needed, and some archived solutions out there are too deep to be accessible. So what we’ve done is deliver exceptional performance while managing the cost profile, whether it’s cost per gigabyte served or cost per gigabyte stored on the back end.”DDN’s objective, Kuckein said, is coupling best-in-class technologies, “extracting the ultimate value out of emergent architectures. “We hear about organizations frustrated, for example, by high end NVME systems, you put a file system in front of it and the performance would be cut in half.”EXA5 features and capabilities include:Strategem is DDN’s integrated policy engine for flash tiering with data management capabilities that DDN said enables users to manage most active data to scale-out flash tiers from scale-out hard disc drive (HDD) tiers. It also controls free space on flash, responding to changing demands and scanning storage devices directly to find target files.Integration with DDN Insight for real-time analysis providing visibility into software and appliances for monitoring of DDN EXAScaler GRIDScaler, SFA and IME platforms, Insight is designed to “derive the most value from storage infrastructures and sorts running jobs by metadata activity and throughput operations,” the company said. DDN Insight identifies problem jobs, resolves performance issues and it is scalable, allowing for open back-end database and integration with other systems and switches to cope with millions of stats per second, according to DDN.Gateway – DDN’s NAS type interface allows non-native DDN Lustre users to export file systems through DDN CIFS and NFS gateways, “providing another avenue to get access to high performance data,” the company said, “the supportive and robust solution can scale horizontally as needed to maintain consistency and lock semantics with Linux/Unix and Windows systems.Small File Acceleration - Complementary to DDN’s granular metadata scaling capabilities, EXA5 has been built to improve scaling across EXAScaler servers, allowing efficient application of flash to small files while expanding the domain of file sizes from a few KB to multiple MB, according to DDN.Kuckein said DDN’s small file performance is central to DDN’s efforts to enabling enterprise AI adoption.“We’ve focused on small file performance mainly because historically its’s been something HPC applications did not drive as much as needed,” he said. “Typically, you loaded in really big files for streaming bandwidth-intensive operation, and truth be told, the HPC community is going to benefit as HPC workloads become more small file driven. Particularly the AI workloads will be mixed-type, with unstructured data, this is driving demand for better performance on small I/O operations. So we’ve done a lot of work on metadata and allowing for more efficiency out of flash-based systems. We’ve added additional flexibility and tune-ability to these, so no matter what the file size is, they all benefit from these accelerations.”Data Protection – To guard against data corruption, EXA5 includes T10PI/DIX on an end-to-end basis, DDN said. With fully transparent applications, users are supported by EXAScaler through drives, resulting in minimal performance impact, according to the company.EXA5 takes a key tenant-based approach to application life cycle production sets, “all the way from the application user space to the commit on the disc itself, so there’s a verification with each step that’s fully transparent to applications,” Kuckein said.Security – EXA5 incorporates security measures that include KMIP and FIPS support plus EXA5 auditing capabilities and multi-tenancy.“It provides the ability to audit access,” Kuckein said, “…to track who’s accessing files, when, what they’ve changed, if things are being tested in terms of denied access, all of that is logged and securely recorded in a lock-down log that can then be accessed for later auditing. We’ve been working on the depth of information that we provide in EXAScaler, going all the way to the users’ activity, and that allows us to diagnose misbehaving users who might be sucking up all the performance on a system, or to help us help customers tune their applications for I/O performance. So it allows us to granularly go from the disc drive itself, whether it’s flash or spinning media, to the end user application to determine what’s going on.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2019-06-17 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Datacenter",
        "Security",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "data management",
        "data storage",
        "DDN",
        "high performance storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/data-management/",
        "https://www.enterpriseai.news/tag/data-storage/",
        "https://www.enterpriseai.news/tag/ddn/",
        "https://www.enterpriseai.news/tag/high-performance-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/data-storage-generic-big-data-systems-shutterstock_409479163--370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/DDN-EXA5-overall-schema-0619.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/DDN-EXA5-multi-tenancy-security-1.png"
    ]
}