{
    "title": "Google Adds More Cloud Features",
    "text": "Google continues to roll out new cloud features as it seeks to differentiate its platform from rivals with new tools and redundancy designed to boost application availability.Separately, Google also announced beta availability of new Google Compute Engine virtual machine instances with increased memory and greater computing resources.The public cloud competitor (NASDAQ: GOOGL) unveiled a new feature this week designed to allow the assigning of alias IP addresses to virtual machine network connections. “This is useful if you have multiple services running on a VM and you want to assign each service a different IP address,” the company said.The feature allows users to dynamically add or remove alias IP address ranges for existing virtual machines, meaning applications can migrate from one virtual machine to another in the event of a system crash. Google said the new cloud feature also works with Kubernetes Engine, the container cluster orchestrator.Google noted that its approach goes beyond standard cloud load balancing techniques since network traffic must be sent to a single server. The alias IP feature allows users to configure databases “to run using secondary IPs on the VM's primary network interface,” Google Cloud engineers explained in a blog poston Wednesday (May 16).“In the event of a failure, you can dynamically switch this IP to be removed from the bad VM and attach it to the new server,” they added.Along with improved application availability and security, Google said the new IP alias ranges also support “hot standby” deployments along with native access to Google cloud storage and the company’s BigQuery enterprise data warehouse.Meanwhile, new Google Compute Engine machine types dubbed “n1-ultramem” range from 40 virtual CPUs with 961 GB of memory up to 160 vCPUs with 3,844 GB of memory.Google said its memory-optimized machine types are geared toward data-driven enterprise workloads such as analytics, in-memory databases and HPC applications requiring more vCPU horsepower and system memory.The n1-ultramem machine type is designed to provision virtual machines with up to 160 vCPUs and nearly 4 TB of RAM. The memory-optimized machine types are powered by four Intel Xeon Processor E7-8880 v4 (Broadwell) CPUs and DDR4 memory. Hence, Google said they are geared toward critical enterprise applications.In one deployment example, Google said its machine type helps address SAP HANA (NYSE: SAP) implementations in the cloud, including the inability of finding sufficiently large instances. The ultramem machine type would eliminate the need to maintain databases on-premises while moving applications to the cloud, it asserted, adding that both applications and in-memory databases could both run in the cloud.Google said ultramem virtual machines can be launched now in its US-East and US-Central regions as well as its Europe-West region.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-05-16 00:00:00",
    "cats": [
        "Cloud",
        "Slider: Cloud",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "Google",
        "Google Cloud Platform",
        "in-memory",
        "Memory",
        "ultramem",
        "virtual machine instances",
        "VMs"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/google/",
        "https://www.enterpriseai.news/tag/google-cloud-platform/",
        "https://www.enterpriseai.news/tag/in-memory/",
        "https://www.enterpriseai.news/tag/memory/",
        "https://www.enterpriseai.news/tag/ultramem/",
        "https://www.enterpriseai.news/tag/virtual-machine-instances/",
        "https://www.enterpriseai.news/tag/vms/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/google-cloud-platform-logo-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}