{
    "title": "Zadara Offers Pay-As-You-Go Virtual Storage",
    "author": "George Leopold",
    "date": "2014-08-07 00:00:00",
    "text": "The list of Things-as-a-Service keeps growing.Zadara Storage has rolled out the latest entry with the introduction of On-Premise-as-a-Service (OPaaS), targeting private clouds that include managed storage area network and network-attached storage.The twist here is a flexible \"pay-as-you-go\" pricing model similar to other cloud-based options, eliminating upfront costs while allowing on-demand storage purchases. The non-lease scheme allows customers to leverage storage resources owned and managed by Zadara on demand, thereby cutting upfront capital expenditures.The enterprise storage service delivers Zadara's Virtual Storage Private Array (VPSA), which that the Irvine, California company said is deployed in North America, Europe, Asia, and Australia. The service can be physically delivered to an enterprise or through a co-location or service provider, Zadara said.The pricing model allows users to scale storage resources up or down from an online console even though those resources are owned and maintained by Zadara. Options include disk drives or SSDs.Zadara's approach is intended as an elastic, managed network-attached storage and storage area network \"with cloud capabilities built on top of it,\" market researcher Ben Woo explained in a testimonial provided by Zadara.A Zadara customer praised the OPaaS offering for helping to reduce its capital expenditures while freeing it from the \"mundane grunt work of managing a storage infrastructure.\"The VPSA service targets enterprises that need from 20 terabytes to multiple petabytes of primary storage applications. Customers must commit for a minimum of six months and are bill based on consumption of storage resources managed by Zadara.The company said VPSA storage could be linked in public clouds like Amazon Web Services and Microsoft Azure along with colocation services from Coresite, Equinix, and others.The private cloud services also can be replicated in public clouds to enable hybrid cloud storage. Zadara also promotes the storage service as compatible with applications benefitting from cloud-based disaster recovery and \"cloud bursting\" where extra storage resources supplement on-premise storage.Zadara CEO Nelson Nahum said the VPSA storage services addresses the needs of enterprises that must keep applications on premise and behind firewalls. That requirement, he added, precludes these organizations from gaining the benefits of software-defined storage.In a blog post, the company noted the steady evolution of how enterprises buy and use computing and networking resources, including virtualization and software-defined networking. \"Traditional storage vendors have failed to keep up with these changes, and most [storage area networks] you find today are basically the same beast they were 10 or even 15 years ago,\" the company asserted.The \"pay for consumption\" pricing model includes a \"fixed\" plan based on the number of storage nodes needed, starting at a minimum of two nodes. The other option is based on storage use and is pitched as being more flexible.The minimum six-month commitment compares with storage leases that average between two and five years, the company noted.Zadara said its VPSA storage service is available immediately and costs on the order of pennies per gigabyte per month. As you add nodes, the prices get cheaper because the original two nodes include the networking required to scale out the storage.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/08/zadara-logo.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/08/zadara-positioning.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/08/zadara-hubs.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}