{
    "title": "HPE’s ‘Memory-Driven Computing’ Vision Emerges in New Server Options",
    "author": "Doug Black",
    "date": "2016-04-01 00:00:00",
    "text": "HPE launched new ProLiant9 server options this week that include built-in support for persistent memory, a new HPE product category that the company regards as the inception point for “memory-driven computing,” combining the performance of high-speed memory with the persistence of storage that retains data during power shut downs.While NVDIMMs (Non-volatile Dual In-line Memory Modules) are not new, HPE (NYSE: HPE) said ProLiant9 is the first server product line with the persistent memory technology fully integrated and optimized.“It’s the first step on the road to a new programming paradigm,” said Bret Gibbs, HPE persistent memory product manager, “one where data is always persistent and we can throw away millions of lines of code that do nothing but move data between volatile working data structures and permanent storage.\"HPE’s venture into persistent memory has important implications for server-based storage, Gibbs said, because HPE’s NVDIMMs combines the low latency / high performance of DRAM (8GB) with resilience, reliability and low cost of NAND flash (8GB) and magnetic media. In ProLiant9 servers persistent memory resides at the point where NAND flash meets DRAM on the same DIMM form factor. The objective, he explained, is to provide the speed and endurance of memory, but if the power supply fails the server relies on battery power to back up DRAM data to the flash.“Our primary focus is around database and analytics workloads,” Gibbs told EnterpriseTech, “but certainly anywhere you see storage hardware bottlenecks today, such as databases specifically around the transaction model where most of the write commands are coming from the applications, are a good candidate for NVDIMMs. This is a technology that resides on the memory bus, you’re running at memory speed because you’re running on DRAMs and the NAND Flash is deployed as a persistent store.”HPE said internal tests show 2x to 4x performance improvements. Using an HPE ProLiant DL360 Gen9 server with 400GB SSDs, a Microsoft SQL server transaction log showed 970,000 transactions per second with log write latency of 372 microseconds; the same server with 8GB NVDIMMs showed 1.08 million transactions per second with latency reduced to 181 microseconds.HPE’s persistent memory strategy includes commitment to an ecosystem of companies working to optimize adoption of the technology. Gibbs said that in storage, hardware customarily is the bottleneck because software often sends commands faster than the hardware can process. But with persistent memory, unmodified software could become a bottleneck, so HPE is working with application and OS providers, including Microsoft, Linux, Red Hat and Hortonworks, to ensure that persistent memory technology “really flies,” he said.The new HPE servers incorporate Intel’s new Xeon E5-2600 v4 processor, (see related story), boosting ProLiant Gen9 performance by up to 25 percent. They also offer high--speed DRAM in multiple configurations. For highest performance environments, HPE 128GB LRDIMMs offer extra density that deliver up to 23 percent better performance. HPE NVMe SSDs offer up to 2TB of storage for high-end workloads.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/HPE-ProLiant-4-16-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/HPE-NVDIMM-1-300x158.png"
    ]
}