{
    "title": "Flash Array Aimed At VDI Heals Other Hospital Applications",
    "text": "When the folks at Shannon Medical Center decided to begin a virtual desktop infrastructure (VDI) project to eliminate traditional PCs, their research showed how critical I/O would be to the success of the project. But when the 400-bed hospital actually implemented the flash-based array from Violin Memory, they were surprised by the impact it had on other clinical healthcare applications.Shannon Medical Center is on the leading edge of the VDI trend in healthcare IT, which is seeing traditional fat-client PCs replaced with dumb-client terminals. Instead of running Windows, Office, and clinical applications on the local desktops and storing data locally, everything runs on a centralized server, and the data is housed in a central storage array where it is safe and secure.Shannon Medical took ownership of its first Violin 6000 Series last summer and began the process of transitioning all of its 2,700 Windows desktops to virtual machines running in a server. The hospital adopted Cisco Systems UCS blade system and VMware's hypervisors due to the high level of density it could get with this setup--30 virtual desktops per server with Cisco UCS and VMware, versus about seven with Microsoft Hyper-V running on IBM X86 servers. It eagerly adopted Unidesk for its nifty trick of de-duping 2,700 of copies of Windows and Word down to one.Today, Shannon Medical is about half way through its VDI roll-out, and the doctors and nurses are generally happy with the performance. \"I think everybody who switched over has noticed it. They're actually quite angry to have to go back,\" Shannon Medical's assistant director of IT Mike Russell tells EnterpriseTech. \"I have one doctor who pretty much refuses to use a traditional computer now. He only wants to use the VDI zero clients wherever we put them. He's also using an iPad, which VDI allows too.\"Storage Made FlashyLatency, as measured between the database and the application layers, is less than 1/10 of a microsecond for the hospital. That incredibly low figure is possible because the clinical applications and their databases run directly on the Violin array, too.To make the economics of the Violin array work, the San Angelo hospital moved six other big database-driven applications from its IBM SAN arrays to the Violin flash array, including its core SQL Server-based McKesson Paragon electronic medical record (EMR) application. While the array plugs into Shannon Medical's existing storage network via 8 Gb/s Fibre Channel connections, the VDI environments talks directly to the McKesson apps over a 10 Gb/sec iSCSI backplane.In fact, everything runs so smoking fast within the flash array that it actually exposed some coding errors and performance problems within the McKesson apps themselves. Russell says they discovered a bug in McKesson's Paragon that was due to the application getting information returned to it so quickly. After working with SQL experts from Violin, the company was able to address the problem.Shannon Medical is still living with the other performance problem, which involved a seven second delay between the user pressing a mouse button and it registering in the application. \"They always blamed that on the database and storage,\" Russell says. \"When we moved to Violin and did a test, we could show the storage level was taking 0 seconds. The client was taking seven seconds to display the information.\"Today, that lag is down to three or four seconds. There isn't much Shannon Medical can do about that. \"There's still some lag in the product. It's not Earth shattering. We don't have doctors calling down here and threatening us anymore. I don't have to worry about my tires being flattened everyday,\" Russell says, jokingly.Being on the cutting edge has its benefits, but there are disadvantages too. \"The most difficult part with Violin is explaining to vendors who have pretty strict specifications on how many spindles and the speed of spindles and all this stuff,\" Russell says. \"When you try to explain to them that there are no more spindles anymore, they get really antsy. They don't like it.\"The hospital is a beta test for another McKesson product, called Patient Folder. Violin spits data out so fast that it hides problems that might be lurking in the software, Russell says. \"They noticed that it was faster than what they expected, and so they had to take that into account when they moved onto another beta site,\" he says.High I/Os Unexpected BenefitsThe VDI project was all about giving nurses and doctors secure interfaces to the hospital's core apps. But the move to the Violin array has also benefited batch processes, such as reporting. In fact, there is so much I/O available now that running a big report has no discernable impact on user response times.Reports that previously took two days to complete are now completed in two hours, while reports that took six hours are now done in ten minutes. \"People are now running reports against a live database since it is so much quicker and it doesn't affect performance of the end user,\" Russell says. \"They don't notice it.\"The Violin array has been able to handle all natural workloads without a hiccup, including the addition of several hundred VMs at one time and big nighttime database consistency checks. \"None of the systems have shown any impact,\" Russell says. \"It's been able to handle everything so far. It's definitely not a bottleneck.\"The only bottleneck the hospital has seen so far is the Fibre Channel connection going into the Cisco system. \"We're talking 32Gb of bandwidth being a bottleneck,\" Russell says. \"It's pretty rare that we get anywhere near that [during the course of normal operation]. But we have been able to falsely provide that by running different scripts.\"Moving the McKesson apps over to the Violin array has given new life to Shannon Medical's existing SAN arrays, including IBM one DS4800 and two DS3700s, which together hold about 200TB of data. \"We didn't think about it at the time, but moving these really talkative systems off the IBM arrays made the IBM perform better for all the other systems that were left behind,\" Russell says. \"We only had five or six system that were really talkative, but they were bogging down the IBM storage.\"Shannon Medical ran into one problem with the Violin array itself. It turns out that the first array it bought had a version of the Violin firmware that was not hot upgradable. That was going to be a problem for the hospital, which rarely has the time for any sort of planned downtime and is online 99.9 to 99.99 percent of the time. Violin addressed the problem by shipping the hospital a newer and bigger 18TB array that had a version of the firmware that could be upgraded without shutting down.Besides that unexpected snafu, there was one memory module that went bad, but that's not uncommon with these systems. Violin includes hot swappable modules in the arrays, and it made sure that the hospital had a backup module onsite. \"Because we're in the middle of  nowhere in Texas, they left a memory module here as a precaution,\" Russell says. \"They've been great to deal with. Any questions we have, we normally get a response within an hour.\"If there's one issue that organizations like Shannon Medical will eventually have to cope with when it comes to using super-fast storage is a tendency to become dependent on it, especially as data volumes continue their relentless climb. \"If we ran out of space, it would be pretty easy to justify the cost of a new one,\" Russell says. \"Eighteen terabytes is quite a bit for tier 0.  But I'll bet in three to four years it will be a drop in the bucket for tier 0.\"Rumor is that Shannon Medical's imaging department is eyeing a shiny new CT scanner that can take pictures with an amazing amount of resolution. One machine like that, and the IT department may need another Violin, or two.Alex Woodie has written about IT as a technology journalist for more than a decade. He brings extensive experience from the IBM midrange marketplace, including topics such as servers, ERP applications, programming, databases, security, high availability, storage, business intelligence, cloud, and mobile enablement. He resides in the San Diego area.",
    "author": [
        "Alex Woodie",
        "https://www.enterpriseai.news/author/alex/"
    ],
    "date": "2014-03-13 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Healthcare",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/sectors/healthcare-sectors/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Flash",
        "McKesson",
        "VDI",
        "Violin"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/mckesson/",
        "https://www.enterpriseai.news/tag/vdi/",
        "https://www.enterpriseai.news/tag/violin/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/shannon-medical-370x290.jpg",
        "https://secure.gravatar.com/avatar/b0307dd70ffe024a023722c06b737966?s=80&r=g"
    ]
}