{
    "title": "Red Hat Rolls ‘Container-Native’ Storage",
    "author": "George Leopold",
    "date": "2017-10-05 00:00:00",
    "text": "Cloud-native applications being delivered via application containers now have the option of using what open-source leader Red Hat calls \"container-native\" storage integrated with the latest version of its RedShift container platform.Red Hat released an update to its container platform this week as the latest version of its Kubernetes-based container application platform unveiled in August. That was preceded late last year by the release of a \"dedicated\" version of the OpenShift container platform running on Google's Cloud Platform (NASDAQ: GOOGL). The partners said last December the OpenShift platform would help speed adoption of application containers running on Google-developerd Kubernetes along with emerging cloud-native applications.The latest version of the OpenShift container platform unveiled Thursday (Oct. 5) is built on Red Hat's Gluster software-defined storage that when integrated with OpenShift is designed to deliver storage via containers. Red Hat (NYSE: RHT) is promoting the release as suited to hybrid cloud deployments since it is designed to eliminate the need for independent storage. That, the company asserts, provides an integrated container platform that spans on-premise or public cloud deployments.The rise of application container infrastructure is driving requirements such as persistent storage. Hence, Red Hat stressed flexibility by adding support for file, block and object storage interfaces that it claimed would enable \"container applications portability to the container platform without change.\"Meanwhile, block storage would help support distributed databases and other low-latency workloads, the company noted, while object storage provides an \"embedded object store\" within the container platform for cloud-native applications requiring protocol support akin to Amazon Web Services' (NASDAQ: AMZN) Simple Storage Service.\"The addition of support for a broad range of storage workloads, the support for the Red Hat OpenShift Container Platform’s core infrastructure pieces and increased persistent volume density are key features to help customers support present and future datacenters,\" Ranga Rangachari, general manager of Red Hat's storage unit, noted in a statement.The upgrades respond to the growing requirement to support containerized applications and micro-services infrastructure with integrated storage platforms that scale across hybrid cloud deployments.Market analyst estimated the application container segment reached a robust $762 million in 2016 and is forecast to grow at a 40-percent compound rate over the next four years to $2.7 billion.Red Hat said its container-native storage platform would be available later this month.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}