{
    "title": "Micron Pushes Memory Roadmap On Several Routes",
    "text": "Memory maker Micron Technology has a bullish roadmap for DRAM, flash, and other technologies that will very likely be in a system, switch, or other device near you in the not-too-distant future.Micron talked up its technology roadmap and other aspects of its business at a recent analyst day, and CEO Mark Durkan started off by acknowledging that DRAM and NAND memory supply growth is in decline. However, Micron still expects to double these areas over the next three to four years. The company says it will close this supply and demand gap by deploying advanced technology and by making incremental improvements to existing facilities.Durkan gave the nod to five major tech trends: networking, machine-to-machine, mobile, cloud and big data. The CEO envisions a big system in which \"[networking] feeds machine-to-machine communications and those feed mobile networks which feed the cloud, which feed big data. None of these segments go away as we ripple to the right [of the slide] and drive more and more memory usage into the system, they all just build on each other and drive memory usage going forward.\"The company's overriding strategy is to drive business to higher value segments with enterprise storage, networking, and the embedded space all getting a significant slice of the pie (notably mobile has been allotted the largest slice).The company also updated its roadmap for DRAM, NAND, and new memory process technology as depicted in the slide below.There has been an increased emphasis on the DRAM technology roadmap since Micron bought Elpida last July, and Micron is preparing for the execution of 25 nanometer and 20 nanometer DRAM before the end of the year. In the NAND flash arena, the company is experiencing the most rapid yield ramp in Micron's history with 16 nanometer planar NAND, and development of 3D NAND is progressing with delivery slated for early 2015.At the high-performance end of the memory market, Micron is poised to deliver on its Hybrid Memory Cube (HMC) promise, with initial interest coming from the supercomputing and networking communities; high frequency traders are also probably interested, but generally don't talk about their plans. The company has 2 GB and 4 GB options currently shipping as engineering samples and multiple partner demo platforms are up and running. Although full volume production is anticipated in the fall of this year, the company says that 2015 will be the \"needle mover\" as far as revenue is concerned.HMC combines high-speed logic and DRAM layers into one optimized 3D package, providing a high speed interface to a processor. HMC is said to enable \"dramatic improvements in performance\" with a single module providing more than 15 times the performance of a DDR3 module, while drawing 70 percent less energy per bit.Potential markets for HMC include servers, networking, graphics, clients, and embedded devices in the automotive space, but right now Micron is primarily targeting high-performance computing as well as the networking space, where HMC is positioned as a key driver for 100 Gb/sec and 400 Gb/sec network backbones where memory bandwidth is going to play a key role in switches and routers.In reference to 20 nanometer DRAM, MLC/PCIe Enterprise SSD, the Hybrid Memory Cube, and other differentiated memory solutions, CEO Durkan points out \"those types of products take longer to develop and to interface to customer end-systems, but they can deliver value in an environment where they are not competing with a commoditized product next year that is 40 percent cheaper than the one the previous year.\"Brian Shirley, vice president of DRAM Solutions at Micron, discussed Micron's non-volatile DIMM (NVDIMM) solution, designed for the needs of enterprise customers.The NVDIMM combines DRAM plus NAND on a single module, which gives DRAM performance but the persistence of data once power is withdrawn from the module. The NVDIMM modules include an ultracapacitor, a self-contained energy source for use during power outages, while an integrated controller offers NAND management and high-speed direct memory access (DMA). Micron is targeting this solution squarely at enterprise systems and specifically at the oil and gas, financial services, medical research sectors and various analytics workloads that cut across all industries.\"To the user, the DIMM looks just like a memory module,\" explains Shirley. \"You plug it in the same way, same interface, but on that module there is actually a controller and Micron NAND behind that. So for data recovery for system check pointing, the module is actually capable of persistent storage and that ends up being something very, very interesting to just about every server OEM we're selling to. This is here now at DDR3 and getting some great traction, and in 2014, you will see this extended up to DDR4.\"Overall, Micron is counting on the continuing popularity of NAND and DRAM for large swaths of the memory business for at least the next five years and even further out for some segments. But it is also looking to develop differentiated memory technologies. To that end, the company has identified two target areas, very high performance, non-volatile memory on one side, and what the company calls storage-class memory, which is non-volatile but offers a bit better performance than NAND, on the other side.Meeting the business needs of today while innovating for the future is a balancing act to be sure, and Micron has ridden this wave to become one of the top semiconductor companies. It will be interesting to see how the proposed roadmap takes shape in the months ahead.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2014-02-20 00:00:00",
    "cats": [
        "Energy",
        "Financial Services",
        "Life Sciences",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/sectors/energy-sectors/",
        "https://www.enterpriseai.news/category/sectors/financial-services-sectors/",
        "https://www.enterpriseai.news/category/sectors/life-sciences-sectors/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "DRAM",
        "Flash",
        "HMC",
        "NVDIMM"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/dram/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/hmc/",
        "https://www.enterpriseai.news/tag/nvdimm/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/micron-hq-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/Micron-Technology-Timeline.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/Micron-Non-Volatile-DIMM.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}