{
    "title": "Software Investments Propel IT Spending",
    "text": "Enterprise software and infrastructure services continue to fuel the growth of global IT spending to levels not seen in a decade, according a new spending forecast.Gartner Inc. report this week that macroeconomic factors such as a weak U.S. dollar along with robust telecommunications spending have boosted its quarterly forecast for IT spending growth to 6.2 percent, the highest annual increase since pre-recession 2007.The only laggard identified in a quarterly IT spending forecast released on Monday (April 9) was datacenter investments, which have been steadily slowing as more companies shift internal operations to the cloud. The market watcher predicts that datacenter spending will grow only 3.7 percent this year, down from 6.3 percent in 2017.Datacenter spending might have been less without Apple’s ambitious roadmap for spending more than $10 billion over the next five years on datacenter construction.Gartner predicts continuing challenges in the storage sector, which is still working through memory shortagesthat were initially expected to ease this year. Continuing high demand for components like server DRAMs have added to tight supplies and higher prices. “Whereas previously, component shortages were expected to ease into 2018, the shortages are now expected to continue throughout the year with the supply not expected to ease until the end of the year,” Gartner said.Meanwhile, a host of agile IT capabilities such as micro-services are driving enterprise software spending, especially the high-flying application software sector. Gartner forecast that the enterprise sector will grow at a robust 11.1 percent this year as more businesses jump on the digital transformation bandwagon.With new micro-services such as application containers entering production, the market analyst predicts that spending on application software will continue to grow through 2019. So, too, will infrastructure investments as modernization efforts gain momentum.Gartner reported last summer that emerging software servicessuch as advanced analytics would propel application software sales to more than $200 billion by 2019. The 7.5-percent growth rate is being driven by upgrades to core enterprise applications along with the embrace of subscription-based models such as software-as-a-service.Emerging models such as pay-as-you-go serverless computingcould help sustain that growth trajectory. Also referred to as functions-as-a-service, the serverless framework is designed to allocate computing resources as needed to run a customer’s code rather than charging upfront for dedicated capacity.\"This is the highest annual growth rate that Gartner has forecast since 2007 and would be a sign of a new cycle of IT growth,” said John-David Lovelock, Gartner’s research vice president. “However, spending on IT around the world is growing at expected levels and is in line with expected global economic growth.”Gartner (NYSE: IT) noted that a declining U.S. dollar and resulting “currency tail winds” contributed much to robust growth in global IT spending. Market volatility is expected to grow on fears of a trade war between the U.S. and China, it warned. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-04-10 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "application software",
        "datacenter",
        "enterprise software",
        "FaaS",
        "Gartner",
        "global IT spending",
        "SaaS",
        "serverless"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/application-software/",
        "https://www.enterpriseai.news/tag/datacenter-2/",
        "https://www.enterpriseai.news/tag/enterprise-software/",
        "https://www.enterpriseai.news/tag/faas/",
        "https://www.enterpriseai.news/tag/gartner/",
        "https://www.enterpriseai.news/tag/global-it-spending/",
        "https://www.enterpriseai.news/tag/saas/",
        "https://www.enterpriseai.news/tag/serverless/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/Screen-Shot-2016-07-21-at-11.33.50-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}