{
    "title": "Flash Storage Delivers Savings for Email Hosting Firm",
    "text": "Simply by changing its storage technology, a fast-growing SaaS and application provider cut energy costs, eliminated support overhead, and freed up terabytes of storage, while simultaneously improving customer service.BlueTie, a 15-year-old provider of hosted email and calendar solutions for small and midsize companies, was at the end-of-life for its existing storage infrastructure when it began researching alternatives, CEO Robert Doty told Enterprise Technology. A piecemeal upgrade was unattractive for both financial and technological reasons: After all, BlueTie was paying between $60,000 and $70,000 per year on support costs alone for its 100 terabytes of storage, he said. And the existing system was power- and space-hungry, Doty added.An at a lunch and learn several months earlier prompted BlueTie to further investigate Nimble Storage's Adaptive Flash arrays, he said. The hosted email provider brought in a demo unit for a trial and transitioned about 200 email accounts to the adaptive flash array, said Doty.\"The performance was far beyond what we expected it to be. We then moved all the [800,000-plus] mailboxes to that unit to really give it a stress test – but all those mailboxes didn't stress the technology out,\" he said. \"We made the buy decision right there to go ahead and purchase the Nimble [solution] and get rid of the other system.\"In addition to reducing support costs, Nimble's flash technology allowed BlueTie to consolidate backup servers. Today it operates 10U compared with 33U after reducing its footprint to 12U of Nimble versus 3-1/2 racks of Hitachi BlueArc network-attached storage (NAS), said Doty. That reduction saved space and electricity – between $30,000 to $40,000 annually, he estimated.\"We're easily saving $100,000 a year. When you look at the ROI of that and what Nimble costs, it pays for itself in a couple of years,\" he said. \"Because of the performance gains we got, we were able to rearchitect our system, too. We eliminated our old compression software and were able to achieve better compression ratios.\"In addition, the company freed up an additional 16 terabytes of storage, according to BlueTie.The price of I/O intensive storage – including flash, SSD, and SSS – is falling, and expected to drop to $1.07 per gigabyte by 2016, versus $8.15 per gigabyte in 2012, according to IDC.Service is improved due to Nimble's caching technology, an approach that differentiated it from other flash arrays which used a tiering architecture, said Doty. Because most users read email within minutes of receiving a message and since all email is read within 48 hours of arrival, it's critical for BlueTie's storage system to make messages instantly available to users, he said.\"In the old architecture we'd store it all on disk and there'd be no caching mechanism. The system would go find [the email] on disk. It would slow everything down,\" said Doty. \"The way Nimble caches all that email coming in and makes it instantly available to people when they need it speeds up all the transactions. Even if it has to go down to storage to retrieve a message, it's very efficient. We haven't noticed any performance degradation.\"In the past, users might have experienced a couple of seconds of latency, he said. \"Now it's more of an instantaneous experience,\" added Doty.The IT department also has an improved experience via access to more in-depth operations. Instead of doing a file backup that took a week, now system analysts run a backup, index the data, make it searchable, and further enhance the backup.\"It made my IT team happier because now they can do more because the performance of the system has improved so much,\" said Doty. \"It definitely allows us to be more responsive with a request. If a customer has a restore request or needs us to find something in real-time, the data is more accessible.\" Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-06-15 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Adaptive Flash",
        "BlueTie",
        "flash storage",
        "nimble storage",
        "Robert Doty"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/adaptive-flash/",
        "https://www.enterpriseai.news/tag/bluetie/",
        "https://www.enterpriseai.news/tag/flash-storage/",
        "https://www.enterpriseai.news/tag/nimble-storage/",
        "https://www.enterpriseai.news/tag/robert-doty/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/mail-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}