{
    "title": "3+ Months after Launch, Wasabi’s Assault on S3 Said to Be on Plan",
    "text": "David Friend comes across as a modest, unassuming fellow who talks about his start-up storage company, Wasabi, and its technology in an understated, commonsensical kind of way. But make no mistake, Friend is pursuing a grand ambition that takes dead aim at a big target: the public cloud storage market, which Wasabi intends to turn on its head.Last May, we covered the Wasabi launch, highlighted by the company’s promise of significantly outperforming and underpricing S3, the storage tier within AWS, while remaining compatible with the AWS ecosystem. Assuming Wasabi could deliver on its promises, we thought the company had the potential to address the advanced scale computing market’s voracious appetite for quickly accessible data at scale - and thus become a player in the healthiest growth sector, according to several studies, in the high performance computing industry.Industry analysts were impressed. “I think there will be plenty of demand for that type of storage – increasing demand,” said Andrew Smith of IDC last May. “The trends we continue to see – the incredible volumes of data, the increasing value of data, customers are looking to get not only the cheapest storage but also the best access to that type of info and to be able to utilize it in different ways. So this is a good foot in the door for Wasabi.”We contacted Friend this week for an update on Wasabi, and he told EnterpriseTech that in the three-plus months since the launch Wasabi has exceeded internal expectations. He said the company attracted nearly $11 million in additional investment that will be used to open a second data center on the West Coast (location undisclosed) this fall to complement the initial data center is in Ashburn, VA.Friend also said that roughly 600 companies are at various stages of evaluating Wasabi and that 100 have become paying customers.“It’s the first time I’ve had a product where you don’t actually need to explain what it does,” said Friend, a co-founder of Carbonite, which debuted in 2006 and rapidly became dominant in the consumer back-up storage market. “Everybody knows what Amazon S3 is, and if you know what Amazon S3 is you know what Wasabi is. Except we’re 1/5th the price and six times as fast. There’s no explanation needed. I don’t have to sell anybody on this product.”He said Wasabi’s problem is a “too good to be true” skepticism among prospective customers. To counteract that, Friend said the company offers open testing, with specs available on the Wasabi web site and the code to run those tests in Amazon EC2 in the GitHub development and testing platform. “So go run it yourself,” he said.Another potential threat is a crushing Amazon price cut, but Friend professed no fear on that score.“A lot of people say Amazon’s going to drop their price and put us out of business,” Friend said. “That’s always a possibility, but it seems highly unlikely to me. If you’re sitting on $5 billion worth of storage revenue at Amazon and somebody says ‘We ought to cut our price by 80 percent because there’s this little start-up in Boston running annoying advertising,’ it seems to me we’re going to have get pretty big before Amazon will decide to do anything about us. Amazon has a hundred other products taking priority over this.”Friend said the other hurdle Wasabi has to overcome, which relates to the growing value companies place on their data, is reluctance to do business with a new storage company.“That’s probably our biggest negative…,” Friend conceded matter-of-factly. “That’s going to take time.”For this reason, some customers are, at least for now, placing Wasabi in a subordinate storage role, as a back-up location for their primary storage – which typically is either S3 or in an on-premises data center.“That’s the most common situation,” Friend said, “they have one copy someplace else and another copy with us.”As for the pending second data center, Friend said it’s targeted at West Coast businesses who want to reduce the latency entailed in retrieving data from the other side of the country, or for companies that, for regulatory or other business reasons, need to have two copies of their data stored in separate regions.At the time of the company launch, Friend declined to disclose specifics on Wasabi’s claimed 6X performance advantage over S3. During this week’s interview, he said few people have taken the time to delve into how storage technology actually works.“If you’re relying on Linux or Windows or some operating system to control how the bits are physically written to disk, you’re never going to get to our price or our performance,” he said. “This is why it took three years to build this product, after having spent 10 years building a previous version at Carbonite. You have to go in and take control of the heads on the disk drives. And you have to write the data to disks the way you want to write it to disk, not the way Microsoft or Linux wants to write it to disks. Those operating systems were not specifically designed to do the kind of data storage that we do. They were designed for a variety of things that go on inside of a PC.“You’d be hard-pressed to find a developer who’s ever touched any part of that stack. It’s a very arcane end of software. Outside of the team we’ve put together at Carbonite, I’ve never met anyone who’s been told they have to figure out how to write the bits to the disk. You start thinking about sectors and tracks, the movement of the heads on the drives – things like that. Nobody ever has to worry about that. We do. That skill and that ability to really control those disk drives in a way that’s optimized for our particular application is what gives us the ability to do what we do.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-08-10 00:00:00",
    "cats": [
        "Cloud",
        "Slider: Cloud",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS S3",
        "cloud storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws-s3/",
        "https://www.enterpriseai.news/tag/cloud-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/David-Friend-Wasabi-8-17-300x300.jpeg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/Wasabi-logo.png"
    ]
}