{
    "title": "Intel, Micron Up the Ante for Flash Memory",
    "text": "Chip makers continue to gear designs toward AI and other demanding cloud workloads that take advantage of datacenter flash storage capacity. To that end, memory specialist Micron Technology Inc. began shipping compact solid-state drives this week based on its quad-level cell (QLC) NAND technology that addresses enterprise markets currently relying on hard-disk storage.Separately, Micron and Intel Corp. announced shipment of what they claimed is the highest density flash memory based on the partners’ 3-D NAND technology. The chip makers said theirs is the first commercially available 1-terbit die with 4 bits/cell density.Micron (NASDAQ: MU) said its new quad-level 5210 ION SSDs provide a 33-percent boost in cell density compared with triple-level cell NAND architectures. The higher bits-per-cell capacity is aimed at read-intensive cloud storage requirements created by AI, big data, business intelligence, database and other real-time workloads.The chip maker argues that most enterprise data types must be “read far more often than they are written.” Hence, its QLC NAND flash storage approach is intended to speed access to and the serving of big data while accelerating other cloud workloads.Anticipating the expansion of flash storage in enterprise datacenters, the chip maker also said Monday (May 21) its QLC NAND architecture can reach densities of 1 terabit based on its 64-layer 3-D NAND design. The memory advance is touted as allowing enterprise and cloud customers to deploy NAND flash technology “across an expanding array of workloads that were previously relegated to slow, power-hungry hard drives,” said Sumit Sadana, Micron’s chief business officer.Micron added that the new SSD is being released in a 2.5-inch package—an inch less than traditional HHDs—in a form factor designed to help reduce server sprawl by reducing the number of racks. Compared with HDDs, the company estimates the smaller package can reduce datacenter rack space by more than 40 percent.The company also claims a three-fold reduction in power consumption compared with equivalent capacity HDDs as measured in read I/O power per drive.Meanwhile, Intel (NASDAQ: INTC) and Micron said qualification testing of a 64-layer 3-D NAND has been completed. A third-generation design will continue scaling up to 96 layers, further boosting the flash memory’s areal density. The density increases are achieved, they said, by doubling the number of planes used to four, enabling the NAND flash memory to read more cells in parallel.“Commercialization of 1-Tb 4bits/cell is a big milestone in [nonvolatile memory] history,” noted RV Giridhar, vice president of Intel’s Non-Volatile Memory Technology Development unit. \"The move to 4-bits/cell enables compelling new operating points for density and cost in datacenter and client storage.\"Micron revealed at least one customer this week for its new line of NAND flash-based SSDs: Chinese search giant Baidu Inc. (NASDAQ: INTC), which said it would use the storage platform for its cloud and AI services.--Editor's note: The headline on this story has been corrected. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-05-22 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "3_D NAND",
        "AI",
        "data analytics",
        "datacenter storage",
        "flash memory",
        "Intel",
        "Micron Technology",
        "SSD"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/3_d-nand/",
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/data-analytics/",
        "https://www.enterpriseai.news/tag/datacenter-storage/",
        "https://www.enterpriseai.news/tag/flash-memory/",
        "https://www.enterpriseai.news/tag/intel/",
        "https://www.enterpriseai.news/tag/micron-technology/",
        "https://www.enterpriseai.news/tag/ssd/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/Screen-Shot-2018-05-22-at-12.12.13-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}