{
    "title": "HPE’s New Round of Multi-Platform Storage Networking Products",
    "text": "HPE announced several storage networking-related products today, along with the global expansion of its “Complete” reseller model for virtually engineered third-party solutions. Designed to support multiple network protocols and multiple vendor partners, the combined announcements encompass some of the data storage industry’s leading lights, including Qumulo, Cohesity, Cloudian and Hedvig – along with HPE’s own Nimble Storage and Simplivity lines.HPE’s evolving StoreFabric products, including the Smart Fabric Orchestrator (SFO) and M-series Ethernet switches, built in partnership with Mellanox, support storage networking solutions spanning primary storage, secondary storage, hyperconverged storage, NAS and object, according to HPE.“Existing storage networking solutions had been developed for primary storage only,” stated Marty Lans, GM of HPE’s Storage Connectivity Engineering & Global Interoperability Business Unit, in a blog, “and while still critical for most existing enterprises, were not developed to take advantage of or enable optimal use of new media or new storage technologies. As a system vendor…, we have visibility into challenges and solutions that others with a singular focus don't have.”The HPE StoreFabric SFO is designed to address the tedious and error-prone work involved in network configuration, simplifying storage networking and cutting costs. Orchestration automation enables storage admins to zone and provision storage in a few clicks and to orchestrate fabric services, reducing both storage and SAN configuration experts “while freeing up resources to focus on business outcomes,” Lans said.Meanwhile, the HPE SN2010M StoreFabric M-series Switch is designed to allow HPE storage vendor partners “do more with less,” said Lans, “to support more apps, more users and more locations with higher performance and lower latency while reducing cost, space and power.”The SN2010M is a ½ rack TOR switch with 18 ports of 1/10/25GbE and 4 ports of 40/100GbE in each, enabling full redundancy in 1RU, according to HPE. Breakout cables enable users to expand 1X100GbE port to 4X10GbE or 4X25GbE.Among the benefits of the Ethernet-based SN2010M, according to the company:“When you use a traditional Ethernet fabric, you lose the differentiation that these platforms are developed to provide,” said Lans. “Storage traffic sent over a traditional fabric is effectively stunted as soon as it hits the network. High performance and the scale it enables is why HPC uses InfiniBand and why most primary storage uses Fibre Channel. It is also why we felt that a new network fabric, one built from the ground up for secondary flash-based storage, was needed. What Fibre Channel does for primary storage, we're now doing for everything else.”HPE said StoreFabric M-series switches provide “consistent and predictable performance, regardless of file size, workload or the ports being accessed,” making it attractive to third party storage partners, HPE said. Vendors that have adopted the M-series portfolio include Cohesity, Cloudian, Hedvig, Qumulo, Rubrik and Scality, in addition to HPE’s HP/3PAR, Nimble Storage and Simplivity.“The M-series enables them to retain their differentiation far beyond their own platforms,” said Lans, “extending their unique feature sets across the network to the applications and the users that rely on them. This is a true differentiator -- giving their customers a fast lane for storage traffic that they never had before.”Peter Godman, co-found/CTO of Qumulo, focused on enhancements made to Ethernet, the most widely used network protocol, enabling it to support increasingly high performance, multi-platform environments.\"Ten years ago storage fabrics meant Infiniband for HPC, and Fibre Channel for enterprise,” said Godman. “Ethernet was slow and 'lossy,' and just couldn't compete. But of course sooner or later the volume technology (in this case Ethernet) always outstrips the proprietary technologies, whose increasingly marginal advantages no longer justify perpetual, costly R&D cycles and the high price tags they entail. As Ethernet has grown up and outstripped last-generation storage fabrics, next-generation storage vendors have built their products around Ethernet as a fabric, delivering reliability, choice and cost-efficiency to their customers without sacrificing performance.”Fundamental to the new HPE products, Lans said, is Mellanox’s latency-optimized processors.“When it comes to data traffic, it's not about throughput,” he said, “it's about latency… Their (Mellanox’s) solutions in this space draw from their long history of excellence in InfiniBand, which provides the lowest-latency connectivity available.”Mellanox Ethernet switch technology scales from 10G to 25G and 40G to 50G and 100G, “providing low latency for any packet size, network speed, and port configuration,” according to HPE. Mellanox Spectrum switch silicon “makes it simple to create a high-performance Ethernet Storage Fabric (ESF) that supports block, file, and object storage, as well as hyperconverged infrastructure,” said Lans, adding that ESF integrates with HPE’s SFO.The Mellanox-HPE partnership addresses “issues with performance, flexibility, and the cost of legacy storage fabrics,” said Kevin Deierling, Mellanox VP of marketing, “and to address the ever-changing landscape of new hyperconverged, NVMe-oF and all-flash storage architectures.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2018-06-05 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "HPE",
        "Mellanox",
        "storage network fabrics"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/mellanox/",
        "https://www.enterpriseai.news/tag/storage-network-fabrics/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/HPE-M-Series-Switches-0618-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/HPE-StoreFabric-M-Series-slides-1.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/HPE-StoreFabric-M-Series-slide-latency.png"
    ]
}