{
    "title": "NetApp Shoots High And Low With FAS Hybrid Arrays",
    "text": "Network-attached storage pioneer NetApp is pushing back against the army of upstart makers of hybrid and all-flash storage arrays with upgrades to its FAS line of hybrid devices, extending the performance and scalability of its high end and offering more cost-effective arrays at the low end.The company has not yet announced its new FlashRay all-flash machines, which will sport a new design and which will be aimed at workloads that need low latency that is consistent and predictable. The FlashRay devices will sit between the current flash-only arrays in the FAS family, which have what NetApp characterizes as \"predictable good latency\" and the EF Series, the all-flash devices that have ultra-low latency and are optimized for high I/O operations per second and throughput.While all-flash arrays are all the rage these days, for many workloads and for many budgets, hybrid arrays that mix disk and flash are a better option, and hence NetApp is still peddling such devices, which it calls the FAS Unified Storage arrays. These machines, as it turns out, also make competitive all-flash arrays if customers want to put SSDs instead of SATA drives in them.Here is what the lineup looks like, just to keep the names and relative performance straight:The new top-end of its hybrid array lineup is the FAS8080 EX, which sports Intel's latest \"Ivy Bridge\" Xeon E5 v2 processors as their main controller engines to run the ONTAP storage operating system. In a high-availability configuration, the FAS8080 EX has a total of 40 cores in the controller. The controllers in the smaller FAS8020, FAS8040, and FAS8060 arrays are based on earlier \"Sandy Bridge\" Xeon E5 v1 processors. Running the clustered Data ONTAP operating system, which allows for multiple NAS arrays to be clustered together to scale them out – much as organizations do for server workloads – the FAS8080 EX can scale up to 24 nodes (or 12 nodes in an HA configuration). The full-on 24-node setup can have 17,280 disk drives with a maximum raw capacity of 69 PB, plus up to 432 TB of flash cache storage (called Virtual Storage Tier by NetApp) to accelerate data access. These VST flash cards are supplied by Fusion-io. The FAS8080 EX has 3 TB of cache memory on the controller nodes, and each controller has 32 GB of battery-backed non-volatile memory so data stored in this DDR3 cache can be preserved in the event of a power failure.The key thing about this high-end array – and indeed any hybrid array – is that by shifting to a mix of SATA disks and flash storage, NetApp says it can lower the cost per terabyte on the array by more than 40 percent over all-disk arrays based on more expensive SAS drives. The switch to a mix of SATA disks and flash lowers the cost of IOPS by nearly 20 percent and reduces power consumption by more than 25 percent.And if you really need screaming performance and scale-out capability, NetApp is perfectly happy to sell you an all-flash version of the FAS8080 EX, which will top out at more than 4.6 PB – yes, that is petabytes – of flash storage in the drive bays.NetApp is using PCI-Express flash cards in the FAS8080 EX arrays, and if you don't need flash, then you can slip two dozen dual-port I/O cards into those PCI-Express 3.0 slots to add 48 10 Gb/sec Ethernet or 16 Gb/sec Fibre Channel cards for added connectivity between the storage and the machines it serves data. The FAS8080 EX has eight unified target adapter (UTA2) ports, which support 16 Gb/sec Fibre Channel or 10 Gb/sec Ethernet (with iSCSI, FCoE, SMB, and NFS protocols atop) connectivity.Fully loaded, the FAS8080 EX array is capable of driving an aggregate 4 million IOPS, which is considerably more than its predecessors:For the most part, the FAS line is designed for hybrid disk and flash, but that does not mean they cannot compete against all-flash arrays.\"An interesting thing that has come up as we have done testing with the FAS8000 systems is that you can actually get extremely high performance out of these systems in an all-flash configuration,\" Nathan Moffett, director of platform marketing at NetApp, tells EnterpriseTech. \"We design them around the concept of hybrid, but because of the NVRAM enabling us to drive faster I/O back to client applications and allowing us to drive higher I/O operations out to SSDs, we have found that we can meet or beat competitors with all-flash arrays.\" Moffett says that NetApp is working on some competitive numbers that show it meeting or beating Pure Storage or EMC XtremIO arrays in all-flash setups.All-flash variants of the FAS8000 series have been adopted by customers to drive large transactional databases and for virtual desktop infrastructure, where high IOPS and low latency are key.Like other NetApp products running the clustered Data ONTAP operating system, this big array supports Storage Virtual Machines, or SVMs, which provide multitenancy within the array, isolating multiple customers from each other. Moffett says that the company has over 275 service providers and clouds that are using its arrays as back-end storage, which gives them the snapshotting and vaulting capabilities that corporate datacenters have when they deploy NetApp products. (Not everything in the cloud has to be based on commodity hardware and open source software, after all.) And some other cloud providers, such as Amazon Web Services, offer what is called NetApp Private Storage, which packages up NetApp storage and sells it by the slice much as AWS does with S3 or Elastic Block Storage services.At the other end of the spectrum, the new FAS2500 series replaces the existing FAS2200 machines, and these are designed for hybrid or disk-only. The architecture is the same: you have a pair of controllers mirrored for high availability and then you can scale up to two of these together on the FAS2520 or up to four with the FAS2552 and FAS2554. Here are the feeds and speeds of these three different entry machines:The FAS2500 series are for sale now, and the FAS8080 EX will be available around the end of July. Pricing information for these machines was not available at press time.Here are some interesting tidbits of information to consider able NetApp and flash storage. NetApp has sold 93 PB of flash storage to date, and pushed 18 PB of flash in its fourth quarter of fiscal 2014, which ended in April of this year. NetApp has sold 1,000 all-flash arrays and 30,000 hybrid arrays to date.a very good article, but I’d like to know the IOPS performance of the fas2552 model. I think its I/O performace are not quite good.thanks",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-06-17 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "array",
        "Flash",
        "hybrid",
        "NetApp",
        "ONTAP"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/array/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/hybrid/",
        "https://www.enterpriseai.news/tag/netapp/",
        "https://www.enterpriseai.news/tag/ontap/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/netapp-logo-370x275.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/netapp-fas-hybrid-lineup.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/netapp-fas8080-ex-performance.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/netapp-fas2500-table.jpg",
        "https://secure.gravatar.com/avatar/e3fa86787df7247d9f6c023a83921463?s=60&r=g"
    ]
}