{
    "title": "NVMe Fabrics Enter Express Lane",
    "author": "George Leopold",
    "date": "2019-05-06 00:00:00",
    "text": "As the volume and velocity of data grows exponentially, storage vendors are increasingly promoting NVM Express as a device interface for accessing non-volatile storage media.Enterprise storage vendors such as Western Digital describe the challenge this way: transforming the currently two-lane country road based on conventional serial-attached hard drives “to a fast, 12-lane divided highway driven by NVMe.” Extending that metaphor, NVMe is touted as the “roadway” to access emerging storage technologies like NAND flash.Storage vendors also assert the time is ripe for adopting NVMe technology as some early technical wrinkles are worked out and the maturing networking technology retains plenty of headroom to improve as enterprise deployments accelerate.NVMe proponents insist the storage protocol that leverages high-speed flash storage and persistent memory media will greatly reduce datacenter latency through direct memory access to stored data. NVMe storage arrays are designed to bring data closer to computing resources, accelerating workloads such as real-time analytics and machine learning applications.That approach promises to transform the datacenter from an application- to a data-centric architecture, said Erik Ottem, senior director of datacenter systems at Western Digital (NASDAQ: WDC). “Traditionally, [users have] been in siloed environments where data was used for a single application. Now, it’s time to look at that data in other ways,” Ottem noted in a recent company webcast.The “multiple lanes” of data delivered by NVMe represent a better way to “extract value from [existing] infrastructure to support this data need,” he added.Along with higher PCI Express bandwidth, NVMe is increasingly seen as enabling the multiple lanes of the storage fabric  in enterprise datacenters, Western Digital argues. “NVMe is certainly changing the way the storage looks, and it going to improve the way data gets used, Ottem added. “So, it’s a really important technology in the datacenter.”Western Digital also argues that traditional serial-attached storage protocols are “crippling” the potential of flash-based solid-state drives. One way that NVMe reduces latency for “active data” to boost application performance is by scaling data access performance from SATA’s 32 commands per queue to NVMe’s 64K queues and commands.For those and other data-driven reasons, NVMe has emerged as the storage protocol of choice for high-end workloads, analysts agree.“Flash [storage] still has room to grow, as storage decision makers currently perceive that solid-state-level performance is only required by a subset of their workloads,” market tracker Enterprise Storage Group noted in a recent survey of the NVMe landscape.“Looking ahead, the industry is anticipating NVMe-based solid-state implementations, with the expectation that these new storage offerings will overtake not only the more traditional solid-state...but possibly even the larger storage networks themselves,” the analyst added.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/data-storage-shutterstock-1085748272-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}