{
    "title": "Merger Complete, Dell Rolls Automated IT",
    "text": "Dell Technologies this week rolled out its data-driven vision of the automated IT infrastructure for the next decade, signaling in the process that it has completed the integration of among the largest technology mergers in history.Emphasizing the “next decade of data” generated by networked platforms and ever-increasing computing power, Michael Dell said the next step is consolidating infrastructure to integrate and secure data.The company’s (NYSE: DELL) new automated IT infrastructure seeks to take “that data and move it to the appropriate resource or application, in a public cloud or an on-premise cloud, [software-as-a-service] cloud and we can analyze it and act on it with agility,” Dell said.Moving data across increasingly fragmented infrastructure, Michael Dell added, was the idea behind merging the company he founded with storage giant EMC, VMware (NYSE: VMW) and cloud software specialist Pivotal to form Dell Technologies.The challenge is siloed infrastructure, exacerbated by the shift to edge computing and distributed infrastructures. Machine learning, for example, won’t work if data sources are fragmentated. Without data integration, Dell asserted, “It’s all noise.”The next decade will be “fundamentally smart everything” with data flowing across entire systems, added John Roese Dell Technologies’ president and CTO for products and operations.Dell’s response is an automated infrastructure, a “multi-cloud operational hub,” dubbed PowerOne. Unveiled this week, Dell’s platform assumes computing, storage and networking will scale and become cheaper. The limiting factor is “human capacity in the system,” Roese said, confronting the current “inability to scale the human capacity” bogged down in IT tasks that could be automated.“We need a multi-cloud operational hub so we can orchestrate and automate the multi-cloud world,” Roese said, then apply AI-driven automation and data security across enterprise infrastructure.Hence, PowerOne is touted as a combining Dell’s infrastructure offerings into an “all-in-one automated” platform providing “pools” of computing, storage and networking that can be allocated via APIs. The PowerOne “controller,” or automation engine, represents the brains of the automated IT platform, coordinating resources using what Dell calls “opinionated automation” to deploy IT capacity pools to software stacks such as virtualized servers.The appliance uses Kubernetes orchestration to automate the configuration and provisioning of resources. For example, the cluster orchestrator has been integrated with VMware’s vSphere server virtualization software. The controller runs on top of Dell EMC switches, storage arrays and data security features.The result, Dell claims, is a 98-percent reduction in manual IT tasks. For example, spinning up a VMware cluster could be reduced to several clicks, Roese said.Along with providing an automated hub, Dell also touts its new IT architecture as an example of how it has integrated EMC storage and VMware’s virtualization technologies into a flagship platform aimed at data-driven applications.The company has also joined the growing list of infrastructure providers offering on-demand infrastructure services across multi-cloud deployments.Ultimately, Roese added, the IT automation platform seeks “to improve the ratio of people to IT capacity. That’s the challenge.”Another was completing the blockbuster Dell-EMC merger. “We’ve stabilized the business over the last two years,” noted Jeff Clarke, Dell Technologies’ vice chairman. “We’ve established a collaboration model… with VMware that now works across” the merged companyDell Technologies said its PowerOne IT automation platform will be available on Nov. 22.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-11-12 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Edge/IOT",
        "Networks",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Front Page",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "AI",
        "Dell Technologies",
        "EMC",
        "John Roese",
        "Machine Learning",
        "Michael Dell. data analytics",
        "multi-cloud hub",
        "Pivotal",
        "PowerOne",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/dell-technologies/",
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/john-roese/",
        "https://www.enterpriseai.news/tag/machine-learning/",
        "https://www.enterpriseai.news/tag/michael-dell-data-analytics/",
        "https://www.enterpriseai.news/tag/multi-cloud-hub/",
        "https://www.enterpriseai.news/tag/pivotal/",
        "https://www.enterpriseai.news/tag/powerone/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Dell_PowerOne-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}