{
    "title": "Penguin Computing in $85M Acquisition Deal",
    "text": "If another indication were needed of the explosive growth in cloud services, AI-based workloads and Linux in the enterprise - along with their attractiveness to investors - it’s the acquisition of fast-growth Penguin Computing, announced today by Smart Global Holdings for $85 million.Penguin, the 20-year-old advanced scale hardware solutions provider, develops open, Linux-based cloud and HPC solutions ranging from Linux servers and workstation to integrated HPC cluster and cluster management software. Increasingly enterprise- and AI-focused, the company said today that between 30 and 40 percent of its business is AI-related. Overall, Penguin claims an installed base of more than 18,000 systems in 40+ countries at customer sites that include NASA, AOL, Caterpillar, Lockheed Martin, Boeing, Life Technologies and the U.S. Navy. In the HPC world, Penguin three years ago won a $39 million contract for a 7-9 PFLOPS system deployment with the U.S. Department of Energy’s National Nuclear Security Administration.Penguin is known for its versatile product set that includes on-premises hardware as well as public and private cloud solutions, such as Penguin-on-Demand, a high-performance, bare-metal computing environment in the cloud. The company also offers a managed service, available through its professional services arm, an on-premises system managed by customers, an on-premises system managed by Penguin or systems colocated in Penguin’s datacenter.Penguin has been a hot-growth company of late, reporting Q1 2018 profits of $10.3 million on net sales of $48.5 million, compared $5.8 million in profits on $26.9 million in revenue for the same period the previous year. Overall, the company reported FY’17 sales of $166.5 million and profits of $30.4 million.Penguin will continue as a stand-alone operation and will be the first part of the holding company’s new business unit, SMART Specialty Compute & Storage Solutions, which “will benefit from shared infrastructure and the ability to leverage the products and capabilities of Smart’s Specialty Memory business unit into the emerging AI and ML markets.”“We are pleased to be embarking on the first acquisition of our strategy to broaden the reach and capabilities of SMART into new technologies, markets and channels that leverage our proven platform of integrating and growing businesses,” said Ajay Shah, Chairman and CEO of SMART Global Holdings. “Penguin brings an outstanding customer base, solid products and strong supplier relationships to SMART in the specialty compute, storage and networking markets.”“We are looking forward to becoming a part of the SMART family of global companies and will continue to deliver Penguin branded high quality, cost effective, purpose-built servers, storage and networking solutions for our customers,” said Tom Coull, CEO of Penguin. “With this new platform, Penguin will have substantially improved access to capital to drive additional investment in, and further development and growth of our product and services offerings. Based on all of the benefits that we anticipate from this transaction, we expect that our customers and suppliers will be supportive of the transaction.”Smart’s acquisition of Penguin for up to $85 million includes up to $25 million of performance-based payments  made if agreed-upon targets are achieved. Headquartered in the Cayman Islands and founded 30 years ago, the SMART family of companies specializes in memory, storage and hybrid solutions for the electronics industry with standard and custom products.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2018-06-11 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Government",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/sectors/government-sectors/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/penguin-computing-logo-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/linux-penguin-580x358-300x185.jpg"
    ]
}