{
    "title": "Nexenta Object Storage Targets OpenStack, Big Data",
    "text": "Software-defined storage specialist Nexenta launched the first version of it block and object storage package designed to provide inline data compression and deduplication on petabyte-scale clusters. The scale-out storage solution targets OpenStack and big data infrastructures, the company said.The Santa Clara, Calif, storage management vendor said its NexentaEdge 1.0 storage platform is tailored to next-generation infrastructures based on OpenStack as well as big data repositories requiring greater performance and scaling.Nexenta is betting that object storage is emerging as a required storage option to support cloud-based and big data applications. Object storage differs from traditional enterprise storage in that it is specifically designed to run on low cost \"shared nothing\" clusters in which none of the nodes shares memory or disk storage. All storage capacity is presented as a single logical pool.The company cites estimates that file- and object-based storage requirements could reach $38 billion by 2017. That total includes object storage capacity growth estimates as high as 173 exabytes by 2017, according to IDC. The market analyst predicts that software-defined storage options will outpace commodity hardware platforms for object-based storage.Hence, NexentaEdge targets growing amounts of unstructured data like medical images, graphic designs, and cloud archiving along with the explosion of sensor data from the emerging Internet of Things.Those seeking inline deduplication and compression for their object storage can host NexentaEdge on X86 servers running Red Hat Enterprise Linux 7.0, CentOS 7.0, or Ubunta Server 14.04. The storage software supports the OpenStack Block, Cinder, and Swift storage APIs as well as the Amazon Web Services S3 APIs.Edge complements or perhaps replaces NexentaStor, the company's existing software-defined storage product. As recently as this spring, the company was announcing adoption of the 4.0 version of NexentaStor, which is based on open source Zettabyte File System (ZFS) storage technology.Edge is also designed to leverage next-generation scale-out object storage technologies like the Seagate Kinetic open storage platform. \"This technology represents an opportunity to substantially address the inefficiencies of traditional datacenters whose legacy architectures are poorly adapted to a world of exploding unstructured data and applications,\" Kaustubh Das, Seagate Technology's vice president of advance storage solutions, said in a statement provided by Nexenta.While Nexenta is entering a crowded object storage market, it claims Edge is the first software-only object storage product delivering less expensive global inline dedeplication on a petabyte scale. The company argues that legacy hardware and appliance-based systems are not equipped to handle the torrent of data and the types of workloads associated with unstructured big data.As big data storage needs grow, object storage is being touted as much more scalable than traditional file system storage. One reason object storage systems are cheaper is that they require less metadata than file systems to store and access data. File metadata is stored with the object.Nexenta said it would demonstrate its object storage solution during VMworld 2014 from August 24 to 28 in San Francisco. Global availability of NexentaEdge is scheduled for the fourth quarter of 2014.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-08-19 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Nexenta",
        "NexentaEdge",
        "OpenStack",
        "ZFS"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/nexenta/",
        "https://www.enterpriseai.news/tag/nexentaedge/",
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/zfs/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/08/nexenta-file-logo-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}