{
    "title": "AliCloud Takes on AWS with ‘Bare Metal’ HPC Instances in Europe",
    "text": "Alibaba, the e-commerce giant from China, is taking a run at AWS in the global public cloud computing market with new offerings aimed at the surging demand for AI and HPC solutions among European enterprises.From Mobile World Congress in Barcelona Spain, Alibaba Cloud (aka AliCloud) launched new performance-oriented “bare metal” instances, which can be pooled together to create an HPC cluster for large-scale machine learning applications, high-performance scientific and engineering applications, as well as advanced data analysis, batch computing, and video processing.Although AliCloud is characterizing the instances as bare metal, which means something very specific in the HPC space (aka non-virtualized), they actually employ a lightweight hypervisor system, called Virtualization 2.0, developed by the company. The technology is said to enable business applications to directly access the processor and memory of the EBM Instance without any virtualization overhead.In the words of AliCloud, the ECS Bare Metal (EBM) instances feature “the elasticity of virtual machines and performance and characteristics of physical machines.” The instances are based on “next-generation virtualization technology that supports the common virtual cloud server as well as nested virtualization technology that retains the user experience of physical machines.”The Super Computing Cluster (SCC), which AliCloud touts as “real high performance computing (HPC) on cloud,” combines EMB instance technology with support for RDMA (Remote Direct Memory Access) through RoCE v2 to secure high bandwidth and low latency. An SCC server offers up to 96 Skylake CPU vCores, up to 512GB of memory, and up to eight Nvidia GPU cards (P100 or V100).SCC clusters can be deployed with either Intel Xeon Platinum 8163 Skylake processors running at 2.5GHz (by opting for the sccg5 instance) or Intel Xeon Gold 6149 Skylake processors, running at 3.1GHz (by opting for the scch5 instance).“The combination of the SCC built on the EBM Instance and other Alibaba Cloud computing products such as the ECS and GPU servers provides the Alibaba Cloud elastic high-performance computing (E-HPC) platform with ultimate high performance parallel computing resources, making supercomputing on the cloud a reality,” says AliCloud.AliCloud initiated the E-HPC strategy last year, drawing from existing infrastructure to provide users with an all-in-one high-performance computing service cloud platform, “an HPCaaS public cloud service.”Alibaba launched its cloud services division in 2009, three years after Amazon Web Services debuted. It provides similar basic services, like ECS (Elastic Compute Service), an analog to Amazon’s Elastic Compute Cloud (EC2). And like AWS, AliCloud provides a wide range of instance types, segmented by family, i.e., general purpose, compute intensive, memory intensive, SSD-attached, GPU-equipped and FPGA-equipped.A recent report from Synergy Research Group ranks Alibaba Cloud fifth across the globe after AWS, Microsoft, IBM, and Google in terms of cloud platform, infrastructure and hosted cloud service providers. Gartner counts Alibaba among the world’s top three IaaS providers, and they are the largest provider of public cloud services in China, according to IDC.This week’s announcement shows that AliCloud continues to be serious about taking market share from competitors like AWS and Azure (which have both entered China). Potential international clients however are likely to have security and compliance concerns about relying on a Chinese public cloud provider. So it’s not ideal that the ECS Bare Metal (EBM) instances and the Super Computing Clusters (SCC) are currently limited to AliCloud’s Shanghai region (zone D of China East 2) — available only by invitation (link to apply). Planned availability for AliCloud’s two European zones (both located in Frankfurt, Germany) was not disclosed as part of this launch.Details on all instance families and types, including ECS Bare Metal and SCC, are listed on the Alibaba Cloud website.In addition to the new high-performance instances, Alibaba Cloud introduced three key products for European enterprises: Image Search solutions, which allow users to search for information online and offline using images; Intelligent Services Robot, a chatbot for business; and Dataphin, an intelligent data engine developed to cope with the cross-industry big data development, management and application needs.Alibaba Cloud also announced it is establishing a technology ecosystem with European partners, such as Vodafone in Germany, the Met Office which is the national meteorological service for the UK, and Station F, an innovation hub in France.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2018-03-01 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "AI",
        "Alibaba Cloud",
        "HPC",
        "hpc cloud"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/alibaba-cloud/",
        "https://www.enterpriseai.news/tag/hpc/",
        "https://www.enterpriseai.news/tag/hpc-cloud/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/Alibaba-cloud-graphic-800x-370x290.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}