{
    "title": "Nimble Beefs Up Performance Of Hybrid Arrays",
    "author": "George Leopold",
    "date": "2014-06-12 00:00:00",
    "text": "Nimble Storage, one of the several storage upstarts that has gone public recently, has unveiled a new high-end hybrid array and flash-only shelves that boost the capacity and performance of its devices.The Adaptive Flash platform targets customers looking for some wiggle room in establishing a balance between solid state and hard disk drives in order to handle a mix of datacenter workloads, analysts said.The core of the new platform is Nimble's CS700 series hybrid arrays and its All-Flash Shelf add-on.The CS700 has triple parity RAID protection and puts twelve 7.2K RPM disks and four solid state drives into the 3U enclosure to deliver around 125,000 I/O operations per second (IOPs) across the storage. The CS700 has between 16 TB and 64 TB of flash storage, and importantly, my mixing disk and SSDs and using caching software together, the effective throughput per drive, at 10,000 IOPs, is about twice as much as you can pull from a single SSD using multi-level cell (MLC) flash, according to Nimble. (That is on a fully loaded CS700 array with 3.2 TB of flash in each controller node and another 16 TB of flash in the all-flash shelves attached to the disk enclosures, all running on the same file system.In a four-node CS7000 cluster, Nimble can deliver an aggregate of 500,000 I/O operations per second and 1 PB of capacity. The platform is being promoted as enabling the consolidation of workloads and the elimination of \"storage silos\" spawned by various applications requiring different levels of performance and capacity, and usually spawning a mix of storage arrays. So, for instance, Nimble suggests that customers that now have EMC VNX hybrid flash-disk arrays for parts of their workloads and EMC's XtremIO all-flash arrays for other parts can just put it all on a single CS700 with a mix of flash and disks and let the software handle the placement of data to accelerate applications.The All Flash Shelf comes in the same 3U enclosure as the CS700 base unit and allows for customers to mix and match current and future flash devices as their storage or IOPs needs increase. The All Flash Shelf is available with a maximum of 12.8 TB of flash now, and will allow for fatter flash when it becomes available.The Adaptive Flash platform is based on the company's patented flash-tuned file system, called Cache Accelerated Sequential Layout. The CPU-driven CASL architecture is designed to leverage the attributes of both flash and disk storage. It also caches active data in real time on SSDs as a way of speeding up response to read requests. Nimble claims response times are ten times faster than alternative flash schemes.The company is betting that one of the sweet spots in the storage market is the ability to allocate the exact amount of storage resources required for enterprise applications. By emphasizing a \"scale-to-fit\" approach that reduces the need for performance and capacity tradeoffs, the flash storage vendor maintains it can help customers avoid over-provisioning and underutilizing.\"Hybrid and flash-only products force enterprises to create storage silos, resulting in increased costs and management complexity,\" Dan Leary, a Nimble Storage vice president, said in a statement. The new platform is intended to change the way flash storage is leveraged in datacenters and cloud environments, Leary added.Observers said application workloads that require much performance and relatively little capacity would likely migrate to all-flash array architectures like Nimble's as they search for more flexibility in handling unpredictable data growth.Nimble is also pitching its flash platform as a way to handle performance-intensive virtualization workloads like virtual desktop rollouts along with transaction-intensive databases. Partner VMware said it is combining Nimble's Adaptive Flash technology with its Horizon 6 virtual desktop broker that was rolled out in April.The CS700 flash array is the third in a series of storage platforms intended as \"building blocks\" that can be scaled as performance and capacity requirements grow for enterprise applications. Nimble's customers include banks, municipalities, venture capital firms, retailers and health care organizations.San Jose-based Nimble said its CS700 series array and All-Flash Shelf would be generally available in June 2014. It did not disclose pricing.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/lightning-flash-370x261.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/nimble-storage-scale.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/nimble-storage-cs700-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/nimble-storage-customers.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}