{
    "title": "Calls For EMC-VMware Breakup Get Louder",
    "author": "Timothy Prickett Morgan",
    "date": "2014-10-09 00:00:00",
    "text": "IBM has sold off its System x division to Lenovo, eBay is spinning off PayPal, and Hewlett-Packard is breaking itself into two. Suddenly the idea of conglomerates that have many and often competing businesses is going out of fashion. Activist investors are on the prowl to take stakes and break up companies to try to \"unlock shareholder value,\" as they undoubtedly put it.Now Paul Singer, the activist investor behind the Elliott Management hedge fund that has been behind some major changes in IT companies in recent years, is after EMC to break its VMware server virtualization and cloud unit free of the EMC federation.EMC has to be a lot more careful about letting go of VMware than many might think.The basic argument from Elliott is simple: EMC owns an 80 percent stake in VMware and the high value that Wall Street has placed on VMware is making the underlying EMC Information Infrastructure storage array business undervalued. With chairman and CEO Joe Tucci, who built up the EMC federation over the past two decades, getting set to retire early next year, Elliott is arguing that there is no one who can hold these units together and rationalize them as there is increasing competition between the units, particularly as VMware is expanding into storage with its VSAN virtual storage area network and into cloud computing services, which makes it a competitor to some of EMC's largest storage and security software customers.In a letter sent to EMC's management, Elliott confirmed that is has amassed a 2.2 percent stake in EMC while at the same time doing a survey in the past year of 580 customers of EMC and VMware to get a sense of their virtualization and storage strategies.EMC bought VMware a decade ago for $625 million, and that investment has paid off many, many times over with VMware being the unquestioned leader in enterprise server virtualization and a contender in desktop virtualization and cloud computing. VMware is now humming along at a $6 billion annual run rate, brings around a quarter of its money to the bottom line, has over 400,000 customers, and sports a market capitalization of $40 billion. That means EMC's stake in VMware is worth $32 billion, but EMC itself, as the holding company for EMC II, VMware, RSA Security, and Pivotal, is only valued at $58.5 billion as EnterpriseTech goes to press. That implies that the other three EMC divisions are only worth $26.5 billion, which Elliott, and indeed many EMC shareholders, contend undervalues the core storage business. This assertion is based on the higher valuation that EMC's main storage rival, NetApp, has on Wall Street relative to its earnings. (NetApp has a valuation of $12.8 billion at the moment, so don't get the wrong impression that the core EMC storage business is somehow valued less than that of NetApp.)Elliott argues that VMware is now clearly competing with the core EMC II storage business with the advent of VSAN software, although VMware will downplay this saying that VSAN does not have the scalability, robustness, or feature set of an actual SAN. The obvious question is: Why not? With Nutanix, SimpliVity, Pivot3, Scale Computing, GridStore, and others pushing sophisticated virtual SANs mashed up with virtual compute infrastructure, VMware cannot be holding back to protect the core EMC physical SAN business. Ironically, a VMware separated from EMC might be much more of a threat to EMC, which might raise the valuation for VMware but would certainly hurt the valuation for EMC. This is not something that Elliott contemplates in its letter, but it is obviously a possible – some might say probable – scenario.Given this, one might argue as well that VMware should be collaborating more tightly with EMC and creating the best software-defined storage on the planet that can run on commodity servers, blunting the attack of the hyperconverged system vendors mentioned above. But up until now, VMware and EMC have largely kept their storage development efforts separate. This approach gradually transforms EMC into a software company, perhaps over a decade, and an activist investor like Elliott cannot make a quick and easy buck by prodding management to act a certain way.What is clear from Elliott's surveys is that EMC and VMware customers do not think that the spinoff would have much of an effect on their buying behavior, which is good news for both parts of the EMC federation. But they might have some opinions about how a unified EMC-VMware might shape future platforms to provide a more focused virtual platform. Customers may also not care that VMware is competing with EMC partner Cisco Systems with its NSX network virtualization software stack or that Cisco is competing with VMware with its OpenStack partnership with Red Hat. But these initiatives certainly put strain on EMC's partnerships just the same and cause friction.Elliott wants EMC to take on $4.8 billion in debt, get $1.5 billion in loans repaid by VMware, and add this to $2.7 billion in cash to do a $9 billion stock buyback in EMC shares. At the same time, Elliott wants to do a tax-free spinoff of shares in VMware to all holders of EMC stock, setting VMware free from EMC. With these actions, Elliott believes that it can boost the value of all of the pieces by 48 percent. And importantly, it can free VMware to compete fully in the storage arena while letting EMC maintain its physical storage partnership with Cisco.Of course, such a spinoff would leave VMware open to acquisition, and there are very few companies with enough cash to acquire it. One of them is none other than Cisco, of course, which could make very good use of VMware as the core virtualization layer for its Unified Computing System. That was, after all, the original plan and the underpinnings of the VCE partnership between Cisco, EMC, and VMware. EMC, seeing the writing on the walls about physical storage arrays over the long haul, is probably not been on letting go of VMware, for the reasons cited above. But one way or the other, EMC is going to be competing against VMware in storage over the long haul unless VMware becomes EMC's future storage. There is no mistaking that. Making a quick 48 percent return on stock valuation could be small potatoes compared to the future of EMC in the storage market and setting loose a powerful and rich competitor that can cause EMC much more pressure than activist investors like Singer.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/vmware-logo-370x272.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/emc-federation.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/emc-elliott-survey.jpg"
    ]
}