{
    "title": "Talend Links Big Data to Azure SQL Warehouse",
    "author": "George Leopold",
    "date": "2018-08-17 00:00:00",
    "text": "Data integrators continue to roll out connections between huge data stores and public cloud data warehouses. The latest comes from Talend, which this week unveiled a data fabric “uploader” designed to help ingest big data to Microsoft’s upgraded cloud analytics platform, Azure SQL data warehouse.The data migration specialist (NASDAQ: TLND) said Thursday (Aug. 16) its connector would facilitate the movement of massive data sets to the public data warehouse without the need for shifting source systems. The company also said it would support Azure SQL data warehouse orchestration, management and data governance as a way to achieve real-time business analytics.The Azure SQL data warehouse is a cloud analytics platform that provides separate persistent data storage and computing resources. Customers are billed on a consumption basis.Microsoft recently released a new tier to its Azure SQL data warehouse that adds “adaptive” data caching via nonvolatile storage drives. The upgrade is designed to boost query performance by as much as a factor of five.Talend, Redwood City, Calif., noted that the combination of its data uploader and recent Azure data warehouse upgrades would help enable faster analytics on more data “without the cloud migration headache.”The upgraded platform also incorporates several analytics and storage platforms customized for the cloud, including native integration of the Microsoft Azure distribution of Apache Spark-based Databricks along with Blob Storage and Power BI. The package is designed to support data warehousing and real-time analytics, the company said.Microsoft (NASDAQ: MSFT) also unveiled an extensive partner network in May that includes Talend and other data integration and migration specialists such as Informatica. The collaboration is aimed at helping customers shift in-house data warehouses to the cloud.“Data warehousing is really about bringing massive amounts of diverse data into one definitive, trusted source for analytics and reporting that is accessible across an organization,” said Rob Cornell, head of technology alliances at Talend. “In this increasingly cloud-centric, on-demand world, businesses are expecting to perform fast, large-scale analytics at a fraction of the cost and resources required by traditional data warehouses.”The bulk data uploader is billed as helping to transfer data into the SQL data warehouse from either Azure Blob Storage or Azure Data Lake Store. SQL queries can then be executed in the upgraded data warehouse, Talend said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/11/cloudcomputing_migration.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}