{
    "title": "Mellanox Partners with Storage Startups",
    "author": "George Leopold",
    "date": "2019-07-10 00:00:00",
    "text": "As GPU leader Nvidia closes its $6.9 billion acquisition of Mellanox Technologies announced earlier this year, the HPC network interconnect specialist’s venture arm remains active, investing in two storage startups.Mellanox Capital did not disclose the amounts of its investments in storage startups CNEX Labs and Pliops, but did announced strategic partnerships with both companies.Pliops, which is developing a storage processor aimed at accelerating database performance. Earlier this year, Israel-based Pliops raised $30 million in a funding round led by SoftBank (OTCMKTS: SFTBY), Intel and Western Digital Corp. (NASDAQ: WDC) are also early investors.Founded in 2017 by flash storage veterans from M-Systems, Samsung (KRX: 005930) and XtremIO, Pliops is developing storage processing technology that would enable cloud and enterprise customers to access data as much as 100 times faster while reducing computational loads and power consumption. That capability would help upgrade datacenter infrastructure to better handle cloud as well as data-intensive machine learning workloads.Pliops describes its proprietary technology as combining several “inefficient layers” in the stack into a single storage processor.The partnership with Mellanox Technologies’ (NASDAQ: MLNX) would combine its high-end networking technologies with Pliops’ processors to boost networked storage efficiency, the partners said this week.Mellanox said the Pliops investment would allow it to accelerate deployment of “scale-out storage and data-intensive analytics tools” based on its distributed computing and disaggregated storage approach used to improve the performance of AI and analytics applications.Launched in 2013, CNEX Labs specializes storage ASICs and related software used in enterprise datacenters. Prior to the Mellanox investment, CNEX had raised more than $85 million from funders that include Dell Technologies Capital, according to the website Crunchbase.com.San Jose-based CNEX said its partnership with Mellanox would combine its next-generation flash storage controllers with low-latency networked storage from Mellanox.The motivation for the investments and technology partnership is to “bring compute closer to storage to access and monetize the business value of data,” Mellanox said.Nvidia (NASDAQ: NVDA) reportedly outbid Intel and Microsoft to acquire Mellanox Technologies in March. The networking specialist’s Ethernet and InfiniBand interconnects are used in more than half of the world’s most advanced HPC systems.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/data-storage-generic-big-data-systems-shutterstock_409479163--370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}