{
    "title": "HP Looks to Accelerate All-Flash Datacenters",
    "author": "George Leopold",
    "date": "2015-06-01 00:00:00",
    "text": "Hewlett-Packard is aiming to accelerate the transition to the all-flash datacenter with a package of scalable arrays and services tuned to all-flash storage. The flash introduction also provides additional momentum to efforts aimed at reducing the cost of pricey solid-state arrays: HP claims its enterprise flash portfolio boosts performance and consumes less space while lowering the cost of flash capacity by 25 percent to $1.50 per usable gigabyte of storage.The platform for the all-flash push is HP's 3PAR StoreServ storage family of scalable flash arrays and flash-based data services designed to promote hybrid IT rollouts.Flash vendors like HP are betting that wider adoption of solid-state arrays will prompt customers to leverage the benefits of all-flash arrays across datacenters. \"We're seeing a lot of adoption of flash storage arrays,\" Vish Mulchand, senior director of management and marketing for HP Storage, said in an interview. As the all-flash datacenter moves closer to reality, storage is shifting to flash \"lock, stock and barrel,\" Mulchand claimed.The key metric for flash adoption has been cost. In January, Dell rolled out a pair of all-flash storage arrays priced as low as $25,000. The entry-level arrays were among the early attempts to overcome cost barriers that have slowed broader adoption of flash storage arrays in datacenters.Based on the \"usable capacity\" metric, HP said Monday (June 1) its 3.84 terabyte flash drives reduce the cost of a usable gigabyte of storage from $2 last year to $1.50. The company said the cost of a usable gigabyte of storage would drop well below a dollar when applying StorServ snapshot features to multiple full-data copies used by developers and in data warehouses.Meanwhile, its enterprise flash family bumps workload performance to 3.2 million IOPS at sub-millisecond latency while using 85 percent less space than comparable arrays. HP is positioning its 3PAR StoreServ 20000 as a way to consolidate multiple racks of legacy high-end storage. Mulchand said the arrays could be used to consolidate seven racks into one-quarter of a single rack.\"The key is flexibility of the storage architecture that let's you scale up or down,\" Mulchand stressed. Hence, the ServStore 20000 family scales out to eight nodes and can be leveraged to consolidate multiple racks of legacy storage in the datacenter.The all-flash arrays are based on HP's 3PAR Gen5 Thin Express ASIC that offers a \"data resiliency\" feature for applications running between HP ProLiant Servers to the 3PAR StoreServ storage array. The data validation capability protects against flash media and transmission errors as data moves from servers to storage arrays. The Gen5 chip also includes hardware-accelerated de-duplication.In order to ease the mixing of legacy storage and all-flash arrays, HP also announced a workload-rebalancing feature across arrays. The result is \"federated\" storage across multiple storage arrays with up to 60 petabytes of aggregate capacity. Hence, the vendor said workloads could be moved between storage elements to dynamically rebalance resources.HP said Monday its 3.84-terabyte solid-state drives are available immediately. The HP 3PAR StorServe 20000 platforms are available now and will ship in August with a U.S. \"street price\" starting at $75,000. New 3PAR StoreServ software features are only available for 20000 systems. A \"StoreOnce\" recovery manager for VMware systems with remote copy support will be available this month at no charge to customers with an existing license.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Screen-Shot-2015-06-01-at-12.05.19-PM-345x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}