{
    "title": "Quantum’s F1000 NVMe Storage Server for Unstructured Video and Image Data",
    "text": "High performance storage specialist Quantum Corp. this morning announced an addition to its F-Series line of NVMe storage servers – the F1000 comes in at a lower price point than its F2000 counterpart announced at NAB last year while utilizing that appliance’s software-defined architecture designed for streaming performance and response times in “video and video-like infrastructures,” to use the company’s phrase.Built to support Quantum’s product line strategy – focused on large-scale video and image data sets –  the F-Series is designed for studios, corporations and government agencies “to accelerate the capture, edit and finishing of high-definition content, and speeds VFX and CGI render performance by 10x-100x, to develop cutting edge augmented and virtual reality,” the company said.Available in two capacity points: 39 TB and 77 TB, the F1000 offers the same connectivity options as the F2000, according to Quantum:  32 Gb fiber channel, or iSER / RDMA using 100 Gb Ethernet, and deployed within Quantum StorNext scale out file storage clusters.Quantum Corp. has had its ups and downs in recent years. The company is led by CEO Jamie Lerner, hired in July 2018 after “unhealthy” (Lerner’s word) business practices investigated by the SEC led to the company stock being delisted from the New York Stock Exchange. The company later regained its listing and the stock, bottoming out at less than $1.50 a year ago last month, stood at $7.09 as of this writing.Quantum said its F- Series appliances are not general purpose NVMe storage arrays, they have been designed for the requirements of video and image-based workloads for movie, TV and sports production, marketing and advertising content, or image-based workloads that require high speed processing, such as data from a satellite feed, a drone or a car used in the development of automated driver assistance systems.“Unstructured data is created in many ways as it enters its lifecycle,” said Amita Potnis, Research Director, Infrastructure Systems, IDC. “Quantum's high-performance NVMe flash-based storage offering is well-suited to ultra-high-def content, high-resolution images, and other forms of video and video-like datasets. The F1000 shows great promise for addressing the requirements for ultra-fast reads and writes and parallel processing for a wide range of use cases.”A 1U storage server, the 10 NVMe-drive F1000 offers the same streaming performance (25-30GB/sec) of its 2U F2000 brethren but without the 24-drive F2000’s no-single-point-of-failure, high-availability design.  Bassier said the F1000 product strategy was guided in part by customer feedback since the introduction of the F2000.“A lot of the feedback from customers and partners throughout the year was they love the performance of NVMe, they love the feature set of the software, they just don’t necessarily need the high availability architecture of this server, which comes with a cost premium, right…? So the F1000 is kind of the little brother of the F2000. It is a lower price NVMe storage server with best in class price performance.”Quantum said the F1000 will ship in March.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2020-01-14 00:00:00",
    "cats": [
        "Media",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/sectors/media-sectors/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "high performance storage",
        "image data",
        "NVMe",
        "Quantum Corp.",
        "unstructured data",
        "video data"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/high-performance-storage/",
        "https://www.enterpriseai.news/tag/image-data/",
        "https://www.enterpriseai.news/tag/nvme/",
        "https://www.enterpriseai.news/tag/quantum-corp/",
        "https://www.enterpriseai.news/tag/unstructured-data/",
        "https://www.enterpriseai.news/tag/video-data/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Quantum-NVMe-Storage-Server-400-0120-370x147.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Quantum-logo-II.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Quantum-F1000-storage-server-specs.png"
    ]
}