{
    "title": "vSAN Pricing: Virtual Storage Costs Like Virtual Servers",
    "text": "VMware previewed its Virtual SAN software late last week, and EnterpriseTech gave you the feeds and speeds. The software is available today, and for some reason VMware didn't want to talk about the packaging and pricing for vSAN last week but wanted to wait until it shipped.vSAN, as we already explained, creates a virtual storage area network on servers running the ESXi server virtualization hypervisor. By creating a virtual SAN that runs on the servers, customers can get the shared storage, replication, and high availability of a real SAN without having to pay their typically higher prices. This is particularly important for generic compute clouds and virtual desktop infrastructure, where having converged server-storage architectures is a must – and typically on a budget. For the longest time, if you wanted to do a VMotion live migration between machines, you needed a SAN, and this made clouds and VDI expensive and therefore limited their appeal among large enterprises and made them out of reach for all but the most progressive midrange companies. With vSAN, VMware is able to create a virtual SAN across the disk and flash drives in the compute farm, and just like real SANs, the virtual one integrates with all of the replication, disaster recovery, and vServer console and vCloud controller features.The vSAN software is not only embedded in the ESXi hypervisor, making it distinct from the virtual SAN products from Nutanix, SimpliVity, and Scale Computing that run inside of virtual machines, but it is literally part of the hypervisor (as just about all features of the vSphere and vCloud stack actually are even if VMware doesn't talk about it that way). vSAN is available for ESXi 5.5, the latest release of the hypervisor that came out last summer, and is part of Update 1, which ships today. This is timed to coincide with a regularly planned update to the hypervisor, explains Alberto Farronato, director of product marketing for storage and availability at VMware. Farronato says that vSAN will consume less than 10 percent of aggregate compute on the host nodes on which it runs, which works out to somewhere less than two virtual CPUs on a machine with two eight-core Xeon processors with threads turned off. The alternatives above consume something on the order of two to four times as much compute because they are running inside of virtual machine guests and not closer to the bare metal down in the hypervisor. Even VMware's prior Virtual Storage Array did the same.Even though vSAN is part of the hypervisor, it is packaged and priced like a standalone product. It is not being included in any vSphere or vCloud suite at this point, says Farronato.\"vSAN has very high performance, and based on the service levels we can provide atop vSphere, we think it is good for VDI, tier two and tier three staging, test/dev, even network DMZ because it has network isolation. Disaster recovery targets are another use case, especially for a warm target, not really a live backup target. vSphere Replication is what we use to replicate data to either multiple instances of Virtual SAN or any other storage array, and that is asynchronous. We think we are going to see adoption across all industries and all customer segments.\"vSAN does not support synchronous replication, because vSphere does not, and if you have a mission-critical workload that requires it, then vSAN is not for you.\"We think that the pattern of adoption will resemble server virtualization in the early days,\" continues Farronato. \"People will want to get comfortable with it first with less critical workloads. It is not a matter of the technology being less robust or reliable, but that this is just the way that people adopt new technologies.\"Here's how vSAN is packaged up:All of these packages include VMware's own Virtual Distributed Switch, which as the name suggests is a virtual switch that allows the network connections on virtual machines to be virtualized across a pool of server hosts.When VMware says CPU, it means socket, not core. So these figures above are per-socket prices, just as is the case with some of VMware's other software pricing. At $2,495 per socket, it is a little less than the cost of the vSphere Enterprise hypervisor bundle, which costs $2,875, and quite a bit less than the vSphere Enterprise Plus bundle, which has all of the server virtualization bells and whistles and which costs $3,495 per socket.If you want to add Data Protection services to vSAN, then it costs $1,095 per socket to add that, but until September 15, VMware is offering the bundle of vSAN and Data Protection for $2,875, or at 20 percent off the combined price of the two pieces of code. (Or, more precisely, the keys that unlock the code that is already inherent in the hypervisor.)VMware has its own VDI broker, called Horizon View, and it has done a lot of work tuning up vSAN to work well with its VDU stack as well as with XenDesktop from rival Citrix Systems. For those who want to use vSAN strictly to underpin virtual desktop infrastructure, then the software is available on a per seat basis at a flat fee of $50 per seat. You count concurrent or named users as your VDI license does and match them up; you can buy user licenses in lots of 10 or 100.The more than 12,000 customers who participated in the vSAN beta program for the past eight months also get a deal sweetener of 20 percent off. So do customers who bought the original VSA virtual SAN. The VSA software spanned three machines, or six sockets, and VMware is offering customers with VSAs who move to machines running vSAN with six sockets a bundle price of $9,180, or 20 percent off list price, to do the upgrade. Finally, there is a 60 day free trial if you just want to kick the tires and another 20 percent discount for customers who do the trial and then buy at least ten sockets of vSAN licenses before June 15. This deal is only good for your first purchase, so VMware wants to make sure you do as big of a deal as you can to help close out the second quarter on a high.What everyone wants to know, of course, is how vSAN compares to actual SANs. Farronato did not want to be pinned down to specific comparisons, because not all SANs are created equal, but said that generally speaking, running on modern X86 systems that a vSAN optimized for I/O operations per second could deliver an IOPs for around 25 cents. If optimized for capacity, it would cost something on the order of 50 cents per gigabyte. With operational benefits and simplicity added in, the total cost of ownership for vSAN should be about 50 percent lower compared to an average SAN storage array, Farronato says.This is a big deal, and one that is probably going to hurt EMC's hardware sales but ultimately help its bottom line. Perhaps in a very big way if vSAN takes off as many expect it will. With hundreds of thousands of enterprise customers already using its ESXi hypervisor, it is a safe bet that VMware is going to coin some money if vSAN is as good as the company says it is.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-03-12 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "SAN",
        "VMware",
        "vSAN",
        "vSphere"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/san/",
        "https://www.enterpriseai.news/tag/vmware/",
        "https://www.enterpriseai.news/tag/vsan/",
        "https://www.enterpriseai.news/tag/vsphere/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/vmware-vsan-logo-370x266.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/vmware-vsan-packaging.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/vmware-vsan-promotions.jpg"
    ]
}