{
    "title": "Digital Photo Leader Embraces Flash Storage",
    "text": "As the name implies, Shutterfly Inc. is a digital retailer of high-end \"personalized photo-based products and services,\" which is to say it has turned the family photo album in a big digital business.As the market analysts say, Shutterfly is in the \"memory management\" business. With more smartphones taking more shared family pictures, all the digital images have to be stored somewhere and must be readily retrievable. As a result, the company is shutting down some of its brands and shuttering \"sub-scale \"manufacturing\" facilities to achieve greater scale as the digital photo album business expands.As part of an 18-month transformation of the web-scale company into a \"world-class memory management service\" that complements its online image publishing service, Shutterfly is embracing emerging storage technologies like all-flash arrays as part of a datacenter migration. Hence, the digital photo specialist is steadily replacing its legacy disk-based storage systems.The goal, according to Dan McCormick, Shutterfly's chief operating officer, is available and reliable storage during periods of peak traffic in its new datacenters.Solid-state array vendor Pure Storage, Mountain View, Calif., announced this week that Shutterfly has deployed 17 of its all-flash arrays. The storage arrays are being used to boost performance the performance of Shutterfly's operations while reducing its data storage footprint.Pure Storage makes much of the fact that Gartner designated it as the market leader in 2014 in solid-state arrays. Among the use cases where it leads, according to the Gartner's closely watched \"Magic Quadrant\" rankings, are server virtualization, virtual desktop infrastructure and online transaction processing (OLTP).In the case of Shutterfly, the switch to all-flash storage resulted in what Pure Storage claims was a 500 percent performance gain. Matt Kixmoeller, vice president of products at Pure Storage, said the Shutterfly example illustrates that legacy storage technologies can no longer hack it in a digital business's datacenter. Instead, legacy disk storage is \"essentially the kryptonite of the new datacenter,\" Kixmoeller asserts.Pure Storage also claimed an overall 4.5:1 average data reduction for the Shutterfly storage upgrade, and up to 15.8:1 on MongoDB. That reduced data footprint is said to have freed up as much as 1 petabyte of usable storage capacity while cutting power and cooling costs in the Shutterfly datacenter.Pure Storage also claimed in all-flash arrays would save hundreds of thousands of dollars in rack space, power and cooling over the next three years.Justin Stottlemyer, who is leading Shuttlefly's effort to redesign its massive image archives—estimated at 22 billion and counting, said the transition to all-flash storage enable developers and storage engineers to get more work done while it enabled \"database administrators to sleep at night.\"Shuttlefly is using all-flash storage for backend caching to speed access to smaller data objects while accelerating access at the OLTP level to all data objects. \"If you’re hitting one, random image out of out 22 billion, there's a good shot that whatever you are looking for is not in cache,\" Stottlemyer noted. Hence, integrating flash storage at the OLTP and metadata layers speeded customer access to stored images, he added.Flash storage is also faster than disk for functions like data de-duplication and compression. The result, Stottlemyer said, was a 30 percent reduction in demand on Shuttlefly's Oracle database and a 90 percent reduction on MongoDB.Pure Storage indicated last fall that is it leaning toward offering hyper-converged all-flash systems rather than mixing flash with traditional disk drives. That could allow it to take on server makers in the running of application software.",
    "date": "2015-03-13 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-13-at-1.20.43-PM-370x290.png"
    ]
}