{
    "title": "Seagate’s New Drives Aim at Very Large (and Very Small) Systems",
    "author": "Alison Diana",
    "date": "2015-09-01 00:00:00",
    "text": "Seagate targeted hyperscale and cloud datacenters -- as well as mobile devices – with its flurry of new product announcements at VMworld today.Continuing adoption of cloud for primary storage, as well as backup and recovery, will expand this market to $65.41 billion by 2020, increasing at a compound annual growth rate of 28.2 percent from $18.87 billion this year, projects MarketsandMarkets in an August 2015 report. Only weeks after its Aug. 19 acquisition of storage hardware and software maker Dot Hill -- a move described as helping to accelerate Seagate's cloud initiatives – Seagate unveiled several products that tackle this market head on.Seagate hopes its new 8 terabyte drives, members of the company's Archive HDD family, will feed the corporate world's hunger for cloud storage. The drives – the Enterprise Capacity 3.5 HDD v5; Enterprise NAS HDD, and Kinetic HDD – use perpendicular magnetic recording (PMR) to increase the aerial density of the six 1.33 TB platters, according to Seagate.The developer's Kinetic HDD eliminates an enterprise's need for a separate NAS, according to AnandTech. Slated for January 2016 availability, the Kinetic HDD 8TB will use SMR technology.\"Supermicro’s wide array of SuperServer and SuperStorage solutions deliver unrivaled performance, efficiency, density and reliability for enterprise, data center, cloud and HPC environments,\" said Don Clegg, vice president of marketing and business development at solution provider Supermicro in a statement.In March, Seagate and CERN announced their partnership on the Seagate Kinetic Open Storage platform, designed to help the European Organization for Nuclear Research better manage and store the 100 petabytes of data its Large Hadron Collider already generated plus the additional 2 to 3 petabytes it's expected to create each month.“CERN creates a truly astonishing amount of data on a daily basis, and finding secure and efficient ways to store that information is one of the most important challenges we face,” said Alberto Di Meglio, head of CERN openlab, at the time. “We are excited to collaborate with Seagate on understanding how the Kinetic storage architecture could potentially contribute to the CERN infrastructure and aid the very demanding LHC program, by reducing complexity and operational costs in our storage systems.”Seagate's newly revealed Enterprise Capacity 3.55 HDD v5 model uses Perpendicular Magnetic Recording for bulk storage, SMBs, web, and email servers, providing storage via six 1.33TB platters. The device includes 256MB cache and delivers more than double the random read-writes of v4, Seagate said. Available in both SATA 6 Gbps and SAS 12 Gbps versions, the drive supports Seagate's RAID Rebuild feature.For its part, the Enterprise NAS HDD, which is aimed at midsize to large enterprises needing mid-range NAS, RAID, and cloud solutions, can reach up to 8TB. Both Enterprise products are expected to become available later next month. It supports 6 Gbps SATA and uses less power than near-line SAS drives, Seagate said.Seagate offers the option of a five-year Rescue Data Recovery service that allows enterprises to retrieve data in the case of a system failure (man-made or natural) for the street price of about $20, if purchased with the drives, the company said.In addition to supporting datacenters, Seagate crammed up to 2TB of storage into a 7mm package designed for OEMs designing mobile products. The drive weighs 3.17 oz., and is 25 percent lighter than the previous generation of Seagate’s mobile hard drive products, according to the vendor.  Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/Kinetic-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}