{
    "title": "How to Choose Performance-Based Cloud Storage",
    "text": "With various cloud services offering free unlimited photo storage you may think cheap is the only way to go with cloud storage. That may be fine for consumers, but for enterprises cloud storage should be reliable and address the varying performance and price points of different use cases and applications. Most people can wait for photos to load on their smartphone, but CIOs of financial institutions cannot wait for their databases to update.The challenge with building cloud storage services with varying performance profiles and price points is avoiding the complexities and costs of storage silos. Storage silos are commonly built using various technologies including flash storage for high-performance, hybrid storage that mixes flash and traditional disk for mid-range performance, and high-capacity disks and object storage for lower performance and costs. The problem here is that these are all different technologies with different tools and skillsets to manage. Using a tape and glue approach to patch together multiple technologies into different storage services ultimately results in more costly and less reliable cloud storage.If you are an enterprise looking to completely move your storage into the cloud, should you even care how the backend storage infrastructure is built if you are getting the price and capability you want? Or should you think about your data stored in the cloud much like your own child? Would you send your child to any babysitter without doing a background check?So what are things to consider when evaluating performance-based cloud storage services from a cloud provider? Here are a few:Identify the Storage SilosSometimes it’s as easy as asking the right question. Do you use different storage vendors/technologies for your various storage services and service level agreements (SLAs)? In fact, the likely answer you’ll get is yes. Even Amazon Web Services uses different storage silos to back its various storage services such as EBS Magnetic, EBS General Purpose (SSD), EBS Provisioned IOPS (SSD), S3 Object Storage, Glacier Archive storage, and the list goes on. More is not necessarily better and in fact, it may add significant complexity and costs to your application environment. Which leads to our next point…Assess Application ImpactNot all applications are built the same and each has an optimal way in which it uses storage. Object storage may look appealing given its price point, but does your application support a REST API to use it? On the other end of the spectrum, you have a high performance and low latency demanding application that requires flash/SSD storage for a short period of time. Sure, you can use flash-based cloud storage when it’s critical, but how easy is it to migrate data to lower performance disk storage when you no longer need fast performance and want to lower costs? Assess if you need third party tools such as migration software and gateways or if you need to change your application altogether. These all add further complexity and costs while compromising the reliability of your application.Locate Hidden CostsThree cents per gigabyte per month looks great on paper, but understand in most cases there are many hidden expenses, including bandwidth costs, costs to make copies and backups of your data, fees per I/O (input/output operation), costs for more performance, charges to migrate between tiers, and so on. If you are not careful, you may end up paying double, triple, or even 10 times more than you originally thought.So what is the best way to avoid these issues and simplify your cloud storage implementation and performance needs?Choose a Single Storage Architecture for Cloud StorageSilos and multiple storage architectures add complexity and costs. It’s important to look for underlying technology that is based on the same architecture – including storage operating system, file system, and management and monitoring tools to avoid silos. To support performance-based cloud storage a single storage architecture should:If it addresses the above, then it’s time to examine how easy or complex it may be to set and change your performance SLA. Is it as simple as changing a software setting, or must you migrate data from one service bucket to another? Remember migrations can be costly and disruptive especially when there’s a large volume of data to move around.The beauty of having a single storage architecture is that it also simplifies your application integration. Application owners no longer need to worry about different storage APIs, interfaces, third party tools, and migrating data between different storage tiers and services. Instead, your applications integrate to storage in only one way, allowing you to simply set the price/performance dial that makes sense for each application at any given time and make dynamic changes as necessary.A single storage architecture also simplifies and reduces the costs of common storage tasks such as taking snapshots and backups of data, replicating data to multiple locations irrespective of the source and destination performance or technology, and encrypting data for security and compliance purposes.Ultimately, a good cloud provider will reap the rewards of simplicity and reduced costs of a single storage architecture and in turn will pass the savings onto you as their customer. However most cloud providers and even storage vendors only offer silos and/or a portfolio of disparate storage products and services. As an enterprise considering cloud storage, you need to understand the complexities associated with storage silos, the impact of cloud storage to your applications and workloads, and the overall costs and risks when trading off between storage silos vs. a single storage architecture. The choice is yours, so make the right one.About the Author:Doug Ko is responsible for cloud and services provider programs at Nimble Storage.  He helps cloud service providers create a market advantage with Nimble Storage by implementing technology and business best practices that improve their service offerings.  Doug has more than 10 years of experience in storage and cloud developing partner and alliance programs. Follow on Twitter: @dougko and @nimblestorage.Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "date": "2015-10-02 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "cloud storage",
        "Doug Ko",
        "nimble storage",
        "storage",
        "storage silos"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-storage/",
        "https://www.enterpriseai.news/tag/doug-ko/",
        "https://www.enterpriseai.news/tag/nimble-storage/",
        "https://www.enterpriseai.news/tag/storage-2/",
        "https://www.enterpriseai.news/tag/storage-silos/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/path-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/identify-300x200.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/Doug_Ko_profile-150x150.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}