{
    "title": "SanDisk PCIe Flash a Match for Online Dating Site",
    "text": "With 100 million members, dating site PlentyOfFish wants to make sure technological bottlenecks don't stand in the way of true love.So when SanDisk began field-testing its recently announced Fusion ioMemory PCIe application accelerators, PlentyOfFish took the next-generation cards for a spin, Owen Morley, director of infrastructure at the free online site told Enterprise Technology.\"We're constantly looking at the bottleneck, what in the system is slowing us down. Is it processing power? Is it trapped on the disk? At one point, we found it was the spinning disk: Our storage was the slowest point in the system,\" he said. \"Going with flash fixed it. Back then, data was hours old. You'd be browsing the site and make changes but they wouldn't be reflected on the page right away. We have 50,000 users signing up each day. If you're not seeing a user who signed up today, that's frustrating for that user and you. When you sign up, you expect feedback from users sooner than later. Now, with flash, the changes you make are reflected almost immediately.\"PlentyOfFish began its flash relationship with SanDisk's Fusion ioDrive2, and then moved to the newly released SanDisk Fusion ioMemory PCIe application accelerators – which include SanDisk NAND flash, and Virtual Storage Layer (VSL) data access acceleration software – with quadruple the price performance and a 61 percent list price reduction compared with previous generations of Fusion ioDrive 2 products, according to SanDisk.\"We've got over 30 of these PCIe cards. I lose track because I'm always buying more. If I'm space-constrained or I need to deploy more servers, I buy them. Of all the products we have, our IO cards are one of the few things that haven't broken for us,\" Morley said.Many enterprises, both large and those with widely dispersed customer or employee bases, must address the challenge of reducing the time and infrastructure needed to extract data from hard drive storage systems, as well as commercial databases – including Microsoft SQL, Oracle, and MySQL – and open source technologies such as Spark, Redis, and MongoDB. In addition, the proliferation of server virtualization, virtual desktop infrastructure, in-memory computing, and demand for real-time analytics is encouraging more organizations to invest in PCIe-based solutions, Gartner reported.Sales of enterprise flash-based solid state storage will reach $10.9 billion in 2018, compared with $3.3 billion in 2013, according to IDC. Flash is faster, smaller, quieter, and more energy efficient than hard drives, reported solution provider CDW. As costs drop, the price-performance barrier blurs, further encouraging enterprises to adopt flash solutions. By boosting performance and reducing the cost, SanDisk expects to attract new customers to its Fusion ioMemory PCIe application accelerators, said Brian Cox, senior director of Enterprise Storage Solutions at SanDisk, in an interview.\"We see this is going to help make Fusion technology – flash on PCIe cards – broadly available to everybody. It makes it a very simple decision, if you want to accelerate your applications, you plug this into your server and you get an instant speed boost,\" he said. \"Oftentimes it's these larger organizations that have some of the biggest demands on their computing infrastructures. This could be Fortune 500, research institutions, cloud or social media companies, so that's where we see the need to get ways to accelerate their performance to keep up with the demand.\"Just as flash powers today's consumer devices, it could one day run enterprises' datacenters, said Cox. SanDisk sees some early adoption among companies where IT is a key differentiator, such as financial and some online businesses, he said. But flash – from all vendors – competes against hard disk drives and the status quo, said Cox.\"Roughly 10 percent of all storage units shipped into datacenters today are flash,\" he said. \"We're still in the early days of flash and it's still growing. We have a green field, if you will.\"     Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-04-30 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "\"hard disk drive\"",
        "Flash",
        "ioMemory PCIe",
        "PlentyOfFish",
        "POF",
        "SanDisk",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/hard-disk-drive/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/iomemory-pcie/",
        "https://www.enterpriseai.news/tag/plentyoffish/",
        "https://www.enterpriseai.news/tag/pof/",
        "https://www.enterpriseai.news/tag/sandisk/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}