{
    "title": "A Cure For Risky Storage Upgrades",
    "text": "The latest version of storage services specialist SolidFire's Element OS adds multi-tenant networking along with user features the company said can be used to consolidate a mix of application workloads in the datacenter.SolidFire said this week its Element OS 7 builds on the previous six versions to target consolidation, automation, and scaling of cloud infrastructures used my multiple tenants. The latest version, dubbed Nitrogen, is also intended to help reduce the complexity and risk associated with storage system upgrades. The company stressed that its steady stream of storage upgrades is intended to assuage vendors' fears about downtime during the upgrade process.Underlying the company's upgrade process is the \"high availability\" architecture of its all-flash storage array in which no resources are shared. The design is intended to allow in-production upgrades without disrupting data access.SolidFire founder and CEO Dave Wright said the architecture \"allows us to increase the pace of feature delivery\" when storage is upgraded. SolidFire's all-flash, scale-out storage platform was made generally available in November 2012.The version 7 OS release is based on virtual LAN multi-tenant networking architecture that separates individual tenant's datacenter traffic for security and fault isolation.The company said its Nitrogen release of the Element OS also automates creation and execution of consistency groups. They are intended to eliminate the need for third party software used for data protection, disaster recovery and large dataset management.The storage specialist's all-flash approach seeks to mitigate performance shortfalls it says are common in traditional disk drive and all-flash storage array systems. It maintains that its \"share nothing\" approach is better suited to maintaining performance and data access after a flash drive failure.The \"share nothing\" architecture also eschews the shared disk approach used in traditional and recently released all-flash arrays. That, the company argues, eliminates a single point of failure in the storage infrastructure.Instead, SolidFire's architecture tackles a disk or controller failure by \"rebuilding redundant data\" across unaffected nodes as a means of restoring redundancy. RAID-based storage systems are particularly subject to performance declines during a disk or controller failure, the company notes.With the latest release of its Element OS, the company's strategy is to gain a foothold in enterprise-level datacenters. It notes that the \"offshore cloud infrastructure\" provider Calligo Ltd. has been running its cloud network on the SolidFire platform since it was released two years ago.Along with its all-flash storage systems, the company also touts its in-line data reduction techniques that is claimed to offer as much as a ten-fold increase in data reduction without degrading storage performance. The result, SolidFire says, is an all-flash storage system priced under $3 per GB and less than $1 per IOPS.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-11-20 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "array",
        "Flash",
        "SolidFire",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/array/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/solidfire/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/flash-disk-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}