{
    "title": "Call to ARM: Huawei Claims Highest Performance ARM-based CPU",
    "text": "Momentum around ARM’s breakout into mainstream computing continued today as Huawei unveiled what the Chinese tech giant touted is the industry’s highest performing ARM-based CPU, targeting big data, distributed storage and ARM-native application scenarios.Called Kunpeng 920, the Huawei-designed 7nm-process chip is based on the ARMv8 architecture license. At typical frequency, it scores more than 930 in the SPECint Benchmark, which is 25 percent higher than the industry average, according to Huawei, while delivering 30 percent better power efficiency. “It significantly improves processor performance by optimizing branch prediction algorithms, increasing the number of OP units, and improving the memory subsystem architecture,” the company said in its announcement.Kunpeng 920 integrates 64 cores at a frequency of 2.6 GHz. This chipset integrates right-channel DDR4, and Huawei said memory bandwidth exceeds existing ARM offerings by 46 percent while offering improved system integration capabilities through its two 100G RoCE ports. The chip supports PCIe 4.0 and CCIX interfaces, and provides 640 Gbps total bandwidth. Single-slot speed is “twice that of the incumbent offering,” Huawei said, improving the performance of storage and various accelerators.Huawei today also released three models of the TaiShan series of Kunpeng 920-powered servers – one focused on storage, another on high density and a third focused on balancing both requirements, according to the company, touting advantages in many-core and performance per watt.“TaiShan will enable computing platforms with high performance and low power consumption for enterprises,” the company said. “For example, in big data scenarios, the TaiShan servers are tuned for optimal many-core high concurrency and resource scheduling to deliver a 20 percent computing performance boost.”Huawei said its ARM initiatives are ongoing within an open, collaborative ARM ecosystem. The company works with such organizations as the Green Computing Consortium (GCC), Linaro, and Open Edge and HPC Initiative (OEHI) in cooperation with Hortonworks, Microsoft, Oracle, SAP, SUSE, Ubuntu, and China Standard Software.On the hardware side, Huawei is a core member of Linaro and, on the software side, it’s a member of the OpenStack Foundation and the Cloud Native Computing Foundation (CNCF).“Huawei believes that an intelligent society with all things connected, sensing, and intelligent is underway, and this trend is picking up speed,” the company said. “The development and convergence of ARM-based applications on smart terminals are accelerating, along with cloud-device collaboration. In addition, new applications in cloud computing are driving data diversity. For example, big data applications, distributed storage, and some edge computing scenarios have specific energy efficiency requirements for many-core high-performance computing. In such a context, ARM systems stand out with unique advantages in performance and power consumption… (A) new era of diversified computing is unfolding. Multiple data types and scenarios are driving computing architecture optimization. Combining multiple computing architectures for optimal performance becomes a must.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2019-01-07 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Datacenter",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "ARM",
        "huawei"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/arm/",
        "https://www.enterpriseai.news/tag/huawei/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/Huawei-Kenpung-920-010719-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/Huawei-Kenpung-920-010719.jpg"
    ]
}