{
    "title": "SUSE Deal Includes Ceph Storage Project",
    "author": "George Leopold",
    "date": "2016-11-10 00:00:00",
    "text": "Weeks after forging a Linux partnership with Hewlett-Packard Enterprise (HPE), OpenStack and Linux specialist SUSE said it is acquiring the software-defined storage management framework of German technology firm IT-Novum that includes an open-source Ceph storage project.SUSE, Nuremberg, Germany, said this week the deal is its first acquisition since the enterprise software company was founded in 1992. Terms were not disclosed.The deal to buy IT-Novum, Fulda, Germany, transfers the OpenATTIC project to SUSE, the Ceph-based storage management framework. SUSE said the latest release of its enterprise storage platform includes an interface based on OpenATTIC. \"The license of the [OpenATTIC] software or openness of the development process won't change\" after the acquisition is completed, stressed project administrator Lenz Grimmer.The IT-Novum deal is the latest in a series of partnerships and moves aimed at expanding software-defined infrastructure offerings at SUSE. These include OpenStack infrastructure-as-a-service and distributed storage based on Ceph object, block and file system storage. The Linux specialist also is a player in the development of Docker application container and Kubernetes orchestration infrastructure.Michael Miller, president of strategy, alliances and marketing at SUSE, said the company expects to make additional technology acquisitions \"where it makes sense for our growth strategy and our open source development and business model.\"As part of a spinoff and merger of its \"non-core' software asserts in September to SUSE parent company Micro Focus (LSE: MCRO.L), HPE (NYSE: HPE) designated SUSE as its preferred Linux partner. The move combines HPE’s Helion OpenStack and Stackato platforms with SUSE’s OpenStack distribution.Those moves are designed to expand SUSE's portfolio spanning the enterprise Linux operating system, OpenStack cloud infrastructure and Ceph storage, the company said. They also contribute to widening efforts aimed at leveraging different distributions of Ceph storage in software-defined datacenters.\"What we need now is a totally different kind of [storage] technology and an approach because the workloads are demanding that,” asserted Avinash Lakshman, the former Amazon and Facebook engineer who now heads storage startup Hedvig.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}