{
    "title": "Network Filers Take To The Clouds",
    "text": "Most disk storage arrays are based on commodity hardware these days. Generally speaking, they use Xeon processors from Intel as their controller brains, they use normal main memory as a read cache, and maybe some kind of nonvolatile memory as a write cache. The disk controllers and disk drives are commodities, too. The real differences between one vendor and another come down to the software that runs on top of this hardware, providing various data management features – snapshotting, replication, compression, thin provisioning, and so forth – and, importantly for enterprises, a consistent interface and workflow with which they are familiar.The trouble with the public cloud is that it uses a completely different kind of storage from the block-level devices that enterprises deploy for their key applications and databases. Yes, Amazon has its Elastic Block Store (EBS) service, but that is not the same thing as having a network-attached storage (NAS) filer that is the same as the one in your datacenter. So moving workloads to the public cloud either means re-architecting the application to use these cloud storage services or, in some special cases, finding a public cloud provider that has a bank of the same type of storage arrays you use co-located in their own datacenters or with partners that are nearby.There is a third and perhaps more interesting option, and one that could become increasingly popular among storage array providers in the coming years. And that is to actually port the storage array operating system to a public cloud, turning its raw compute and storage capacity into what is, for all intents and purposes, a virtual implementation of the storage array.This is precisely what NetApp has done with its Cloud ONTAP storage operating system, and should the idea take off, you can bet that other physical storage array makers will follow.The Cloud ONTAP service announced by NetApp this week is literally the same Clustered Data ONTAP 8.3 software update that also debuted this week for NetApp's FAS family of physical storage arrays, but it has been carved up to run on Amazon's EC2 compute and EBS storage services. For now, the service does not expand anywhere near to the capacity of a high-end FAS array from NetApp, explains George Kurian, executive vice president of product operations, to EnterpriseTech. Think of it as providing the capabilities of an entry FAS 2000 series array. All of the ONTAP features that are available on a physical FAS array can be used with this cloudy array.At the moment, says Kurian, the Cloud ONTAP service is being pitched as a tool for application development, allowing programmers to fire up a NetApp filer in the clouds to create and test applications. Data is moved from the production datacenter where physical FAS arrays are located to the Cloud ONTAP service using the SnapMirror function of the ONTAP operating system and a new add-on to the OnCommand Insight management tool called OnCommand Cloud Manager.But over time, as the cost of EC2 and EBS come down, it could turn out that the Cloud ONTAP service offers a compelling alternative to the NetApp Private Storage service that the company offers in conjunction with Amazon Web Services, Microsoft Azure, and now, as of this week, IBM SoftLayer.With NetApp Private Storage, physical FAS arrays are parked in Equinix datacenters with direct links to these public clouds so they look like locally attached network filers as far as compute instances on those clouds are concerned. Both Cloud ONTAP and NetApp Private Storage are controlled through the new OnCommand Cloud Manager, which monitors AWS resource use as well as controls ONTAP licenses as they are moved onto the AWS cloud.The Cloud ONTAP service makes use of EBS instances that are based on solid state drives, not disk drives. Specifically, NetApp is using the EBS General Purpose (gp2) EBS volume type, which has a 1 TB maximum volume size, around 3,000 IOPS of burst maximum per volume, and about 48,000 IOPS maximum per instance. The EBS gp2 instance tops out at about 800 MB/sec of maximum throughput, and is intended for boot volumes, development and test environments, and for small and midsized databases. Amazon charges 10 cents per GB per month for this instance in its US East region. AWS automatically replicates EBS data as part of its service and it also has its own snapshotting across AWS regions, but the point of Cloud ONTAP is to use the replication and snapshotting features of NetApp's stack.NetApp has chosen two different instance types for its Cloud ONTAP service on AWS in the M3 family, which is aimed at general purpose workloads that need a balance of compute, memory, and network, to run the Cloud ONTAP software. The m3.xlarge instance has four virtual CPUs based on Intel Xeon E5-2670 v2 processors, 15 GB of memory, and two of its own local 40 GB SSDs; it costs $439 to setup and 25.4 cents per hour. The m3.xlarge instance has eight virtual CPUs, 30 GB of memory, and two 80 GB SSDs; it costs $879 plus 50.8 cents per hour.NetApp has three different configurations of the Cloud ONTAP service, as you can see in the table above. Two of them will be available in the Amazon Marketplace, although they were not yet in there as EnterpriseTech went to press. These are available on an hourly basis. The Explore edition of Cloud ONTAP has 2 TB of capacity (meaning two EBS gp2 instances), while the Standard edition has five of these storage instances and a choice of compute. Customers who want to buy their own licenses to the Cloud ONTAP software can acquire a six-month subscription to cut their costs. NetApp is licensing Cloud ONTAP for under $5 per hour and all in it will cost under $10 per hour for a virtual Cloud ONTAP array with tens of gigabytes of capacity and several thousand I/O operations per second of throughput, according to Kurian. The pricing will depend on the features chosen above, and precise pricing for those configurations was not available. What Kurian could tell us is that the breakeven point where it is cheaper to buy a physical FAS array compared to a virtual Cloud ONTAP array on AWS was somewhere between six and nine months of continuous usage, again depending on the configurations. In the hierarchy of things, Cloud ONTAP is more expensive than NetApp Private Storage, which is more expensive than allocating the costs of a physical FAS array over the same time. As with all cloud services, you pay for flexibility.NetApp is not the first vendor to offer a cloudy NAS that runs atop AWS. Panzura offers its CloudFS, which it calls the \"NetApp of the Sky,\" on the Amazon Marketplace. Like NetApp, Panzura is offering a pay-as-you-go as well as a bring-your-own-license variant, and uses EBS backed by disk drives instead of flash drives. Its Global NAS Plus service runs on eight different EC2 configurations and links to EBS; Panzura is charging only $2.06 per hour to use its software compared to the under $5 per hour that NetApp is charging for Cloud ONTAP.SoftNAS is another provider of cloud-based NAS software, and it has ported its eponymous software to run atop Microsoft Azure, Amazon Web Services, and VMware vCloud Air. SoftNAS has a variable pricing scheme for its software that changes along with the EC2 instance type it is deployed on, ranging from a low of 45 cents per hour to a high of $6.82 per hour, not including the cost of the EC2 and EBS services.NetApp has the largest installed base of network-attached storage customers in the datacenter and probably will have an easier time selling into its own accounts than either Panzura or SoftNAS. And NetApp's entrance into the market puts a seal of approval on the idea. At this point, the cloud NAS is so relatively new that it is hard to predict what will happen. But as we said above, as the prices for EC2 and EBS come down, and the performance of cloud NAS software gets better, it stands to reason that enterprise customers will choose the storage software they know if the scalability and performance of the virtual array is good and the pricing makes sense. Whether NetApp can attract new customers is another issue entirely. Many companies will probably use the replication, compression, and snapshotting features that are built into the storage services at public clouds, but if NetApp Cloud ONTAP is available on all of the major clouds, then this could become a kind of standard that allows applications to be more easily ported across those clouds. Time will tell.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-10-29 00:00:00",
    "cats": [
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS",
        "azure",
        "Cloud ONTAP",
        "NetApp",
        "Panzura",
        "SoftLayer",
        "SoftNAS"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/azure/",
        "https://www.enterpriseai.news/tag/cloud-ontap/",
        "https://www.enterpriseai.news/tag/netapp/",
        "https://www.enterpriseai.news/tag/panzura/",
        "https://www.enterpriseai.news/tag/softlayer/",
        "https://www.enterpriseai.news/tag/softnas/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/database-cloud-logo-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/netapp-cloud-ontap.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/netapp-cloud-ontap-table.jpg"
    ]
}