{
    "title": "Enterprise Networks Still Falling Short",
    "author": "George Leopold",
    "date": "2019-09-16 00:00:00",
    "text": "Network bandwidth and overall performance remain concerns for digital enterprises as they roll out data analytics and edge computing efforts.Nearly two-thirds of companies surveyed by management consultant Accenture (NYSE: CAN) said their enterprise networks are not up to the task of handling big data and Internet of Things deployments. A key reason is a “misalignment between IT and business needs” that is stymying those rollouts.Only 43 percent of those companies polled said their networks are ready to support cloud and other digital technologies.Network bottlenecks continue to grow as data volumes soar and companies seek to deploy analytics and other big data technologies to make sense of it all. Hence, the Accenture survey found that bandwidth demands were not being met while current network performance continues to fall short in terms of what users require. (Both were cited by 45 percent of respondents as ongoing issues.)Accenture reported that most companies surveyed are deploying software-defined networks to address bandwidth and performance challenges. As they embrace a “unified enterprise network” approach, the survey said “it was clear that the majority continue to see their networks in pieces and parts.”Most said they are already using IoT, edge computing and big data analytics technologies along with cloud-based customer and employee tools. While most are generally satisfied with network reliability and security, bandwidth and “overall capability” continue to fall short.The disconnected over network performance was reflected in the diverging views of users and IT teams. CIOs and CTOs were generally satisfied with network performance; executives and hands-on users were not. Nevertheless, IT specialists were relatively sanguine about the ability to boost network bandwidth over the next 18 to 24 months.Among the reasons are emerging technologies like NVM Express over storage network fabrics and a vibrant developer community coalescing around emerging technologies like service meshes. Meanwhile, the HPC network fabric  market in which computing extends into the network is pushing InfiniBand and other networking technologies into enterprise applications for both HPC and AI workloads.Along with “misalignment” between IT and users, which was cited by 58 percent of CIOs and CTOs, the survey revealed concerns about the “inherent complexities” of running demanding AI and other workloads and the ability of operational teams to support them. Those concerns were cited by 57 percent of “line of business” vice presidents.Bandwidth demands (54 percent) and aging equipment (49 percent) were not far behind.Accenture said it surveyed 300 IT and business executives at companies with revenues of more than $1 billion. Ten industries in seven countries were represented. Network vendor Cisco Systems (NASDAQ: CSCO) collaborated on the report.Hence, it is not surprising that a key recommendation of the network survey is broader application of software-defined technologies to overcome bottlenecks between legacy and virtualized networks.Concludes the survey: “Such networks lack the security, automation and analytics needed to manage business applications, leverage the cloud and interface with a proliferation of devices.”George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/the-future-AI-IoT-big-data-networks-shutterstock_1173049735-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}