{
    "title": "Management Shakeup at Dell EMC Designed to Streamline Systems Development, Delivery",
    "author": "Doug Black",
    "date": "2018-01-26 00:00:00",
    "text": "Reverberations from Dell’s acquisition of EMC in October 2015 – at $67 billion, the biggest in the history of the technology industry – have extended into 2018 with the news that the company’s core server and storage business units will absorb its Converged Platforms and Solution Division (CPSD), formerly located within Dell EMC’s Infrastructure Solutions Group (ISG), according to published reports.Matt Baker, Dell EMC SVP of strategy and planning, told CRN that “CPSD as we know it today as an independent organization is no longer.” The goal, he said, is to move the company’s hyperconverged and converged solutions “closer to our core product groups” with the intent of streamlining systems development and delivery.A spokesperson for the company said Dell EMC’s org chart “is designed to help simplify our organization for clear lines of decision making, get our products to market faster and align our teams to our biggest priorities.”The shakeup has major implications for Dell EMC’s HPC and hyperconverged infrastructure teams, which are being moved to the Server Division led by Ashley Gorakhpurwalla, divisional president and general manager; meanwhile, Gil Shneorson will remain in leadership of Dell's VMware-aligned Hyperconverged Infrastructure (HCI) products and Dan McConnell will continue as the head of its ecosystem HCI offers, and both will report to Gorakhpurwalla, according to the CRN story.Meanwhile, Dell EMC's converged infrastructure team will be folded into the company's Storage Division under the leadership of Jeffrey Boudreau, the division’s SVP/GM. Observers noted that the shakeup could be designed to jumpstart Dell EMC’s storage division, which company executives have conceded has lost market share of late.Baker said that Chad Sakac, formerly head of CPSD, will continue to be an infrastructure leader at Dell EMC, though he has not yet been given an official title.  The Ready Solutions group, except for the HPC and cloud groups, will come under the leadership of Kash Shaikh, VP product management and marketing.The restructuring was carried out under the direction of ISG President Jeff Clarke, a 30-year Dell veteran who took over for David Goulden, a former top EMC executive, four months ago.The restructuring has been favorably received by at least two industry analysts.“The reorg makes good business sense ,” said Chirag Dekate, research director, HPC, machine learning, emerging compute technologies, Gartner. “It will help Dell rationalize product portfolios and cross-pollinate technologies from HPC across a broader set of market segments. With digital business initiatives gathering steam across enterprises, HPC-inspired ideas can prove to be a real differentiator in the new infrastructure stack.”“This reorg is all about speed of decision making and efficiency,” said Patrick Moorhead, president and principal analyst, Moor Insights & Strategy. “I’m looking at how it was architected, and on paper it definitely does that. There’s less people in the decision making process, which is good for a company of their size.”The restructuring comes amid other reports in Bloomberg and the Wall Street Journal that Dell Technologies, which went private in 2013, may be considering going public again. The reports say that a Dell IPO would be intended to raise money to pay debt, which currently amounts to $50 billion.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/Dell-EMC-logo-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/Michael-Dell-1017-e1507822849306-169x300.jpg"
    ]
}