{
    "title": "HPE Targets Data at Network Edge",
    "author": "George Leopold",
    "date": "2018-06-22 00:00:00",
    "text": "Amid a flurry of cloud and networking initiatives announced by Hewlett Packard Enterprise was a commitment to invest $4 billion over the next four years to develop new technologies and services that would connect soaring data volumes at the network edge to “any cloud.”The company (NYSE: HPE) unveiled its “intelligent edge” initiative during a company event this week in Las Vegas. It also announced a “pay-as-you-go” hybrid cloud effort designed to automate operations as well as a cloud storage service intended for storage-intensive AI and analytics applications.“Data is the new intellectual property, and companies that can distill intelligence from their data —whether in a smart hospital or an autonomous car—will be the ones to lead,” said Antonio Neri, HPE’s CEO and president. “With this investment, we are accelerating our ability to drive this growing category for the future.”The average $1 billion annual investment through 2022 represents a bet that huge volumes of enterprise data generated by network devices will be processed outside a central datacenter or private cloud. Examples include medical devices and the retail store floor. “Turning that data into intelligence requires data to be analyzed at the edge, seamlessly and instantaneously, with zero tolerance for friction or latency,” the company added.Investments would target research and development of new services and consumption models that address networking technologies ranging from AI and machine learning to security, automation and edge computing. As demand grows to move processing power closer to where data is generated, the initiative also would support HPE’s “memory-driven computing” efforts intended to accelerate local computing at the network edge.Among the company’s early forays into edge intelligence is a partnership with Streamr, which specializes in helping customers monetize their data via its blockchain-based data sharing platform. The collaboration is developing a service that lets users collect and store data generated by an individual car, giving the driver control over and the ability to monetize their data.The edge-to-cloud initiative also includes an extended storage adapter feature intended for AI, analytics and “databases at the edge” deployments. The storage adapter is based on industry-standard storage management tools, HPE said.Separately, the company launched a hybrid cloud initiative dubbed GreenLake designed to manage consumption of private and public cloud resources. The pay-per-use consumption service targets delivery of cloud-native operations, compliance and usage controls for, among others, Amazon Web Services (NASDAQ: AMZN), Microsoft Azure (NASDAQ: MSFT) and Azure Stack, the hybrid application tool for delivering Azure services in datacenters.The automated service delivers a cloud-native model designed to eliminate the need to train administrators to manage cloud implementations.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}