{
    "title": "IoT Data Study Predicts Many Early Failures",
    "author": "George Leopold",
    "date": "2016-03-18 00:00:00",
    "text": "Most observers agree that enterprises must brace for the expected onslaught of unstructured data to be generated by the Internet of Things (IoT). The problem, according to a recent study, is that most of the proposed solutions for handling the data flood won't work.A recent Gartner report exploring the impact of IoT on enterprise infrastructure assumes that 25 percent of all attempts to harness IoT data will be abandoned before they are even deployed \"due to a lack of information capabilities adapted for the IoT.\"Those in charge of implementing IoT strategies, including those overseeing data governance, \"are not prepared for the information-related implications of the Internet of Things,\" the study warns. \"The IoT will challenge their capabilities, skills, processes and tools with complexity and scale, as well as new governance implications.\"As \"business becomes data and data becomes business,\" information management is increasingly seen as a core competency. Along with addressing the obvious scaling issues associated with the massive data volumes to be generated by connected IoT devices, the market researcher stressed data governance capabilities along with the need for distributed data architectures that can meet \"variable latency\" requirements.While data management capabilities top the list of IoT requirements, Gartner also recommended development of new capabilities needed to manage emerging distributed data architectures that support analytic applications while at the same time executing distributed data governance processes.Given its prediction that one-quarter of early IoT implementations will be abandoned, Gartner touts an \"information capabilities framework\" designed as a template for enterprises to begin getting their arms around IoT data. The framework starts by leveraging metadata to assess the value of information and to promote proper governance. At the point, IoT can be organized, integrated into the enterprise and shared once data governance policies are set.A key task for IoT data managers will be developing the IT framework needed to \"structure and position information assets,\" the researcher noted. For starters, that means rethinking storage capacity along with how and where IoT data is accessed.Gartner predicts that existing storage will be quickly overwhelmed with unstructured IoT data. \"A limited ability to cost-effectively scale existing storage approaches will create a bottleneck,\" the researcher warned.\"With the highly distributed architectures required for most IoT solutions (many things, many places where data is generated, many platforms on which data is processed, and many consumption points to which data must be delivered), the historical approach to centralized collection of data is under pressure. Organizations must support a more distributed data architecture, because IoT solutions are inherently distributed,\" the researcher noted.That means data managers must determine what data to keep and where to store it. The type of IoT architecture deployed, whether based on connected \"things\" or cloud platforms, for example, will increasingly determine where IoT data is stored, Gartner asserted. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/IoT2-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}