{
    "title": "Google, VMware Partner on Hybrid Cloud Tools",
    "text": "Google and VMware are collaborating on a new cloud plug-in connecting a pair of VMware tools designed to enable provisioning of virtual machines and storage on the search giant’s cloud.The partners this week released a preview version of a Google cloud plug-in for VMware’s vRealize orchestrator and support for the public cloud on the VMware’s platform for automated provisioning. The combination addresses hybrid cloud customers using VMware software on-premises.The partners said Thursday (July 19) the orchestration and automation tools would allow Google users to deploy and manage cloud resources within the vRealize automation tool, including the provisioning of Google Compute Engine virtual machines.Along with reaching new cloud regions and leveraging Google’s load balancing and automatic scaling features, other use cases enabled by the plug-in include tapping into Nvidia (NASDAQ: NVDA) Tesla P100 GPUs running on the Google cloud. (Google began offering the Nvidia GPUs in May through its infrastructure-as-a-service offering Compute Engine and on Kubernetes Engine, its managed environment for deploying containerized applications.)VMware said the capability could be used for scenarios such as accelerating training of machine learning models.The cloud connection also would allow VMware users to replicate and scale in-house distributed applications in the cloud. “This plug-in allows you to start provisioning VMs and storage to [the Google cloud] as well as publish blueprints that include Google Compute Engine VMs and storage buckets in your self-service catalog,” Colby Heiner, a VMware cloud product marketing manager, added in a blog post.The plug-in will be available shortly on VMware’s marketplace. VMware (NYSE: VMW) also said it plans to link to more Google cloud services.“We’re working together with VMware to add support for additional [Google cloud] products such as cloud TPUs,” or Tensor processing units, Shan Kulandaivel, a Google cloud product manager, noted in a separate blog post announcing the collaboration.The VMware plug-in is the latest addition to the Google cloud tool chest. Along with a series of tools based on its Kubernetes Engine, Google (NASDAQ: GOOGL) has been steadily adding new cloud features as it strives to keep pace with public cloud leaders Amazon Web Services (NASDAQ: AMZN)and Microsoft Azure (NASDAQ: MSFT). Among them is a new data orchestrator dubbed Cloud Composer, a managed service based on Google’s distribution of the Apache Airflow workflow management tool. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-07-20 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Google",
        "Hybrid Cloud",
        "orchestrator",
        "plug-in",
        "TPUs",
        "VMs",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/google/",
        "https://www.enterpriseai.news/tag/hybrid-cloud/",
        "https://www.enterpriseai.news/tag/orchestrator/",
        "https://www.enterpriseai.news/tag/plug-in/",
        "https://www.enterpriseai.news/tag/tpus/",
        "https://www.enterpriseai.news/tag/vms/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/shutterstock_hybrid_cloud-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}