{
    "title": "Pure Storage Launches IPO as Flash Eyes Mainstream",
    "text": "All-flash storage array specialist Pure Storage launched a $400 million initial public offering this week, one of the largest technology IPOs of the year, prompting other all-flash vendors to assert that the emerging storage architecture is entering the mainstream.Pure Storage (PSTG) announced on Tuesday (Oct. 6) it was setting its share price at $17 for its IPO of 25 million shares of common stock. The shares began trading Wednesday on the New York Stock Exchange, making it one of the largest technology IPOs this year. The Pure Storage shares opened lower in early trading.The storage specialist based in Mountain View, Calif., has been gaining traction and investment over the past year, raking in nearly $500 million in venture capital through 2014. The storage startup's market valuation exceeds $3 billion, the company said.Pure Storage has made steady headway with customers like LinkedIn in areas like database acceleration, virtualized server clouds and virtual desktop infrastructure. The startup hopes to capitalize on the shift for all-flash non-volatile memory as customers look for ways to accelerate databases without having to move from relational databases to in-memory or NoSQL data stores.\"The products we are crafting will ultimately compete with commodity server hardware and help change the way systems software like databases and file systems are architected,\" Pure Storage CEO Scott Dietzen noted last fall. Those comments signaled Pure Storage's strategy of taking on hyper-convergedstorage vendors as its offers its all-flash architecture as an alternative storage platform for critical enterprise workloads.Other all-flash vendors also sense an opening. Commenting on the Pure Storage IPO, Kevin DeNuccio, CEO of Violin Memory (VMEM), asserted, \"There is a strong appetite by enterprises to leverage flash storage in the datacenter. The industry is also further confirming that next-generation vendors are a key part of the massive disruption occurring in storage.\"Demanding enterprise storage requirements \"will further accelerate the pace of flash migration,\" DeNuccio added.Violin Memory, Santa Clara, Calif., launched its own largely unsuccessful IPO in late 2013 valued at $146 million. The failed IPO resulted in an investor class-action lawsuit. Violin Memory's stock price hovered at around $1.65 per share at midday Wednesday.Violin Memory unveiled a pair of all-flash arrays earlier this year along with a new operating system and management control system.Despite lackluster IPO performances so far, all-flash storage arrays are increasingly being used to replace all-disk and hybrid flash-disk arrays for the tier one storage that underpins applications and databases in datacenters. Major vendors like EMC, IBM and Pure Storage all report steady uptake. Market researcher Gartner recently ranked Pure Storage as its market leader for solid-state storage arrays, followed by EMC, IBM and Hewlett-Packard (HPQ). Gartner ranked Violin Memory among \"niche players\" in the all-flash market.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-10-07 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "All-flash storage",
        "IPO",
        "Pure Storage",
        "Violin Memory"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/ipo/",
        "https://www.enterpriseai.news/tag/pure-storage/",
        "https://www.enterpriseai.news/tag/violin-memory/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/Screen-Shot-2015-10-07-at-12.28.14-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}