{
    "title": "Undeterred, VCs Bet on Cloud, Data Startups",
    "text": "If the global economy is to recover from a pandemic that has so far killed tens of thousands while disrupting supply chains and causing widespread unemployment, the technology sector must play a key role. Investors are beginning to put more of their money where their mouth is, at least for now.This week brought a spate of sizeable venture investments in increasingly important cloud-based technologies, signaling perhaps that those disruptive platforms could help lead a post-pandemic recovery.Here’s a sampling.Dremio, the data lake and analytics specialist, said Thursday (March 26) it closed a hefty $70 million Series C funding round that included new investor Insight Partners. Existing investors include Cisco Investments, Lightspeed Venture Partners,  Norwest Venture Partners and Redpoint Ventures.The Silicon Valley startup said it will use the cash infusion to scale operations centered around its flagship data lake engine. The platform is based on the open-source, in-memory, columnar data format Apache Arrow, designed to make it easier for data scientists and analysts to query data located in multiple locations.The goal is to leave data in place, then provide a semantic data access layer atop it. That capability is billed as providing the benefits of a data warehouse without the time, expense, and complexity of engineering ETL scripts and data warehouse assembly.The platform “makes analytics directly on data lake storage fast, efficient and secure, which drives down cloud infrastructure costs,” Dremio CEO Billy Bosworth said.Other hybrid infrastructure-related investments announced this week included Humio, the log management platform developer, and SoftIron, the U.K.-based datacenter appliance vendor.Humio closed a $20 million Series B funding round this week led by Dell Technologies Capital. The startup has so far raised $32 million.Humio’s log management platform is used to collect real-time data on the health of enterprise infrastructure, including application down-time and security threats. The startup’s approach allows users to sift through huge volumes of log and event data by integrating structured and unstructured data logs in real time.The company also this week announced a cloud plan for ingesting unlimited amounts of data as a complement to a self-hosted scheme introduced nearly two years ago. The intent is to allow users to scale access to larger data volumes. As an adjunct, Humio’s “bucket storage” boosts data ingestion and retention beyond 1 petabyte.Elsewhere, SoftIron announced a $34 million equity funding round by a group of existing investors led by co-founder Norman Fraser. The London-based company said this week it will use the funds to expand its portfolio of datacenter appliances based on open source software.SoftIron recently released the latest version of its network switch based on an network operating system called Sonic, as in Software for Open Networking in the Cloud. Cisco System (NASDAQ: CSCO) and cloud partner Microsoft (NASDAQ: MSFT) launched the open source initiative to manage network devices as operators encounter bottlenecks spawned by the exponential growth of data storage and raw computing power required for data-driven enterprise applications.SoftIron’s target market includes “organizations looking to leverage open source and transition their mission-critical computing away from proprietary vendor lock-in,” said Harry Richardson, SoftIron’s chief scientist.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2020-03-26 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Networks",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Networks",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "Analytics",
        "cloud",
        "data lake",
        "Dremio",
        "Humio",
        "investment",
        "log management",
        "network appliances",
        "SoftIron"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/analytics/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/data-lake/",
        "https://www.enterpriseai.news/tag/dremio/",
        "https://www.enterpriseai.news/tag/humio/",
        "https://www.enterpriseai.news/tag/investment/",
        "https://www.enterpriseai.news/tag/log-management/",
        "https://www.enterpriseai.news/tag/network-appliances/",
        "https://www.enterpriseai.news/tag/softiron/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/tech_investment-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}