{
    "title": "Investors Back Storage Startups",
    "text": "The storage sector continues to attract investment as more vendors emerge to help enterprises cope with the demands of storage and quickly accessing more data.Earlier this month, a pair of storage startups announced significant late-round funding: all-flash storage vendor Kaminario said it raised $75 million while hybrid cloud storage specialist Panzura announced a $32 million funding round.Panzura, Campbell, Calif., said it would use the funds to expand its hybrid cloud strategy that focuses on leading the transition from on-premise to cloud storage for advanced database and virtualized workloads, big data analytics and emerging Internet of Things (IoT) applications.The company claims to have installed more than 26 petabytes of new enterprise storage in 2016 via alliances with public cloud vendors such as Amazon Web Services (NASDAQ: AMZN), Google (NASDAQ: GOOGL), IBM (NYSE: IBM) and Microsoft Azure (NASDAQ: MSFT). Customers for its hybrid cloud network-attached storage platform include companies and government agencies in more than 30 countries.Panzura said the funding round was led by Matrix Partners and joined by Meritech Capital Partners, Opus Capital, Chevron and an undisclosed strategic investor. Also joining was storage and disk drive leader Western Digital Corp. (NASDAQ: WDC).Kaminario, the all-flash storage vendor founded in Israel and based in Needham, Mass., said its latest funding round pushes its total financing to $218 million. The company competes against market leaders such as Dell EMC and Pure Storage.Kaminario CEO Dani Golan noted that \"on-demand applications,\" the IoT and the shift to cloud storage are transforming the datacenter, creating greater demand for agile, all-flash architectures. The vendor specializes in a software-defined all-flash storage platform that is able to scale for emerging enterprise workloads. The funding would be used to integrated emerging storage and networking technologies such as Non-volatile Memory Express and NVMe Fabric.Waterwood, a private equity firm, led Kaminario's latest funding round. Also participating were new and existing investors, including Sequoia, Pitango, Lazarus, Silicon Valley Bank and Globespan Capital Partners. The company said it would use the funds to expand its global presence along with funding research and development.The funding underscores the gradual shift in the datacenter to all-flash arrays as prices decline and new platforms hit the market. For example, IBM unveiled a family of all-flash options earlier this month for mainframe environments, including a high-end \"analytics-class\" storage option.These and other introductions are expected to propel the all-flash array market forecast to grow at a 21.4-percent annual clip over the next five years, according to market analyst International Data Corp. That would make flash storage one of the fastest growing segments of the estimated $40 billion global enterprise storage market.Another market tracker, Wikibon, predicted a 19 percent increase in enterprise spending on all-flash storage during 2016, and projects that flash spending will overtake disk storage spending by 2019.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-01-17 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "All-flash storage",
        "cloud",
        "funding",
        "hybrid cloud storage",
        "Kaminario",
        "NVMe",
        "Panzura",
        "VC"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/funding/",
        "https://www.enterpriseai.news/tag/hybrid-cloud-storage/",
        "https://www.enterpriseai.news/tag/kaminario/",
        "https://www.enterpriseai.news/tag/nvme/",
        "https://www.enterpriseai.news/tag/panzura/",
        "https://www.enterpriseai.news/tag/vc/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}