{
    "title": "Tabor Communications Announces Rebranding of EnterpriseTech: EnterpriseAI",
    "author": "Doug Black",
    "date": "2019-03-19 00:00:00",
    "text": "Tabor Communications, publisher of high performance technology publications HPCwire, Datanami and EnterpriseTech, has announced that EnterpriseTech has been re-branded as EnterpriseAI. The new name reflects the publication’s increased focus on AI in recent years and increased interest in AI, machine learning, deep learning, robotics and other AI-related technologies among enterprise IT strategists.“EnterpriseTech, focused since its founding on enterprise adoption of advanced scale technologies developed by the HPC and open source communities, has closely covered AI technology and AI implementation strategies in recent years – the change to EnterpriseAI expresses our intent to further sharpen and build upon the publication’s AI focus,” said Tom Tabor, publisher. “There’s enormous demand from IT strategists for news and insight about AI trends and technologies. Our intent is to make EnterpriseAI an indispensable meeting ground for information, analysis and discussion for those who develop and use AI.”EnterpriseAI defines “artificial intelligence” broadly to include all the technologies – machine and deep learning, cognitive computing, bots, robotics, industrial automation and AI silicon – that support previously unattainable analytics, automation, autonomous and simulation workloads. The publication also will cover new computing strategies used in distributed AI implementations, including IoT, blockchain and edge-core-cloud infrastructures.EnterpriseAI takes its place alongside Tabor Communications’ portfolio of publications which, since 1988, have formed an advanced computing nexus, including flagship publication HPCwire covering supercomputing and HPC technologies, and the widely read Datanami covering software, data management and application aspects of big data, high performance data analytics and AI. Along with EnterpriseAI, this three-pronged source of information delivers a broad, holistic perspective on advanced technologies’ impact across the scientific and industrial landscapes.In recent years, as organizations have embraced more complex near/real-time analytics, this publication has put more emphasis on accelerated investment in AI technology and technical expertise. Among our readers and our conference attendees (at Tabor’s Advanced Scale Forum, HPC & AI on Wall Street), there is greater interest in AI-related capabilities – from predictive analytics for customer behavior, weather forecasts, energy consumption, equipment maintenance and market sizing; to faster and more accurate seismic exploration; to breakthrough innovations, efficiencies and quality in product design and manufacturing. AI is at the apex of advanced-scale enterprise technology trends that have been in place for decades: it’s is at the convergence of increasingly powerful compute, the data deluge, accelerated networks and advanced algorithms.EnterpriseAI covers enterprise AI in its most advanced form as well as in the broader market level. At the “high end,” the publication will cover AI technologies and implementations adopted by the most resource-rich organizations in the web-scale, hyperscale, financial services, retail and other industries seeking critical competitive advantage attainable from leading-edge, customized AI implementations.At the AI “mid-level” market, EnterpriseAI will pay attention to AI democratization trends: technologies and techniques for simplifying and automating aspects of AI that currently require teams of computer/data scientists typically lacking in the broader enterprise market.  EnterpriseAI will aim to de-mystify AI, to open the “black box” and examine practical, adoptable deployment strategies – how organizations are deriving insight from expanding, mixed-format volumes of data with algorithm-driven learning systems that use circular, enriching data loops to continually improve at a given task. A rapidly expanding ecosystem of established and start-up technology vendors are putting their full weight behind AI democratization. EnterpriseAI will provide insight into how those technologies are incorporated into organizations’ AI strategies.Also within the publication’s scope are off-prem (cloud and colo) offerings placing extensive data center infrastructure requirements for AI within the reach of more organizations.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/AI-generic-data-enterpriseai-shutterstock_1226078638--370x290.jpg"
    ]
}