{
    "title": "NVMe, Single Tiering, Data Awareness and Other High Performance Storage Trends for 2020",
    "author": "no author",
    "date": "2020-02-03 00:00:00",
    "text": "High performance storage is changing as data (particularly unstructured data) volumes grow, data management becomes increasingly complex, diverse file types proliferate and AI/machine learning is more broadly adopted. According to Molly Presley, storage specialist Qumulo Corp.’s global product marketing director, here are key developments to expect in the storage sector for the coming year.NVMe file storage will be adopted broadly for performance starved, low-latency applications \nNVMe is a communications protocol explicitly developed to optimized all-flash storage. NVMe enables an application to get the full performance out of the SSD storage devices that previously were not being optimally leveraged. It is geared for enterprise workloads that require top performance, such as video post-production, scientific research applications, financial service analytic applications and other latency-sensitive workloads. By the end of 2020, all NVMe file storage will be dominated by players that can deliver end-to-end value and performance to applications by optimizing the network, protocol interfaces, file system software and storage to eliminate bottlenecks.Data-driven businesses will shift more workloads to the cloud for data processing, machine learning (ML) and artificial intelligence (AI)\nEvery major enterprise in the world is going to become a hybrid enterprise. The public cloud gives organizations access to virtually unlimited compute power and a wide variety of applications not available in their data centers. According to a report, Hybrid Cloud Trends and the Role of Active Unstructured Data, prepared by ESG, 85 percent of organizations have distributed unstructured data workloads today that span multiple data centers. By the end of 2020, the majority of these will include a public cloud component for cloud application processing work.Modern file storage will become the preferred technology for on-prem unstructured data active archives\nModern file storage solutions deliver performance and economics in a single-tier solution managed by intelligent caching. Legacy NAS architectures with scale limitations and object storage, which introduce tiering into the workload, are not the best fit for customers seeking simplicity to deliver application performance and cost-effective retention. Modern file storage meets all of the needs of an unstructured data environment: extreme scale, high performance, cost-effective.As the scale and geographic distribution limitations emerged in legacy NAS environments, object storage was developed. By the end of 2020, we expect to see modern file storage to be fully adopted as the solution of choice on-premises, driving simplicity, performance and economics from a single solution. In hybrid and cloud environments, modern file storage will manage data ingest and active data processing, then move data to cloud object stores such as S3 and glacier for retention.Single-tier solutions delivering the simplicity users desire will gain favor over multiple-tier storage solutions \nEnterprise organizations have been relying on tiering systems to manage the location of data and to get to a blended price point for the entire system. Many storage environments will have a variety of storage technology: SSD, disk and cloud. However, customers shouldn't have to manage these storage technologies via policies that move data up and down the tiers; the system should be able to manage automatically. Through 2020, customers will increasingly require single-tier file storage solutions that automate the process of leveraging memory, cache and capacity storage without IT intervention or affecting application performance and user workflows.Enterprise, distributed, cloud-native file systems will enable customers to shift to the cloud faster without compromising on features or scale\nEnterprises are eager to take advantage of the benefits offered by the cloud and to have these cloud resources as an integral part of their overall data environments. However, file system technology limitations have slowed this adoption for unstructured data in the cloud. Many of the cloud-native file services lack enterprise features such as sharing data across SMB and NFS for Linux, Windows and Mac environments. They also lack the ability to snapshot and replicate across on-prem and multi-cloud environments. In parallel, constraints with legacy file systems in the datacenter limit their use in the cloud, particularly for active data. Over the next twelve months, file in the cloud will land on enterprise-proven, cloud-native file systems that offer the same capabilities on-prem, in the cloud and across hybrid environments.Data awareness will be built into all technologies to help customers with massive volumes of unstructured data\nOne of the greatest challenges in file storage, at scale, has been knowing what data you have, who is using it, how it is growing and where bottlenecks are occurring. Data-driven organizations require real-time analytical tools to make well-informed decisions regarding their data. Unstructured data is directly tied to better decision making and increasing competitiveness in delivering new products and business strategies. In 2020, vendors will need to help customers understand which of their data is hot or cold and organize and curate this data by their own business logic.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/data-center-shutterstock-315953603--370x290.jpg"
    ]
}