{
    "title": "Storage Startup Brings DevOps Approach to Datacenters",
    "author": "George Leopold",
    "date": "2016-04-12 00:00:00",
    "text": "Building on the growing enterprise shift toward developer operations, a storage startup is emerging from stealth mode with and \"elastic\" data fabric approach that promises to deliver public cloud-like block storage to hybrid cloud platforms.Datera, founded by the creators of the Linux IO storage stack, also announced a $40 million funding round on Tuesday (April 12) that includes Silicon Valley heavy hitters like Khosla Ventures and Sun Microsystems co-founder Andy Bechtolsheim. Samsung Ventures also participated in the funding round, the startup announced.Datera, Mountain View, Calif., is positioning its data fabric as bringing the efficiency of block storage to cloud datacenters while delivering DevOps style operations. These \"API-first\" capabilities are intended to promote datacenter automation while extending programmability across IT infrastructure.The startup is betting that its flexible storage software can capitalize on the reality that developers are driving most enterprise workloads. Hence, there is a growing requirement for application developers to push code and workloads independent of the infrastructure supporting it. That means storage must be \"aware\" and more tightly integrated with emerging application orchestration tools.Along with integrating natively through iSCSI storage with OpenStack, the new data fabric also meshes with the VMware's (NYSE: VMW) vSphere virtualization platform as well as application container orchestrations platforms such as Docker, Google's (NASDAQ: GOOG) Kubernetes and Mesos.Datera's strategy includes delivering elastic storage services datacenters on a par with public cloud vendors like Amazon Web Services (NASDAQ: AMZN). \"Things scale up and down constantly. It's always in flux,\" Datera CEO and co-founder Marc Fleischmann noted in a statement unveiling the startup. \"At scale, you can't operate this kind of environment manually. It must be automated.\"The startup describes its elastic storage nodes as \"hyper-composed, multi-tenant iSCSI block storage\" clusters.Along with the automation emphasis, the startup is promoting a \"flash-first\" design approach to reduce latency to sub-millisecond levels across distributed storage media that includes hard drives and solid-state drives. That, it claims, will boost application performance along with access density.Industry analysts note that Datera's elastic block storage approach attempts to leverage software-defined technologies spreading throughout datacenters along with the next wave of cloud-native application workloads. The automation of IT infrastructure is designed to free developers to spend more of their time on speeding the delivery of new enterprise applications.Meanwhile, the startup's investors stressed that the scale-out storage software underlying the new data fabric can be used to transform commodity hardware into a RESTful API-driven storage fabric for large cloud platforms.Founded in 2013 by Fleischmann, Nicholas Bellinger and Claudio Fleiner, the creators and maintainers of the Linux IO storage stack, Datera's goal was to bring hyper-scale operations to private and public clouds. The startup said its data fabric has been deployed by several large companies and service providers.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}