{
    "title": "Fusion-io Doubles Up Flash With Atomic Cards",
    "text": "Flash card maker Fusion-io is riding the Moore's Law curve to double up the capacity and boost the performance of its flagship ioMemory devices with a new line of PCI-Express cards that bear the Atomic brand.The Atomic line is meant to span the needs of the hyperscale datacenter operators, like Facebook and Apple, who put Fusion-io on the map a few years back, as well as large enterprises that are increasingly using flash to accelerate their workloads. The Atomic line also has variants aimed at small and medium businesses, who make up a large portion of the 7,000-strong customer base that Fusion-io has for its products.The hyperscale companies are using flash to speed up database accesses (usually the open source MySQL database), thereby allowing the same level of queries to be supported on fewer server nodes. This is something EnterpriseTech is calling scale-in, as opposed to scale-up (making a beefier server with more processors and main memory) or scale-out (adding more nodes to boost the performance of a workload that can be spread across multiple machines).The hyperscale customers are a big target for any flash vendors. Fusion-io estimates that capital expenses at Google, Facebook, Apple, Yahoo, Amazon, eBay, Microsoft, and others that make up this segment of the IT market growing their spending at a staggering 45 percent rate between 2012 and 2013, hitting an estimated $20 billion. The way Fusion-io has characterized the opportunity for application acceleration based on flash and other nonvolatile memory technologies is thus: In 2017, sales of NVM devices to the more than 200 hyperscale operators in the world would represent $5 billion in total addressable market; the 4,000 or so large enterprises would represent an $11 billion opportunity, with small and medium businesses (more than 100,000 businesses worldwide) representing another $10 billion.The Atomic flash cards come in two flavors. The Atomic SX300 cards have a little bit lower I/O operations per second and slightly higher capacity and are aimed at read-intensive workloads. There are four different models of the SX300 cards, which vary in capacity and endurance and sometimes IOPS, depending on the model, as you can see:The SX300 has a three-year warranty.The PX600 cards are aimed at customers who need the highest IOPs and are willing to sacrifice a little capacity to get there. These deliver the highest transaction rates per gigabyte and are optimized for mixed workloads (meaning both reads and writes). The PX600 cards also have a higher endurance.The PX600 has a five-year warranty.In both flavors, the maximum capacity of the flash card is 6.4 TB, which is twice that of the prior ioScale generation of devices from Fusion-io. All eight of the new cards plug into a PCI-Express 2.0 x8 slot, which means they are compatible with a wide variety of servers announced in the past several years. The prior ioScale drive plugged into a PCI-Express 2.0 x4 slot, which had half the bandwidth.Fusion-io is pushing its products increasingly through channel partners and does not, therefore, provide prices. EnterpriseTech has reached out to ask the company if the cost per unit of capacity has come down compared to the ioScale and ioDrive II units that these two new family of devices replace, but as of press time we have not yet received an answer.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-06-05 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Atomic",
        "Flash",
        "Fusion-io",
        "hyperscale"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/atomic/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/fusion-io/",
        "https://www.enterpriseai.news/tag/hyperscale/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/fusion-io-flash-logo-370x235.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/fusion-io-market.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/fusion-io-sx300-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/fusion-io-px600-table.jpg"
    ]
}