{
    "title": "Dell Drops Price on All-Flash Storage Arrays",
    "text": "Dell Inc.'s storage unit rolled out a pair of all-flash storage array configurations this week priced as low $25,000 in a bid to overcome cost barriers that have hampered broad adoption of enterprise flash storage arrays.Dell said Tuesday (January 13) it is offering an entry-level all-flash storage array that includes six 480 GB read-intensive solid-state drives (or 2.8 TB of raw storage capacity) for an \"advertised street price\" of $25,000. Bob Fine, director of product marketing at Dell Storage, said in an interview that price point represents as much as a 50 percent reduction in the cost of enterprise flash arrays as the storage leader targets mid-sized enterprises.The second, multi-tier all-flash configuration comes with an additional six 200 GB write-intensive SSDs that increases raw storage capacity to 4 TB. The multi-tier version is priced at $35,000. Both single- and multi-tier versions are shipping immediately, Dell said.Dell is betting that what Fine described as a \"scaled-down footprint and an entry-level configuration\" will help break through the price/gigabyte barrier that has limited flash storage deployments to larger enterprises.In a series of sequential releases over the last year, Dell has sought to make \"flash practical for almost any workload,\" Alan Atkinson, general manager of Dell Storage, added in a statement.The tiered flash storage offerings are based on Dell's SC4020 array (\"SC\" stands for \"Storage Center\") that was rolled out last year in a series of releases that culminated in a \"more dense footprint\" requiring less rack space, Fine explained. The SC2040 array includes 24 drive bays and dual controllers along with standard software that includes data progression software that allows the array to optimize drives for performance and cost, Dell Storage said.Observers have noted that tiered storage has taken on added significance recently with the emergence of SSDs in enterprise storage. Despite growing popularity, storage tiering has also been confused with caching, which plays a significant role with SSDs as well, they argue.Meanwhile, Dell Storage claims to be the only storage vendor combining read- and write-intensive SSD technologies in a single array that, it says, allows customers to configure the array for a particular application.Dell's $25,000 price point could make 2015 the year that enterprise flash adoption gains traction, especially among mid-size and smaller companies. Fine predicted the price per gigabyte of storage would continue to decline. At the same time, new storage technologies beyond flash are expected to emerge this year that will also drive down storage costs.Hence, Dell is stressing that its architecture is sufficiently flexible to \"future-proof\" enterprises' storage infrastructure. For example, Dell noted its all-flash array could be expanded to include more read- or write-intensive drives while shifting \"cold data\" to an optional tier of spinning disks. In this scheme, incoming writes could be handled by the fastest SSD tier, Dell said.",
    "date": "2015-01-13 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-13-at-11.43.01-AM-370x290.png"
    ]
}