{
    "title": "Flash Startup to Support VMware Storage Push",
    "author": "no author",
    "date": "2015-02-04 00:00:00",
    "text": "In the wake of VMware's launch this week of a new generation of enterprise products aimed at promoting adoption of software-defined storage, third-party storage vendors are lining up to support the VMware vSphere components.Flash array startup NexGen Storage Inc. announced storage support on Tuesday (February 3) for VMware vSphere Virtual Volumes based on its hybrid flash arrays unveiled last month.NexGen, Louisville, Colo., said its N5 line of hybrid flash arrays would support vSphere Virtual Volumes, a storage solution designed to enable native virtual machine awareness across a range of third-party storage systems. VMware launched Virtual Volumes earlier this week along with the latest version of its software-defined storage offering, Virtual SAN 6.In launching the products, VMware said Virtual SAN 6 would be based on an all-flash architecture in which flash storage devices are used for caching and \"data persistence.\" Virtual Volumes is being positioned as VMware's attempt to set an industry standard for software-defined storage that enables storage arrays to be virtual machine-aware.As a member of VMware's Virtual Volumes Developers Program, NexGen said it would leverage its ioControl quality of service policies and service levels in VMware vCenter. That capability is designed to give administrators greater control of storage levels for individual virtual machines.The partners said their goal is extending application-centric, policy-driven automation to external storage architectures using vSphere Virtual Volumes.NexGen said its hybrid flash array support for Virtual Volumes includes consolidation of storage silos via multiple storage tiers on a single flash array. Support also includes the ability to map a single virtual machine or a group of VMs to NexGen's storage QoS policies along with data management services based on hybrid flash arrays provisioned on a \"per VM basis.\"NexGen said support for vSphere Virtual Volumes on its N5 hybrid flash arrays would be available in the second quarter of 2015.Meanwhile, VMware said this week its software-defined storage strategy leverages the hypervisor to advance cloud storage while seeking to harness the operational efficiency that server virtualization brings to computing.The software-defined storage strategy also seeks to reduce operating costs through what VMware calls a \"hypervisor-converged storage tier\" along with integration of virtual machines with third-party storage arrays from partners such as NexGen.The flash startup, spun out last month from SanDisk Corp., said improvements in performance, density and flash capacity could yield as much as a four-fold reduction in storage costs as measured in dollars per virtual machine when compared to hybrid approaches.NexGen further claims that claims its “Prioritized Active Cache” software that targets caching algorithms can help justify the investment in flash storage arrays by improving utilization by as much as 150 percent.For its part, VMware said the all-flash storage architecture of its Virtual SAN 6 would deliver a four-fold increase in I/O performance per node compared to the previous generation.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/Screen-Shot-2015-02-03-at-8.12.41-PM-370x290.png"
    ]
}