{
    "title": "Memory Demand Propels Booming Chip Market",
    "author": "George Leopold",
    "date": "2018-03-29 00:00:00",
    "text": "Chip makers have been scrambling to find new applications for their wares, focusing on the Internet of Things, big data and emerging machine learning applications requiring more processing power. For now, it looks like they are succeeding.Driven by insatiable demand for memory chips, the global semiconductor industry had its biggest year in more than a decade. Annual revenue in 2017 jumped 21.7 percent over the previous year, according to figures released this week by IHS Markit.The market tracker credited a surge in memory demand for the banner year, which also propelled South Korea’s Samsung Electronics (KRX: 005930) to the top of its chip rankings. Intel Corp. (NASDAQ: INTC) had held the top stop for the past quarter century. Samsung’s revenues jumped 53.6 percent year-on-year on the strength of robust demand for memory chips.IHS said DRAM sales soared 76.7 percent last year while NAND sales jumped 46.6 percent. Increased demand for server DRAM as new x86 platforms were rolled out added to tight supplies throughout the second half of last year. Hence, the market watcher noted that revenue jumps reflect higher prices as demand accelerated.Nevertheless, the growth rate for DRAM and NAND was the highest in a decade, the market tracker reported.The surge in memory demand also rearranged chip rankings, with memory specialists SK Hynix (KRX: 000660) and Micron Technology (NASDAQ: MU) moving up several spots to Nos. 3 and 4, respectively. Both registered annual growth rates of around 80 percent.The fabless business model in which semiconductor vendors ship designs to huge foundries for production continues to expand as demand grows for graphics and other agile processors. Mobile phone chip vendor Qualcomm (NASDAQ: QCOM0, which was being pursued by Broadcom (NASDAQ: AVGO) until the Trump administration blocked the acquisition, remains the top fabless chip marker.Cracking the top ten for the first time was graphics specialist Nvidia (NASDAQ: NVDA), recording a 42.3 percent jump in annual revenue. The GPU leader has been rolling a steady stream of high-end graphics processors for applications ranging from autonomous vehicles to HPC.The chip industry’s transition away from personal to embedded computing and the growing demand for in-memory processing of huge data sets also has fueled chip integration efforts as manufacturers look to pack more functionality onto each device. Those requirements fueled last year’s transition to 3-D NAND technologies such as Intel’s Xpoint non-volatile memory chips aimed at datacenters.“The technology transition from planar 2-D NAND to 3-D NAND drove the market into an unbalanced supply-demand environment in 2017, driving prices higher throughout the year,” said IHS memory analyst Craig SticeStice reckons the transition to 3-D NAND flash is nearly complete, providing “supply relief for the strong demand coming from the [solid-state drive] and mobile markets.” That should translate into steep price declines even as demand remains strong. Either way, IHS predicts 2018 could be another record year for NAND revenues.While unusually strong demand for memory devices skewed last year’s results, the chip sector’s resurgence appears to be built on a strong foundation. Excluding memory sales, IHS reported the remainder of the semiconductor industry grew at a healthy 9.9 percent clip in 2017. For example, big data processing applications expanded by 33.4 percent, benefitting Intel and other server vendors.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/07/Screen-Shot-2015-07-28-at-1.49.46-PM-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/Screen-Shot-2018-03-29-at-11.29.09-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}