{
    "title": "Software Defined Storage: Changing Data from ‘State-ful’ to Stateless",
    "author": "Doug Black",
    "date": "2017-03-04 00:00:00",
    "text": "Hedvig, the Santa Clara software defined storage (SDS) start-up now in its third year, has announced the infusion of a cool $21.5 million in Series C venture funding as attention increasingly turns to the fragmented SDS market, predicted to surpass $7 billion by 2020. The new funding round was raised from existing company investors Atlantic Bridge Ventures, including its Oman Technology Fund, and True Ventures, as well as new capital from Hewlett Packard Pathfinder (part of HPE) and Singapore-based EDBI.This brings total VC investment to $52 million in Hedvig, whose principal products are its Distributed Storage Platform and the recently-announced Universal Data Plane (see below).“As cloud adoption gains traction in Asia, companies seek new storage solutions that could offer cloud-like agility, scalability and cost-efficiency to better manage their voluminous data,” said Swee Yeok Chu, CEO and President of EDBI. “Hedvig’s next-generation SDS platform allows enterprises to leverage multiple cloud storage options to perform computing tasks of varying complexity, hence providing the flexibility to meet their increasingly sophisticated data needs. Singapore’s leading data hub position will be an ideal base for Hedvig to target the Asian market with EDBI’s support.”The buzz about SDS is matched by misconceptions of what, in fact, it actually is. Initially, SDS was – and still is – commonly thought of as a kind of GUI storage control panel. But current evolution of SDS is more thoroughgoing, an actual, “authoritative” hyperscale storage platform and data store, a replacement for whatever storage an organization may be using: not just the control plane but the actual data plane. The objective is to enable building of a cloud – on-prem, hybrid or public – and to allow the free movement of data wherever it is wanted. Hedvig consolidates block, file, and object into a single, API-driven, scalable platform. Its Universal Data Plane forms a distributed, scale-out cluster that utilizes commodity servers or cloud computing as a foundation for bare metal, hypervisor and container infrastructure, a single, programmable data management layer across workloads, clouds, and tiers.\"There's going to be a need for mobility in and out of different clouds, both on premises and between clouds,\" said Jeff Kato, a senior storage analyst at Taneja Group Inc., Hopkinton, Mass. \"That's really what [Hedvig's] Universal Data Plane architecture is supposed to provide. The idea is, unless you have that it's going to be much harder to move a workload around from cloud to cloud.\"“SDS is a category,” Rob Whiteley, Hedvig’s VP of Marketing, told EnterpriseTech, “but at the end of the day companies are trying to create an abstraction layer so they can move their applications around at will. If you think about why you can’t do that today, even if you invest in VMs and containers and all this packaging of the application, moving data is extreme difficult. Compute is basically stateless, data is by default ‘state-ful.’ The problem we’re trying to solve is to create this concept of a Universal Data Plane, so we guarantee the data will be where it needs to be so the application can run, and we don’t care if it’s in a private cloud, a public cloud, we’re just trying to unlock the ability to make applications more portable.”A prominent, initial Hedvig customer is Bank BNP Paribas CIB, Paris.\"We have been working with Hedvig for nearly two years after conducting a lengthy evaluation of software-defined storage solutions,” said Emmanuel Salzard, Director of the Infrastructure Version 2 (IV2) Digital Platform at BNP Paribas. “We like Hedvig because it was the only product that provided the enterprise and multi-site availability features we needed. The Hedvig Distributed Storage Platform now underpins our entire software-defined datacenter initiative and we have it deployed in development across four data centers in Europe to help with rapid prototyping in our digital platform.”Whiteley said the BNP Paribas implementation is the most common use case for Hedvig: “I’m building a private cloud, I need an internal AWS-like environment, but I need it to be in my own data center because I’m a large company, I’m heavily regulated, so I either can’t or won’t go to the public cloud – at least not yet – but I’d still like to offer an experience to my developers and to my DevOps teams that is still as easy to use as it would be if they swiped their credit card and went to AWS.”He said BNP Paribas’s IV2 is an all-SDS data center (two locations in Paris, two in London), and Hedvig provides “the storage layer of that software defined data center stack that they’re building. Really, what they wanted was an environment for rapid prototyping of new banking services. They’re investing in digital and digital business, and they needed to create an on-prem developer cloud where developers carve up as many resources as they need, start producing an application and easily push that application out to start solving the time-to-market pressures companies are facing these days.”Another common Hedvig use case is enabling companies to off-load portions of their compute workloads running on public cloud platforms, such as AWS, Azure or Google, to lower public cloud expenses. Whiteley cited an unnamed customer that created its entire web site in AWS and, having achieved initial cost efficiencies, later found itself – after enjoying rapid growth – paying hundreds of thousands of dollars per month to run its site on AWS at scale.The company decided to leave a portion of the site on AWS while moving the back end, the middleware tiers, inside its private data center. “But how do I replicate and keep data synchronized between the two?,” Whiteley asked. “You run our software in AWS and you run it on-premises in your private data center, and now you can move data effortlessly between the private and public cloud. Our software can do that intelligently for you.”Hedvig has done extensive integration of its software into many different flavors of compute: Docker, OpenStack, HyperV, VMware, according to Whitely. “We’re completely agnostic, we don’t care what the compute layer is, all the integration and APIs are completely seamless,” he said. “You can manage Hedvig natively from those other platforms, so you never have to log into our user interface if you don’t want to. If you look across the storage ecosystem, most companies will bet on one or two of those (compute platforms), but what sets us apart is creating so many interfaces.”He also said Hedvig software can be run in multiple physical locations acting as one logical pool of capacity. “Think of it as natively hybrid,” Whiteley said. “We have a customer that runs it in a data center in Denver, a data center in San Francisco and partly in AWS. To us, a site is a site is a site, but we’ll make sure that it logically looks like one pool of capacity for your applications.”“All sectors of enterprise IT are being hit by new demands from the massive wave of emerging digital businesses,” said Avinash Lakshman, founder and CEO of Hedvig and inventor of the Cassandra database. “It’s a…signal that a flexible, simple software-defined storage solution is needed for primary and secondary storage in the era of cloud.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/03/shutterstock_world_data-370x228.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/03/hedvig_logo_260x77.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/03/bnp-paribas-logo-300x97.png"
    ]
}