{
    "title": "Virtualization Spurs SAN Adoption",
    "author": "Alison Diana",
    "date": "2015-06-19 00:00:00",
    "text": "The explosion of digital data beyond traditional realms such as healthcare and entertainment is fueling demand for storage area networks (SANs) across a growing spectrum of vertical markets.Just as healthcare uses SANs to manage its troves of medical images and the entertainment business needs SANs for its vast libraries of video and pictures, horizontal applications and a slew of verticals need affordable, scalable storage to cope with social media, images, video, and data acquired for analytics or big data. Expense-cutting measures like virtualization also spur SAN investment.\"Rising adoption of cost reduction techniques such as server virtualization is likely to boost storage networking market in the near future,\" wrote Persistence Market Research. \"Effective working of virtualized environments depends on factors such as, efficiency, scalability, speed of the storage technology and reliability. With such integrated benefits in storage area network, this technology is poised to reap the highest benefits.\"That was the case in the City of Napoleon, Ohio, which implemented StorTrends SAN as part of its Windows and Linux environment, Dan Wachtman, MIS administrator, told Enterprise Technology. The IT department, which consists of one and three-quarter employees including Wachtman, supports 19 departments for the city government.Initially, the City of Napoleon outsourced many large IT jobs but that was becoming too expensive and inefficient, Wachtman said. In addition, the organization used network attached storage (NAS) but lacked replication and no real disaster recovery setup, he said. Reviewing the situation, Wachtman determined he needed to move some tasks back into IT and find a more cost-effective and adaptable storage solution, he said. After reviewing his options, Wachtman selected StorTrends SAN and StorAID, the vendor's technical support plan.\"I explained what my budget was and our first unit was a demo unit they had, so I saved some money on the initial unit. The following year I bought a second DR unit. When they priced me their product, it was a pretty easy sell because of the amount of storage I was getting for the money,\" he said. \"And then the pricing of their support, their maintenance plan and so forth, was economical.\"The StorTrends SAN supports the city's virtual machines and allows it to do replication at the block level, said Wachtman, providing the organization with new capabilities at a better price. Benefits include reduced latency, simplified file sharing, increased flexibility, easier storage deployment, and reduced overall storage costs, he said.\"Adding SAN to the City of Napoleon's IT environment has completely transformed how business is done interdepartmentally,\" said Wachtman. \"I would often lose sleep at night worrying about the data within the City of Napoleon's IT environment. But now, I sleep comfortably knowing our data is fully protected thanks to the StorTrends SANs with their enterprise class snapshots and replication for disaster recovery.\"For its part, luxury beauty brand Molton Brown of London also relies on SAN to support its virtualized environment. Working with solution provider Richardson Eyres, the company selected an HP LeftHand SAN. It met Molton Brown's budget, has a distributed clustered architecture for enhanced data availability, and supported VMware's VMotion, said Navtej Bains, senior systems administrator, Molton Brown, in a statement.Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Henry_County_Sheriffs_Residence_and_Jail-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}