{
    "title": "HPE Eyes Storage Gains as Server Sales Slide",
    "text": "Slowing demand for servers and related networking hardware cut deeply into Hewlett-Packard Enterprise's quarterly revenues, the company reported this week.The 13 percent decline in revenues for the second quarter ending April 30 was the steepest for the company's enterprise group since its launch in November 2015. Overall, HPE's quarterly revenue totaled $9.9 billion.HPE (NYSE: HPE) and other hardware vendors have seen server sales slow as more datacenter customers obtain server space from cloud vendors rather than purchasing their own. Indeed, market watcher Gartner Inc. (NYSE: IT) reported late last year that Cisco Systems (NASDAQ: CSCO) was the only leading server vendor to report a quarterly sales gain.While HPE remains the top server vendor with more than a quarter of the global market, Gartner reported in March that its quarterly revenues declined 11 percent in the last quarter of 2016. HPE CEO Meg Whitman acknowledged during a call with financial analysts that the company is rethinking its server strategy since \"this is low calorie business.\"Added Whitman: \"We're not in the [server] business for [market] share. We're in it to get a return on our investment dollars and right now that doesn't look like a particularly productive segment for us.\"Server vendors also are suffering a double whammy: a strong dollar and the steady enterprise shift to hybrid clouds. \"Enterprises are moving away from buying servers from the traditional vendors and instead renting server power in the cloud from companies such as Amazon (NASDAQ: AMZN), Google (NASDAQ: GOOGL) and Microsoft (NASDAQ: MSFT),\" Gartner noted.Those market realities were reflected in HPE's quarterly financial results released on Wednesday (May 31). Server revenues declined 14 percent while networking revenue plummeted 30 percent.The storage sector appears to have more upside for HPE and other vendors as the shift to all-flash arrays accelerates. Whitman argued the company is better positioned to take advantage based on its recent acquisitions of predictive flash storage specialist Nimble Storage and hyper-converged infrastructure specialist Simplivity Corp. The latter acquisition would help HPE expand its hybrid IT offerings.Nevertheless, HPE reported a 13 percent quarterly decline in storage revenues, citing \"continued challenging markets and tight [solid-state drive] supplies.\" Those losses were offset somewhat by a 33-percent year-on-year gain in all-flash array growth. The company noted that all-flash arrays have yet to make significant headway in datacenters, forecasting that the Nimble acquisition positions it to equip all-flash datacenters.\"We're just about now ramping Nimble into our datacenter storage business,\" Whitman added. \"What's interesting about Nimble is there are some markets where Nimble actually had quite a good position. There are some markets where Nimble is not at all.\"So, we're actually building from scratch in a number of those markets,\" she continued.  George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-06-01 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Networks",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Networks",
        "Slider: Storage",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "cloud",
        "financial results",
        "HPE",
        "networking",
        "servers",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/financial-results/",
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/networking-2/",
        "https://www.enterpriseai.news/tag/servers/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/HPE_building-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}