{
    "title": "Pivot3 Expands Security, Virtualization Partnerships",
    "text": "Pivot3, the hyper-converged infrastructure specialist, and a trio of partners are joining forces to add workload encryption and other capabilities to its software-defined platform for datacenters.The startup based in Austin, Texas, said this week it is collaborating with security specialist HyTrust Inc. to add modular \"workload-centric\" encryption to its Acuity hyper-converged platform. The partners said the combination of Pivot3's policy-based quality of service (QoS) engine and HyTrust's workload encryption platform would address looming regulatory compliance issues while affording greater control of workload performance and security for enterprise applications.The collaboration also aims to secure virtual desktops used to access sensitive data.The partnership underscores growing security concerns as more data is stored in the cloud. According to a survey released last year by HyTrust, more companies are moving sensitive data to multi-cloud environments but less than half are encrypting their data or other workloads.The partnership with HyTrust would provide \"multi-tenant infrastructure that delivers the performance, automation, scale and efficiency required of cloud and virtualized datacenters,\" Pivot3 noted in a statement announcing the partnerships.“IT organizations face a daunting challenge of simplifying management while at the same [time] ensuring adherence to compliance mandates,” added John Skinner, senior vice president of business development at HyTrust, Mountain View, Calif.Pivot3 touts its hyper-converged platform as among the few that offers an NVM Express data path along with a dynamic QoS engine designed to consolidate multiple workloads onto common infrastructure.Pivot3 also on Tuesday (Aug. 29) announced partnerships with backup storage and disaster recovery vendor Veeam Software along with desktop virtualization specialist Liquidware Inc. The collaboration with Veeam focuses on delivering disaster recovery services, targeting users that lack a backup datacenter.The partners said they would combine the Acuity platform with the image-based virtual machine replication of Veeam's cloud-based disaster recovery service.Based in Baar, Switzerland, the privately held IT vendor company develops backup, disaster recovery and virtualization management software for VMware and Hyper-V virtual environments.The partnership with Liquidware, a virtual desktop provider based in Atlanta would mesh the density of Pivot3 hyper-converged platform capable of supporting several times more virtual machines per node with assessment, design, monitoring and diagnostics capabilities based on Liquidware's VDI platform.Pivot3 has been steadily expanding its hyper-converged infrastructure offerings since acquiring privately held flash array startup NextGen Storage early last year. Along with all-flash and hybrid storage, the deal gave Pivot3 a \"dynamic QoS\" feature as a means of provisioning and scaling IT resources.The capability means IT departments can leverage \"just-in-time dynamic provisioning of resources and scale,\" the company said at the time of the NextGen Storage acquisition.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-08-29 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "datacenters",
        "desktop virtualization",
        "Security",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/desktop-virtualization/",
        "https://www.enterpriseai.news/tag/security/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/Screen-Shot-2017-04-12-at-11.16.50-AM-370x276.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}