{
    "title": "BitMicro Advances into Enterprise with New Flash SSDs, Logo",
    "text": "Believing flash storage is expanding to deliver specialized solutions for business applications, BitMicro this week unveiled a new strategy, logo, and family of products targeting companies that need high capacity flash storage devices.By next year, sales of enterprise flash storage are expected to reach $1.6 billion, according to Mordor Intelligence. The surge in data, drop in flash pricing, and IOPS growth account for compound annual growth rate of almost 60 percent between 2013 and 2016, the research firm said. And that's why so many new flash storage products have hit the market over the past few months.Unlike its competitors, BitMicro is not targeting general-business users, said Zophar Sante, vice president, worldwide marketing and sales at the 20-year-old company that has traditionally used a device-oriented focus for sales into the military, defense, and government organizations. Rather, its new enterprise division focuses on developing solutions for companies with large volumes of application workloads.To do this, BitMicro internally developed the Talino ASIC architecture for its new family of solid-state drives. Unveiled today, the new MAXio Z-Series PCIe SSDs include two ASIC flash controllers and support up to 8.8 terabytes in a PCIe edge card form factor. The Z-Series supports these larger storage capacities by offloading the Flash Translation Layer (FTL) from the host server to the SSD, according to BitMicro. The SSDs include BitMicro's DriveLight Management Software for administration.\"We developed the ASIC controller internally because we wanted a very unique architecture,\" Sante said. \"When we looked at the SSD industry we understood eventually it's going to replace hard drives. We thought, well if that's the case we need to develop chip architecture to support those kinds of use cases. We need to have very high capacity storage products. [Talino] allows us to build very high capacity SSDs.\"Before year's end, BitMicro plans to double capacity – growing to 17.6 TB from 8.8 TB – in its MAXio line, he said. Today, the MAXio SSD operates at less than 6 watts per 1 TB; uses one PCIe slot for 8.8 TB, and requires no special cooling or on-board fan, according to the vendor. The E-Series uses 30 watts and has 3.3 TB capacity; the Z-Series uses 50 watts, BitMicro said. The Z-Series is available now at pricing starting at about $2 per GB.These systems remove the need for centralized management, added Sante. They are best-suited for applications such as video on demand; database acceleration; online analytics, and file servers, the company noted.\"If you have a card that's 8.8 terabytes and you slap that card into each one of those servers, why do you need centralized storage? Why not use the storage that's already on board?\" he asked. \"A lot of the storage systems – the servers – have dedupe, have snapshot already on board to protect their internal storage. At the end of the day, do you really want SAN connected storage or why don't you use the storage you have inside the server and manage that with dedupe, decompression, and all the stuff you've already got. I wouldn't call it a paradigm shift but it's a thought process shift.\"No PCIe, No ProblemTo address the need of those who don't want to use PCIe, BitMicro unveiled the MAXio All Flash Storage N186 in a standard 1U rackmount and the MAXio N3P4 in a 3U rackmount. Designed for database, high performance computing, virtual desktop infrastructure, and media production, these devices include DriveLight Management Software. This web-based application lets users manage storage and drive health, BitMicro said.\"If you're the type of customer that doesn't want to use PCie, we want to make sure you have an alternative,\" said Sante. \"It's a big solid safe brick with 11.5 terabytes of capacity.\"The N3P4 includes up to eight MAXio SSDs and delivers more than 1 million sustained IOPS, the vendor said. It includes more than 26 TB of RAW PCIe solid state speed; almost 157 TB of useable capacity after provisioning, RAID, global spare, and deduplication, assuming 10x data reduction and E-Series, and provides more than 70 TB of RAW PCIe solid state speed and 420 TB of usable capacity after provisioning, RAID, global spare, and deduplication, assuming 10x data reduction in the Z-Series, BitMicro said.The N1A6 1U is shipping now for $5,500 per TB, depending on capacity. The N3P4 3U is slated to ship late in the third quarter of this for about $1,250 per TB depending on deduplication levels achieved.  Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-08-11 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "BitMicro",
        "flash storage",
        "high performance computing",
        "MAXio",
        "SSDs",
        "Zophar Sante"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/bitmicro/",
        "https://www.enterpriseai.news/tag/flash-storage/",
        "https://www.enterpriseai.news/tag/high-performance-computing/",
        "https://www.enterpriseai.news/tag/maxio/",
        "https://www.enterpriseai.news/tag/ssds/",
        "https://www.enterpriseai.news/tag/zophar-sante/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/BitMicro.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Maxio-E-Series4-300x116.png",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}