{
    "title": "Price Erosion, Weak Demand Rattle Storage Market",
    "author": "George Leopold",
    "date": "2014-09-30 00:00:00",
    "text": "Weak demand continues to slow the global external disk storage market as storage prices continue a steady decline despite the inexorable rise of big data.The upshot is stiffening competition among storage industry leaders, according to recent quarterly storage tracker report from market watcher IDC. As quarterly revenues fell by 1.4 percent year-on-year, storage market leader EMC experienced a steep decline in revenues compared to the previous year.IDC pegged total disk array storage capacity shipped during the second quarter at 11.5 exabytes. That generated global revenues (internal plus external storage) totaling nearly $7.8 billion. That works out to overall storage cost of about $1.47 per gigabyte.If enough qualifiers are added, any vendor can claim to be the market leader in at least one storage category. For example, Dell parsed the IDC storage tracker data in such a way that it came out on top in terms of total internal and external storage capacity shipped during the first half of 2014: more than 4.3 petabytes. IDC pegged Dell's quarterly disk storage revenues at $887 million, well behind market leader EMC at $1.76 billion, which pushed just under 4.1 petabytes.\"This is an increasingly important designation as we continue to see the lines blur between servers and storage due to the emergence of converged infrastructure and software defined storage,\" Alan Atkinson, vice president and general manager of Dell Storage, noted in a blog post.As flash technology enters the mainstream via hybrid hard disk-flash storage arrays along with all-flash arrays, Dell also claims to be well positioned. Without providing specifics, Atkinson said Dell was offering better \"price for performance\" through its hybrid SSD/HDD and all-flash Fibre Channel arrays.While storage leaders like EMC place flash drive technology well below mainstream storage approaches such as server virtualization and cloud computing, its most recent customer survey hinted that storage vendors are beginning to leverage flash technology as performance increases and cost declines.Storage costs have of course seen a steady logarithmic decline over the last several decades. A standard measure is hard drive cost per gigabyte.According to one analysis, the current cost per gigabyte is $0.03, or less than half the cost just five years ago when the storage industry experienced some of its steepest price declines--$0.18 to $0.07, according to one estimate.In the hard drive market, \"space per unit cost has doubled every 14 months,\" reckons Matthew Komorowski, a software engineer who tracks the storage market. Given the emergence of terabyte drives that have broken the $0.10/gigabyte barrier, the $0.01/gigabyte milestone is fast approaching, Komorowski predicts.Meanwhile, IDC said sales of high-end storage systems continued a steady decline during the second quarter of 2014, the fourth consecutive quarterly drop. The market watcher warned that weak demand might be spreading to the middle range of the global storage market.While solid-state dominates much of the discussion around storage technologies, some observers think the spinning disk also will be squeezed from below by--of all things--tape. The reason, according to the open source tech consultant Wikibon, is that applications like long-term data retention of large data objects could foster a comeback for tape as a backup storage medium. \"Tape is relevant in this age of Big Data\" and \"certain tape markets may actually show growth again,\" Wikibon predicts.It refers to a possible flash-tape mash up as \"flape.\"Separately, enterprise storage vendor HGST released a survey this week that predicts public cloud storage will quadruple over the next year. Thirty percent of survey respondents told HGST they plan to store more than 50 percent of their data in the cloud.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2012/08/Harddisk-head.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/idc-disk-data.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/mkomo-disk-price.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}