{
    "title": "SanDisk Boosts Speeds, Capacities On SAS Flash Drives",
    "text": "Flash storage maker SanDisk is keeping the pressure on the competition on a number of different fronts and is positioning itself to be a key supplier of various kinds of flash storage for enterprises. SanDisk has partnered with Toshiba on a flash foundry that is moving to 15 nanometer technologies, is at the moment the only supplier of UlltraDIMM meory channel storage in partnership with Diablo Technologies, and is ramping up the capacity and performance of its Optimus and Lightning families of solid state disks.Most of the flash device suppliers on the market are using flash memory that is based on less dense circuitry, in the 20s of nanometers generally speaking. Toshiba and SanDisk opened Fab 5 in Yokkaichi, Mie Prefecture in Japan back in July 2011, starting with etching of flash on 300 millimeter wafers with 24 nanometer processes to make NAND flash, and has subsequently moved to 19 nanometer production. The 15 nanometer process, called 1Z nanometer by the Flash Forward partnership, will be used to make memory chips with two bits per cell as well as three bits per cell; production will ramp in the second half of this year for 128 gigabit chips and they will be employed in everything from removable cards for consumer devices to enterprise SSDs.In the meantime, SanDisk is going to be deploying its 19 nanometer enterprise multi-level cell (eMLC) flash chips in fatter Optimus SSDs and boosting the bus speeds on less capacious but zippier Lightning SSDs. Both are based on SAS interfaces and plug right into servers and storage arrays.Last month, SanDisk refreshed its SATA-based CloudSpeed SSDs, which come in a 2.5-inch form factor with different levels of duty cycle, performance, capacity, and cost. The Eco and Ascend models can do one disk write per day (DWPD) across the flash drive with a five year lifespan without losing effective capacity, so there is no need to worry about wear leveling at this point. The CloudSpeed Ultra has higher endurance, at 3 DWPD, and have higher write I/O operations per second, while the Extreme variants give back some read performance in exchange for an even higher duty cycle on the cells in the flash. Here are the feeds and speeds for the CloudSpeeds:Brian Cox, senior director of marketing at SanDisk, says that even while SanDisk is excited by the prospects for UlltraDIMM storage, which marries flash to a main memory format and allows it to plug into the server memory slots and run considerably faster than PCI-Express or controller-based flash memory, there are still plenty of companies that use SAS and SATA controllers and they want flash drives to plug into existing and future systems through these interfaces. That said, SanDisk is positioning for the future, and its relationship with Diablo to create memory channel storage (which looks like SAS or SATA storage to the operating system at this point but which will look more like main memory in future releases) is one example of looking beyond flash as a replacement for spinning rust.The most recent announcements from SanDisk have a little something for everyone. The Optimus Max drive weighs in at 4 TB of capacity in a 2.5-inch enclosure, which is as hefty as the el cheapo fat SATA drives in a 3.5-inch form factor commonly used by hyperscale datacenter operators and those building Hadoop clusters in the enterprise.The Optimus Max drive sports a SAS interface running at 6 Gb/sec, which is considerably more peppy than the 3 Gb/sec of the SATA-II interface. Basically, you get the bulk capacity of a SATA drive, the speed of the SAS interface, and the IOPs of flash all rolled into one. Cox says that the cost per GB that its IT vendor partners will pay for the Optimus Max drives is on the same order of magnitude as a SATA SSD; obviously the flash drive will have on the order of many tens of thousands of IOPS compared to the several hundred of a 4 TB SATA disk drive. The Optimus Max is aimed at read-intensive workloads and comes with a five year warranty. Here is how it stacks up to the other members of the Optimus family:The Optimus Eco drives are aimed at mixed-use and read-intensive workloads, such as online transaction processing, email, and messaging. The Ascend variants are for mixed read and write workloads, while the Ultra drives are targeted at write-intensive jobs that need high endurance. The Extreme drives in the Optimus family were created for data analytics and financial transaction jobs that have very high writes compared to reads and that need the longest duty cycle on the flash.\"At this point, many customers are getting more of a performance boost from flash than they are getting from a CPU upgrade,\" says Cox. And it is no wonder that flash is becoming a more common storage media. Just like we have all-flash arrays, it won't be long before we have all-flash servers with various levels of flash in the system. \"Why are companies locking their system designs into a hard drive mentality,\" Cox asks rhetorically. \"It sort of makes us wonder, and we are here to liberate the datacenter with flash.\"Just like CPUs have hit a clock speed wall, thereby limiting their single-threaded performance, disk drives have hit a capacity and throughput wall. Disk drives have long since stopped getting faster, and now incremental increases in capacity are getting harder to come by.SanDisk says the spread between capacity and performance for both flash and disk drives is getting wider between flash and disk. Disks are increasing capacity by 30 percent or so in each generation on the SAS interface, but flash SSDs are doubling with each generation. Within a few years, a SAS flash-based SSD will have ten times the capacity of a disk drive on the same 2.5-inch form factor and thousands of times the IOPS, too.The more important thing is that the gap in cost per GB between disk and flash in server form factors will reach some sort of parity in the not-too-distant future. Here is how SanDisk sees it playing out:In the chart above, the term Storage SSD in the Gartner lingo means SAS-based SSDs, while Server SSD means SATA-based flash drives. Mission Critical HDD means disk drives with a SAS interface, and Business Critical HDD means disks with a SATA interface. (Of course, when you zoom into the pricing in 2017, there will still be a big difference in price--the parity is just relative to what it costs for various storage technologies today.)Some of the cost of flash can be taken out of the equation right now because SanDisk has partnered with Toshiba to make its own flash and can now put its own 19 nanometer flash chips inside of its Lightning Gen II SAS-based SSDs. These drives, which SanDisk got through its acquisition of Pliant in May 2011, had been based on Toshiba flash chips but are now being upgraded to use the latest 19 nanometer SLC and eMLC flash chips from the Flash Forward partnership. SanDisk is paying a lower price for flash than do other companies who do not own their own foundry (or part of it at least). The new Lightning Gen II drives also get 12 Gb/sec SAS interfaces, doubling their interface speeds. These faster SAS ports are just starting to come to server and storage arrays.As with the CloudSpeed and Optimus families, the Lightning drives have different duty cycles and are tuned for read, write, or mixed workloads.SanDisk is categorizing the Lightning drives along the same Eco, Ascend, and Ultra categories, which target read-intensive, mixed, and write-intensive workloads, respectively. The Ultra variants are based on SLC NAND flash while the Ascend and Eco flavors are based on eMLC NAND flash.The Optimus Max and Lightning Gen II SSDs will be available through SanDisk channel partners in the third quarter.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-05-03 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Flash",
        "SanDisk",
        "Toshiba"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/sandisk/",
        "https://www.enterpriseai.news/tag/toshiba/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/flash-disk-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/sandisk-cloudspeed-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/sandisk-optimus-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/sandisk-disk-versus-flash.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/sandisk-disk-versus-flash-costs.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/sandisk-lightning-table.jpg"
    ]
}