{
    "title": "Partners Combine Ceph Storage, Flash",
    "author": "George Leopold",
    "date": "2016-03-30 00:00:00",
    "text": "An open source option will be combined with flash storage as part of an alliance unveiled this week in a bid to make scale-out storage easier and cheaper.Red Hat Inc. (NYSE: RHT) and SanDisk Corp. (NASDAQ: SNDK) said Tuesday (March 29) their alliance would combine the Milpitas, Calif., flash specialist's InfiniFlash with Red Hat Ceph Storage. The combination is intended to boost data management efficiency while reducing operational costs for enterprise customers.The alliance also reflects a growing shift toward open source storage options as hyper-scalers seek to move beyond incremental improvements in storage performance.The partners said Ceph storage would be offered as a preferred option for the latest version of SanDisk's InfiniFlash platform. \"The combination of open, software-defined storage from Red Hat and flash storage from SanDisk enables companies to serve a broad set of workloads with more tightly integrated, high-performing storage that scales,\" the partners asserted in a statement.They also hope to address the growing OpenStack market that is embracing Ceph storage in the cloud.InfiniFlash combines all-flash array performance with the lower costs of hard disk drives as a way of addressing medium and large deployments. Targeting customers coping with explosive data growth, the partners added that the combined Ceph-InfiniFlash storage platform would offer petabyte-scale capacity along with higher density and performance as a way to reduce storage costs while improving data management.The alliance is intended to leverage the scaling and performance attributes of flash technology on an open-source storage platform as a way to disrupt that the partners called a \"proprietary storage market.\"The combination of flash and open source software—in this case Red Hat's distribution of Ceph storage—targets hyper-scale as well as OpenStack deployments, added Ravi Swaminathan, vice president and general manager of SanDisk's Systems and Software Solutions unit.Those options are needed as hyper-scalers look to combine various storage, compute and networking building blocks in what another open source proponent, Facebook, refers to as a \"full-stack approach\" to datacenter infrastructure.\"One area that is underserved… is in storage,\" Jay Parikh, Facebook's (NASDAQ: FB) vice president of engineering and infrastructure, told the Open Compute Project summit earlier this month. \"Disk drives are getting bigger, they are not getting more reliable, latency is not improving and IOPS are not fundamentally changing.\"Flash, Parikh, added, is \"getting slightly bigger but endurance of the flash devices is not improving that dramatically and latency is not going to change [beyond] an order of magnitude or two. So were are really kind of stuck with this paradigm where things are scaling out and getting bigger, but from a performance perspective we're not getting what we actually need.\"Hence, Facebook recently announced it was working with Intel Corp. on nonvolatile memory (NVM) technology and the chipmaker's 3D XPoint architecture. NVM \"gives us the ability to think with this 'tiered' mindset for our applications so we can…scale out things for performance or for capacity or for optimizing price,\" Facebook noted.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2012/06/Hyperscale.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}