{
    "title": "Intel Debuts Xeon SoC for Edge Applications, Addresses ‘Spectre’ and ‘Meltdown’ Fears",
    "text": "Intel has addressed the drive for increasingly powerful processing at the edge of systems and networks with the launch this week of the Xeon D-2100 SoC, designed to support workloads that require more compute, analytics and data protection closer to endpoint devices.The announcement follows last month’s revelations of “Spectre” and “Meltdown” security vulnerabilities that could force CPUs to disclose the contents of data stored in memory and which impact nearly all processor architectures developed over the last two decades. Intel said the D-2100 processors will be supported by system software updates to protect against Spectre and Meltdown. They also  include integrated QuickAssist Technology with up to 100 Gbps of built-in cryptography, decryption and encryption acceleration.The D-2100 processor extends the Intel Xeon Scalable platform, Intel said, from the data center to the network edge and web tier, where network operators and cloud service providers need greater performance and capacity without increasing power consumption. With a range of 4 to 18 “Skylake-server” generation Xeon processor cores, up-to 512 GB of addressable memory, the SoC has an integrated Platform Controller Hub, integrated high-speed I/O, up-to four integrated 10 Gigabit Intel Ethernet ports and a thermal design point of 60 watts to 110 watts.The new processors are designed to help communications service providers offer multi-access edge computing (MEC), which allows software applications to tap into local content and real-time information about local-access network conditions, reducing mobile core network of network congestion, supporting such use cases as 5G-connected cars, smart stadiums, and retail and medical applications.The new processors will also, according to the company, enable communications service providers to deliver higher-capacity workload-optimized networking services at lower power in virtual customer premise equipment, such as VPNs and encryption services.“To seize 5G and new cloud and network opportunities, service providers need to optimize their data center and edge infrastructures to meet the growing demands of bandwidth-hungry end users and their smart and connected devices,” said Sandra Rivera, senior vice president and general manager of the Network Platforms Group at Intel. “The Intel Xeon D-2100 processor allows service providers and enterprises to deliver the maximum amount of compute intelligence at the edge or web tier while expending the least power.”Intel said the new chip also is designed for power- and space-constrained use cases, including:\"As data-driven services are becoming more pervasive and complex,\" stated Jennifer Huffstetler, Intel VP/GM of data center product management, in a blog post, \"they require more compute and intelligence closer to consumer and commercial 'endpoint' devices that are both generating and acting on data at the 'edge' (e.g. smart phones, IoT sensors and autonomous cars). By expanding the capabilities of the data center outward to the network edge, solution providers can process more data closer to endpoint devices, reducing application latency and opening up a whole new world of potential services and experiences.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2018-02-09 00:00:00",
    "cats": [
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "edge computing",
        "Intel",
        "intel xeon"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/edge-computing/",
        "https://www.enterpriseai.news/tag/intel/",
        "https://www.enterpriseai.news/tag/intel-xeon/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Intel-Xeon-D-2100-0218-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/xeon-d-2100-edge-computing-chart.png.rendition.intel_.web_.1280.720.png"
    ]
}