{
    "title": "Seagate, Micron Target Enterprise With New SSD",
    "text": "A new solid-state drive targeted at enterprise and cloud users is the first storage platform resulting from an alliance announced earlier this year between Seagate Technology and memory specialist Micron Technology Inc.Along with storage density up to 4 TB in a 2.5-inch package and a dual-port serial-attached SCSI interface configurable up to 1,800 MB/s sequential reads, the partners stressed a range of endurance options.\"The key thing with SSDs is endurance,\" or the number of times data can be written to a disk, Kent Smith, Seagate's senior director for product marketing, noted in an interview. Smith said the partners saw a growing need for \"multiple endurance configurations\" that would cover both ends of the SSD market while offering a 12 Gb/s serial-attached SCSI SSD at the high end that optimizes dual-channel throughput.Smith also claimed the dual 12-Gb SSD delivers four times the performance of serial advanced technology attachment SSD approaches.The SSD endurance options target specific applications and workloads. A write-intensive option targets HPC, database and mixed workloads. Smith noted also said \"application deployments are getting optimized based on [both] endurance and performance.\"Along with 12 Gb/s channel performance, the storage capacity ranges from 200 GB to 4 TB. The storage platform targets applications like server virtualization, databases and software-defined storage platforms.Given the enterprise focus, Seagate also stressed that the new SSD comes with three security levels, including a \"self-encrypting drive\" feature with Trusted Computing Group compliance.Seagate said 1200.2 serial-attached SCSI SSD would ship in August to its channel partners. Micron Technology is also expected to offer its own version of the platform. Both versions will use the same firmware, Seagate's Smith said. Since the SSD will be sold through OEMs and system builders designing scalable storage platforms for enterprise applications, no pricing information was released.Smith stressed it was unusual to have multiple sources for the same storage products that will run on the same firmware.Seagate and Micron Technology announced plans to collaborate on an enterprise SSD in February as part of a multiyear agreement that gave Seagate access to Micron's NAND flash technology while the memory maker gained access to Seagate's serial-attached SCSI drive technology.The partners said the partnership \"established [a] framework for future collaboration on enterprise flash-based storage technologies.\" Added Darren Thomas, Micron's vice president of storage, in a statement: \"The first example of this relationship is the introduction of a data-intensive SAS solution, expanding our SSD portfolio to meet the needs of our enterprise customers.\"The new SSD also includes a power loss protection feature to prevent the loss of user data \"in flight\" during an unexpected power interruption, It also comes with data protection features that include error detection/correction coding that is optimized for NAND flash. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-08-04 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Micron Technology",
        "NAND flash",
        "Seagate",
        "SSD",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/micron-technology/",
        "https://www.enterpriseai.news/tag/nand-flash/",
        "https://www.enterpriseai.news/tag/seagate/",
        "https://www.enterpriseai.news/tag/ssd/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-04-at-10.07.50-AM-216x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-04-at-10.00.45-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}