{
    "title": "Storage Roadmap Sees 100 TB Drives by ’25",
    "author": "George Leopold",
    "date": "2014-12-05 00:00:00",
    "text": "A technology roadmap for the storage industry is forecasting a ten-fold increase in hard drive storage capacity over the next decade as new recording technologies come online to boost areal densities.The Advanced Storage Technology Consortium's technology roadmap extending out to 2025 projects a 30 percent compounded annual growth rate for hard drive areal density (measured in terabits per square inch). That could mean 10 Tbpsi at the end of the forecast period could yield 100 TB hard drives as new recording techniques enter the mainstream.Hard disk drive areal density is measure that quantifies the amount of digital data that can be stored on a given disk drive surface area.The storage consortium said enabling technologies for a 100 TB disk drives initially include advances in current perpendicular magnetic recording (PMR) media. Those advances include two-dimensional magnetic recording along with shingled magnetic recording. The group said either technology could be used to augment PMR.By 2017, the consortium sees techniques like heat-assisted magnetic recording gaining traction as two-dimensional and shingled magnetic recording entering the mainstream for a period extending through 2021.By the beginning of the next decade, the storage consortium predicts the emergence of bit-patterned magnetic recording, again likely augmented by shingled and two-dimensional magnetic recording. Bit patterning is used to break up magnetic media into small regions on a disk surface.Areal densities currently estimated at 0.86 Tbpsi would jump four fold by 2021. The storage roadmap also noted advanced recording techniques like heated-dot magnetic recording technology could eventually drive areal densities to 10 Tbpsi by 2025. The heated dot approach is seen as building on advances introduced through the earlier introduction of bit-patterned and heat-assisted magnetic recording approaches.Current 8 TB and 10 TB disk drives use shingled magnetic recording and helium-filled HDDs. Drive makers like Western Digital's HGST unit are sucking out the air in disks and replacing it with hermetically sealing helium gas, which has a lower coefficient of friction, thus allowing for more platters to be put into a drive in the same thermal envelope. That allows disks to be packed closer together.In a recent commentary for Forbes.com, storage consultant Tom Coughlin noted that \"SMR technology probably cannot add too much more to areal density growth and putting helium in a hard drive can only allow adding so many more disks to a drive.\"Hence, the emerging magnetic storage technologies cited in the storage industry consortium roadmap could help double average annual areal density growth that Coughlin estimates is currently about 15 percent a year. That could mean that a 3.5-inch HDD based on emerging magnetic recording technologies could yield 100 TB HDDs by 2025, Coughlin said.It appears that all that storage capacity will be needed. According to at least one frequently cited forecast, data volumes are expected to grow 50 fold by 2020, the midpoint in the storage consortium's current roadmap.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/seagate-disk-drive-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/12/disk-drive-roadmap.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}