{
    "title": "Apple’s Datacenter Push Rattles Cloud Market",
    "text": "Apple's announcement this week that it would spend more than $10 billion over the next five years on datacenter construction promises to shake up the public cloud market.Responding to provisions of a U.S. tax overhaul approved in December, Apple announced Wednesday (Jan. 17) it plans capital expenditures totaling more than $30 billion through 2023. It also announced repatriation tax payments totaling about $38 billion required under the new tax law. Apple said the payment would be the largest on record.Overall, the company (NASDAQ: AAPL) claims its investments and tax payments would contribute an estimated $350 billion to the U.S. economy over the next five years.Industry observers noted that the aggressive datacenter construction plan also could catapult Apple into the top tier of public cloud providers. Previously, Apple has relied on rivals Amazon Web Services (NASDAQ: AMZN) and Microsoft Azure (NASDAQ: MSFT) to deliver its services. As those music and other services generate more revenues, the datacenter push may signal it is moving away from third-party vendors to meet its growing cloud computing and storage requirements.While the company did not address that possibility in its investment announcement, industry observers predict the datacenter push would realign the cloud market.\"While AWS, Azure and Google [NASDAQ: GOOGL] have essentially been the big three in cloud computing providers, Apple’s latest commitment creates the potential for a fourth tier-one provider,\" said Stu Bailey, CTO at Open Data Group, an analytics vendor based in Chicago.\"These top tier services have perfected the management of datacenters,\" Bailey added. \"Apple is only making it easier for smaller enterprises—by comparison—to rent space within the big datacenters, rather than buy their own.\"Bailey further predicts a \"flattening of datacenter budgets and datacenter build-out spend[ing] in conjunction with a meaningful increase in cloud computing spend.\"According to reports, Apple's $10 billion datacenter blitz would be on top of the $16 billion in annual capital expenditures announced in November, before the U.S tax overhaul was approved. The company has been building datacenters in Europe in order to comply with strict European Union data governance rules and announced its first datacenter in China last summer.Over the last decade, Apple said it has invested billions of dollars in datacenters and co-location facilities in seven states, most recently in Iowa. The company said this week it has broken ground on a new datacenter in Reno, Nevada.The company also announced a $5 billion advanced manufacturing fund along with worker retraining efforts, including a coding initiative designed to address the software development skills gap. A salary survey released earlier this week found soaring demand for software developers, with entry-level software engineers attracting median starting salaries as high as $95,000. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-01-18 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Apple",
        "AWS",
        "cloud",
        "datacenters",
        "Microsoft Azure",
        "software",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/apple/",
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/microsoft-azure/",
        "https://www.enterpriseai.news/tag/software-2/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-18-at-5.34.56-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}