{
    "title": "Storage Software Comes Packaged in App Containers",
    "text": "Server software released this week by storage vendor Scality comes packaged in a Docker application container to speed deployment of cloud-native applications by eliminating the need to decide ahead of time where applications are deployed in production. That means applications developed on the company's S3 server can be deployed on-premises, on a public cloud, or both.The San Francisco-based software-defined storage specialist said Tuesday (June 14) the open source version of its S3 API addresses the lack of a platform for locally developing and testing applications before web-scale deployment. The container approach allows the company's API to be deployed on a single server so developers can write code locally. Applications can then be deployed in datacenters or on the Amazon Web Services (NASDAQ: AMZN) public cloud, Scality said.Scality CEO Jérôme Lecat noted in a statement that the S3 server is based on the same code as a version deployed in production \"for billions of objects and petabytes of storage\" provided by the latest version of its Ring storage platform.Scality works with server makers like Hewlett Packard Enterprise (NYSE: HPE) and Dell in areas like software-defined object and file storage as customers cope with growing amounts of unstructured data. HPE, an equity investor in Scality, began packaging Scality software with its Apollo and ProLiant servers in 2014.In April, Scality and Dell announced collaboration that combines Scality Ring software with Dell's SD7000-S object and file storage server. Dell describes the storage server as a \"purpose-built appliance for Scality's object storage\" platform.The new S3 server is written in Node.js and offers API compatibility. That feature is designed to simplify coding by allowing application developers to utilize a set of AWS S3 language-specific bindings and wrappers, including software development kits for Java, .NET, Javascript, and Go.Meanwhile, Docker volumes are used for storage, and Scality said the application containers could be used for pilot and production deployment of several hundreds of terabytes.As are many computing and storage vendors, Scality said it decided to release its server implementation to the open source community. The hope is that open source developers could leverage the \"instant\" test and development platform either directly on a laptop or running as a container service in the cloud.\"We are convinced that this server software will be used by the creative community in many ways that we have not envisioned, and which in turn will develop the value and accessibility of object storage,\" noted Scality CTO Giorgio Regni.Both free and paid options for its S3 server are available on Docker Hub and Github as well as the company's portal. An enterprise version also is available on a subscription basis for $950 per month per server, the company said. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-06-14 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS",
        "Dell",
        "object storage",
        "Scality",
        "server storage",
        "servers HPE"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/dell/",
        "https://www.enterpriseai.news/tag/object-storage/",
        "https://www.enterpriseai.news/tag/scality/",
        "https://www.enterpriseai.news/tag/server-storage/",
        "https://www.enterpriseai.news/tag/servers-hpe/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/storage-370x246.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}