{
    "title": "EMC Bundles ScaleIO Software, Servers",
    "text": "Storage leader EMC Corp. said it is bundling commodity servers with ScaleIO software to serve as a \"node\" for deploying and leveraging software-defined storage.EMC's ScaleIO Node is designed to scale out from three to more than 1,000 nodes across multiple stacks, the company said Wednesday (Sept. 16). Performance is said it scale linearly at, for example, 100 million IOPS from 500 ScaleIO nodes.EMC is promoting its ScaleIO server storage-area network software as a way to converge computing resources and commodity storage into a \"single-layer architecture.\" The projected savings claimed to be as high as 60 percent are said to derive from the elimination of dedicated storage components. The company also said the approach allows for adding or removing servers without downtime.The storage vendor also cites market surveys predicting increasing compound annual growth rates for server SANs as high as 38 percent over the next five years.The company claimed that customer Itrica Corp., an infrastructure service provider based on Quincy, Mass., focusing on the pharmaceutical industry, halved its storage costs after deploying ScaleIO server SAN software. The EMC customer said it used the server software to overcome performance, redundancy and network bottleneck issues.Proponents of software-defined approaches stress its inherent flexibility. EMC noted that its ScaleIO approach runs on existing hardware as well as its own servers to turn direct-attached storage into elastic shared block storage.Further, it said the software-defined approach handles multiple servers, configurations, hypervisors, operating systems (Windows or OpenStack) and media types like PCIe flash or solid-state drives while providing the option to go with hyper-converged infrastructure based on commodity hardware.The ability to scale storage is also aligned with the needs of specific applications, the company added, while rebalancing and storage optimization are automated to minimize the impact on applications.Each server in a ScaleIO cluster is used in parallel as a way to reduce processing bottlenecks. Hence, EMC claims performance increases linearly as the number of servers per cluster grows.David Noy, EMC's vice president of product management, said ScaleIO Node responds to customer requirements to provide both storage software and server infrastructure. Hence, the new software-defined storage cluster accounts for software as well as the hardware it runs on.Noy added that the new storage nodes could be tweaked either for capacity or performance. Users seeking to build a scaled-out storage appliance could add servers with ScaleIO software and \"build block services that grow as you go [with] applications running on separate application servers.\"The performance option includes \"very high core density\" in a 2U rack configuration that targets high-performance computing applications. One option includes flash and spinning disks. At the high end is an all-flash node, Noy said.EMC said ScaleIO Node would be available in the first quarter of 2016. Pricing details were not disclosed.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-09-16 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "EMC",
        "SAN",
        "ScaleIO",
        "Software-defined storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/san/",
        "https://www.enterpriseai.news/tag/scaleio/",
        "https://www.enterpriseai.news/tag/software-defined-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}