{
    "title": "Intel Xpoint Storage Targets Datacenter",
    "author": "George Leopold",
    "date": "2017-03-20 00:00:00",
    "text": "Intel Corp. has begun shipping new storage drives based on its 3-D XPoint non-volatile memory technology as it targets data-driven workloads.Intel's new Optane solid-state drives, designated P4800X, seek to combine the attributes of memory and storage in the same device. The result is a new \"data storage tier\" intended to overcome growing storage bottlenecks in datacenters.Intel said its new SSD based on Xpoint (pronounced \"cross point\") memory technology would help speed applications for faster caching and storage while allowing datacenter operators to deploy larger datasets analyzed using large memory pools.Intel argues that current storage approaches based on DRAM and NAND are contributing to the current datacenter storage gap, and that storage platform increasingly need to behave \"like system memory.\" DRAM is too expensive to scale while NAND can scale but falls short in terms of datacenter performance.Hence, the Optane SSD leverages the Xpoint approach unveiled in 2015 to boost memory density by as much as ten times compared to conventional memory chips, claim Intel and development partner Micron Technology Inc. Optane, Intel's first deployment of Xpoint memory stacks, is said to deliver a five- to eight-fold boost in performance for \"low queue depth workloads.\"Faster caching and storage are also said to boost scaling for individual servers while speeding up latency-sensitive workloads, the company said Monday (March 20).The first product in the Optane P4800X series comes with 375-Gb storage capacity in the form of an add-in card with both PCI Express and Non-Volatile Memory Express interfaces. Typical latency is rated at less than 10 microseconds.Intel said its Optane SSDs combine emerging Xpoint memory media with its memory controller as well as proprietary interface hardware and software.Last April, Intel (NASDAQ: INTC) demonstrated Optane SSDs operating at 2 Gb/sec speeds. Along with speed improvements, Intel and memory partner Micron (NASDAQ: MU) said last year they hoped to convince potential enterprise customers that XPoint memory platforms are more durable than current NAND flash technology as well as providing as much as a ten-fold increase in storage density for persistent data compared to DRAM.In terms of endurance, Intel said Optane could handle up to 30 drive writes per day and up to 12.3 petabytes of written data. Hence, the SSDs target \"write-intensive applications such as online transaction processing, high performance computing, write caching and logging,\" the chipmaker said.As flash storage makes greater inroads in datacenters, Intel's storage SSDs based on 3-D Xpoint memory technology essentially creates a new storage category between flash and DRAM. The chipmaker argues its storage approach addresses the fundamental computing problems of moving data closer and linking to CPUs.\"Faster storage is important to computing because computing is done on data, and data is put in storage,\" said Robert Crooke, general manager of Intel's Non-Volatile Memory Solutions Group. \"The longer it takes to get to that data, the slower the computing….\"Meanwhile, Micron is targeting its SSDs based on Xpoint technology at cloud applications, data analytics, online transaction processing and the Internet of Things.The memory maker said last summer its Quantx line of SSDs also delivers read latencies at less than 10 microseconds and writes at less than 20 microseconds. That, Micron asserted, is 10 times better than NAND flash-based SSDs. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-20-at-12.24.22-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}