{
    "title": "Flash Startup NexGen Targets Flash Utilization",
    "author": "no author",
    "date": "2015-01-21 00:00:00",
    "text": "NexGen Storage Inc., the flash array specialist spun out earlier this month from SanDisk Corp., unveiled a new hybrid flash array this week along with intelligent caching software designed to boost enterprise utilization of pricey flash storage.NexGen, Louisville, Colo., claims its third-generation \"Prioritized Active Cache\" software that targets caching algorithms can help justify the investment in flash storage arrays by improving utilization by as much as 150 percent. \"It's about managing apps, workloads, not just adding [storage] capacity,\" George Wagner, NexGen's senior product marketing manager, said in an interview.Despite recent attempts to lower the cost of all-flash storage arrays, the price as measured in dollars per gigabyte of storage remains relatively high. At the same time, enterprises are struggling to access what NexGen estimates is the roughly 5 percent of data that is useful at any given time. Hence, Wagner argued, \"You need a way to prioritize data to reduce the cost of flash.\"Overall, the startup said improvements in performance, density and flash capacity could yield as much as a four-fold reduction in storage costs as measured in dollars per virtual machine when compared to hybrid approaches, NexGen said.The startup's strategy takes a page from the middle of the last decade when CPU processing power was underutilized in servers until hypervisor technology helped boost utilization. Today, NexGen maintains, workload prioritization is needed to boost flash storage utilization as a way to justify the cost of the investment.Hence, the company is promoting its \"dynamic prioritization\" approach through active caching software as a way to separate high and low priority data. The result, NexGen claims, is more efficient utilization of expensive flash storage along with overall performance improvements.If its accurate, as the company argues, that solid-state disks and memory create bottlenecks, one remedy is integrating PCIe flash to move it as close to processors as possible. \"It's really about efficient scaling,\" Wagner argued.Another way the startup is attempting to drive down flash costs through higher utilization is reducing the overall amount of flash capacity required. It estimates that standard all-flash systems require as much as 60 TB of storage while hybrid approaches require as much as 13 TB. NextGen said it could cut required flash capacity to as little as 5 TB, resulting in a 10-fold reduction in flash capacity but a claimed four-fold reduction in latency when compared to all-flash SSD arrays.The result, Wagner said is a better return on flash investments. \"More is less,\" he argued.NexGen’s also touts its policy-based quality-of service emphasis as enabling customers to avoid the high cost of all-flash arrays and the inconsistent performance of SSD-based hybrid arrays.SanDisk announced earlier this month it had completed the spin out of its ioControl unit acquired in its June 2014 purchase of Fusion-io. It will remain an OEM supplier of PCIe flash and disk drives to NextGen, the startup said.NextGen said its N5 line of hybrid flash arrays are available now with prices starting at $55,000. At the low end, a 2 TB flash configuration is said to scale to 7.2 TB while the high-end system with 10.4 TB of flash storage scales to 15.6 TB.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-21-at-12.25.10-PM.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-21-at-11.25.05-AM.png"
    ]
}