{
    "title": "OpenStack Kilo Rolls With Network, Storage Upgrades",
    "text": "The release of OpenStack Kilo this week, the foundation's 11th offering, includes a batch of compute, storage, networking and provisioning features intended to extend the platform to fit workloads with bare metal and application containers.In releasing Kilo Thursday (April 30), the OpenStack Foundation noted that production deployments make up half of OpenStack deployments while network functions virtualization (NFV) \"is the fastest growing use case for OpenStack cloud software.Along with the OpenStack Foundation, contributors to OpenStack Kilo include Hewlett-Packard, Huawei, IBM, Mirantas, NEC, Rackspace, Red Hat, SUSE and Yahoo. Red Hat and NEC announced in February that they would jointly develop NFV features in OpenStack in advance of the Kilo release. Some of those features were included in an earlier OpenStack Juno release.Meanwhile, HP said it was contributing a series of storage capabilities aimed at improving storage efficiency in open cloud environments.OpenStack said Kilo's new object storage support for erasure coding would provide the ability to balance density and durability depending on the application.Among the new features in the Kilo release are Swift Object and Cinder Block storage updates and improvements. OpenStack said Swift Object upgrades include \"container-level\" temporary URLs designed to control access to a set of objects in a container along with improvements to global cluster replication.The Cinder Block updates cover testing and validation requirements for backend storage systems. The updates aim to ensure consistency across a growing range of storage options along with continuous functionality testing for selected drivers.Contributors to the Kilo's object storage initiatives argued the enhancements would deliver greater stability. Stratoscale, a hyper-converged infrastructure specialist and contributor to the Cinder Block storage initiative, acknowledged the difficulty of deploying the OpenStack platform. OpenStack’s Kilo release \"will make it more usable for everyone,\" the contributor asserted.The Kilo release also incorporates a load-balancing-as-a-service API dubbed Neutron Networking. OpenStack said additional features would support broader NFV functionality.The first full version of Ironic bare-metal provisioning, a \"core\" project under Kilo, is also incorporated into this week's release. Ironic is designed to provision workloads that require direct access to hardware. It adopts Linux containers, NFV and platform-as-a-service functionality along with support for existing virtual machine workloads.Kilo also offers new API versioning management under its Nova Compute project. \"This makes it easier to write long-lived applications against compute functionality,\" OpenStack said.Meanwhile, Kilo contributor HP said it was pitching in with a series of storage and management tools intended to reduce operational costs in cloud and hybrid platforms. HP said its storage contributions would help Kilo support \"application-centric\" and converged storage management while making environments using kernel-based server virtualization technology ready for production.HP storage contributions to OpenStack Kilo include: an evaluator scheduler that automatically assigns storage resources; \"adaptive\" flash cache as a virtual extension to DRAM cache; \"thin\" deduplication to boost storage capacity utilization while extending the lifetime of flash drives used for virtualized workloads; and \"Manila files\" services designed to allow storage of both block and file workloads.HP said its goal is to support \"flexible hybrid cloud infrastructure\" because enterprise customers don't use a single operating system, database software or management tool. Hence, it is supporting OpenStack at the storage layer.HP also plans to incorporate support for OpenStack Kilo into future releases of its Helion OpenStack platform released last year.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-05-01 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "container",
        "nfv",
        "object storage",
        "OpenStack Kilo",
        "Virtualization"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/container/",
        "https://www.enterpriseai.news/tag/nfv/",
        "https://www.enterpriseai.news/tag/object-storage/",
        "https://www.enterpriseai.news/tag/openstack-kilo/",
        "https://www.enterpriseai.news/tag/virtualization/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-01-at-11.24.46-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}