{
    "title": "Storage Consolidation Quickens With NetApp-SolidFire Deal",
    "text": "The consolidation of the storage sector gained momentum at the end of 2015 with NetApp Inc.'s deal to acquire all-flash startup SolidFire for $870 million in cash.The deal announced just before the holidays also accelerates efforts by NetApp (NASDAQ: NTAP) to push all-flash arrays into datacenters and other enterprise infrastructure. NetApp, Sunnyvale, Calif., noted that SolidFire's all-flash storage approach along with its data management architectures would help NetApp streamline datacenter operations and speed deployment of new applications.\"Many customers want to incorporate the performance of flash with scale-out and software-defined storage functionality for efficient management of data growth and service provider-like flexibility,\" NetApp CEO George Kurian stressed in announcing the SolidFire deal on Dec. 21. \"We are acquiring SolidFire because it allows us to address a new segment of the fastest-growing part of the storage market, the all-flash array market.\"Kurian added in a conference call with industry analysts that the acquisition would help NetApp accelerate its cloud-service provider capabilities. The company also will target enterprises deploying web-scale infrastructure on premises to deliver applications like NoSQL databases, Hadoop environments and DevOps capabilities.NetApp said it expects to close the transaction during the fourth quarter of its current fiscal year ending in mid-2016.Other all-flash vendors seized on the SolidFire acquisition as evidence that flash-based storage is coming of age. NetApp's deal to acquire SolidFire \"is the latest example of legacy storage vendors trying to innovate through acquisition,\" asserted Kevin DeNuccio, CEO of flash storage startup Violin Memory.\"The challenge they will face is that they are trying to build a flash storage platform on antiquated technology. We think this acquisition is a validation of just how critical flash storage is for the datacenter,\" DeNuccio added.NetApp's acquisition of SolidFire also was driven by the startup's stress on deploying flash storage as a way to address specific application problems. Enterprise customers \"also want to scale out their flash once they deploy it to accelerate an Oracle database or a VDI setup,\" Jay Prassl, vice president of marketing at SolidFire, told EnterpriseTech in announcing a funding round in October 2014.Meanwhile, NetApp executives also cited SolidFire's involvement in cloud storage initiatives, including integrated storage management for OpenStack, VMware and other cloud frameworks.Kurian also made the case to industry analysts that SolidFire would complement rather than cannibalize its current all-flash product line. NetApp's all-flash platform dubbed FAS is designed to deliver enterprise-grade features across flash, disk and cloud storage resources.\"The value of SolidFire is in their highly distributed software operating system that can allow people to deploy agile DevOps environments or web-scale environments very, very quickly, and very consistently,\" Kurian argued. \"So they're complementary. And we think that it allows us to access new spending within customers, especially for third platform use cases.\" George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).The speed at which larger companies have come into the flash storage array space, bought smaller companies and proceeded to successfully gain marketshare has been happening for some time. Both IBM and EMC are evidence of this. The latest acquisition from NetApp is a huge win for NetApp as they have acquired probably the most sophisticated and scalable flash array company available.They should be less concerned about cannibalizing their existing products. If they don’t do it – someone else will. At this point it will be interesting to see there are still other buyers left. All the big players seem to have made their choices and bought.Small correction: The term FAS is used for the ONTAP-based general purpose storage platforms, the all-flash variant is called AFF (All-Flash FAS). Additionally there is also the latency-optimized SANtricity-based E-Series and EF-Series (all-flash).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-01-04 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "acquisition",
        "All-flash storage",
        "NetApp",
        "SolidFire",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/acquisition/",
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/netapp/",
        "https://www.enterpriseai.news/tag/solidfire/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/01/Screen-Shot-2016-01-04-at-12.06.18-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g",
        "https://secure.gravatar.com/avatar/bacb16078d3733cf604ccaa7a4b3b186?s=60&r=g",
        "https://secure.gravatar.com/avatar/96de50856e18b237165ab00c90f0fd0d?s=60&r=g"
    ]
}