{
    "title": "Cloudian Partnership Expands Its Object Storage Platform",
    "author": "George Leopold",
    "date": "2018-02-28 00:00:00",
    "text": "Seeking to capitalize on the growth of object storage and the reluctance of companies to delete data that could one day prove useful, cloud object storage specialist Cloudian has announced a partnership with an investment firm founded by a former Cisco System executive.Cloudian and investor Digital Alpha said the $125 million storage joint venture aims to accelerate adoption of Cloudian’s enterprise object storage platform. The investment also finances a partnership between Cisco (NASDAQ: CSCO) and Cloudian “covering relevant datacenter architectures, the partners said Wednesday (Feb. 28).Cloudian’s flagship object storage platform is compatible with Amazon Web Services’ S3 cloud storage service. The company said the joint venture with Digital Alpha also was spurred by the growing number of machine learning and Internet of Things (IoT) use cases. Assuming data storage requirements are doubling roughly every two years, the partners assert that enterprises will be reluctant to delete data “for fear it may be valuable when the right analytics algorithm comes along to make sense of it all.”The investment includes $100 million to enable “consumption-model procurement” of Cloudian cloud object storage products. The other $25 million equity investment will be used to expand Cloudian’s sales and marketing efforts, the partners said.Cloudian, San Mateo, Calif., said its strategy is designed to scale data residing in multiple locations, then ensure that data is widely available. The joint venture will “enable flexible procurement models and new hardware options to accelerate their transition to next-generation object storage solutions” as data management requirements outstrip current storage capabilities, said Cloudian CEO Michael Tso.Rick Shrotri, Digital Alpha’s managing partner and co-founder, was formerly managing director of Cisco Systems’ Business Acceleration unit. Digital Alpha has “preferred” access to Cisco commercial deployments as part of a collaboration agreement.Cloudian and Digital Alpha are betting that the current mix of on-premises, cloud, hybrid and object storage along with tape and other legacy storage platforms won’t be able to keep pace with storage demands. In particular, they cite huge data volumes generated by AI and machine learning along with IoT and video surveillance.The partnership also reflects the ascendance of object storage as public cloud vendors like Amazon (NASDAQ: AMZN) and IBM (NYSE: IBM) SoftLayer reduce prices for the emerging storage service. The object storage price wars that surfaced early last year reflect “object storage’s move into the mainstream,” market watcher 451 Research noted last April.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-28-at-9.34.16-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}