{
    "title": "Terascala Rides Herd With Lustre Into The Enterprise",
    "author": "Timothy Prickett Morgan",
    "date": "2014-04-08 00:00:00",
    "text": "It is still early days for the commercialization of the Lustre parallel file system. But the brisk business that Terascala, one of several companies that have put some polish onto Lustre to make it more amenable to enterprises, shows that it is indeed taking off outside of traditional supercomputing markets.Terascala, which is based in Avon, Massachusetts, was founded in 2005 on the premise that network attached storage was not going to be able to keep up with the demands of simulation, modeling, and analytics applications and that eventually enterprise customers would need a parallel file system akin to the open source Lustre, which went into production two years earlier on a Linux cluster at Lawrence Livermore National Laboratory.IBM's Global Parallel File System is the other popular parallel file system in HPC circles, and Red Hat's Gluster is coming into the enterprise from a different oblique angle out of hyperscale datacenters. Others will no doubt follow suit, but these clustered file systems will likely not have the performance of Lustre and GPFS, the latter of which is not open source.Lustre can be a bit cranky to install and manage in its open source form, and that's why companies that need something with more bandwidth and capacity than a NAS setup can deliver are looking for commercial-grade Lustre, and often they want it to roll in as an appliance. Terascala is a privately held company, so it doesn't have to talk about its financials, but Steve Butler, the company's CEO, chatted a bit with EnterpriseTech about how the company is doing and what is driving its growth.Revenues for Terascala in the first quarter of 2014 are more than double sales in the same period in 2013, and sequentially from the fourth quarter of 2013, sales are up 50 percent. In fact, every quarter in 2013, Terascala grew sequentially. Terascala grew by over 100 percent in 2012 and was projecting for sales to only be up by 75 percent for all of 2013. But 2014 is off to an even better start.Granted, Terascala is starting from a relatively small base – Butler says the company is at a run rate of under $10 million, and has about 75 customers. About a quarter of them are enterprise customers rather than modestly sized academic and government supercomputer centers who also buy its Lustre appliances. These are built using Dell PowerEdge R620 servers as metadata storage servers and then either Dell PowerVault disk enclosures or NetApp E-Series disk arrays for object storage servers.The enterprise portion of the company's business is small, but growing fast.As EnterpriseTech reported last year, one such enterprise customer is Tradeworx, a hedge fund that scapped its homegrown Lustre implementation for a Terascala appliance. Ditto for Westinghouse Electric Company, which uses a 1 PB Terascala Lustre appliance to support around 200 engineers who use ANSYS to design nuclear reactors and do computational fluid dynamics simulations that test those designs.Butler says that mid-sized manufacturers are also coming to Terascala because they want Lustre to be easier to consume as they try to solve their own storage bandwidth issues relating to product design. This is something that companies like Terascala have been hoping would happen for years.Life sciences companies, particularly those in genomics research, are looking for the high-bandwidth and ease-of-use that comes with the appliance approach. The genomics sequencing workloads are overwhelming NAS arrays, and they are trying to parallelize their data pipelines.\"We are doing this with some of the top pharmaceutical companies,\" says Butler. \"Classic HPC is about doing something really big, and what we are seeing with these enterprise customers is a faster, thinner appliance. For a genomics sequencer, a life sciences company is looking for 250 TB of storage to attach to that sequencer. And the customer is willing to pay good money for it, which is great for margins, because this is not about getting the cheapest storage. The metric they care about is dollars per gigabyte per second.\"Terascala is also looking to get more traction in the oil and gas industry, which has been an early adopter of just about every supercomputing technology, including parallel file systems. Halliburton's Landmark software division has just inked a deal to be a reseller of Terascala appliances, and will be peddling NetApp-based appliances to customers using its SeisSpace after a six-month period of heavy testing in its labs.At the moment, Dell iron underpins the majority of the Lustre object nodes that Terascala sells, but NetApp, which has only been a partner for a short while, will see more action after the Halliburton Landmark deal and it will probably balance out, says Butler.Terascala had raised $21.8 million in several rounds of funding between 2007 and 2012, and last November disclosed a venture round from Ascent Venture Partners, Harbor Light Capital Partners and Thomas Weisel as well as a \"significant financing package\" from Bridge Bank. The amount of this venture round and additional funding was not disclosed. At that time, Butler was brought in as CEO and the company also transitioned to an OEM sales model, working through Dell and NetApp to sell to customers.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/terascala-logo-2-370x240.jpg"
    ]
}