{
    "title": "John Deere Uses Machine Learning to Help Fewer Farmers Do More with Less",
    "text": "Farming and advanced AI may seem antithetical, but they’re not. Ask John Deere. The venerable farm equipment company has not only long embraced advanced technologies, the company for years has evangelized adoption of high performance clusters and simulation software for product design. Now the company in integrating intelligence in traditional farm vehicles – tractors, harvesters and the like. And Deere freely states it’s an extremely complex undertaking.In a recent article in IEEE Spectrum, Deere’s Julian Sanchez, who heads the Moline, IL, company’s intelligent vehicles strategy, said that while the company is working on autonomous driving, “it’s not just about driving tractors around.” The more difficult problem, he said, is crop classification. Sanchez and his team are developing AI-based image analysis capabilities that automatically adjust harvester equipment based on whether the corn or grain is of good or low quality. “…the many differences between grain types, and grains grown under different conditions, make this task a tough one for machine learning,” reported IEEE Spectrum.“Let’s say we are building a deep learning algorithm to detect this corn,” Sanchez said. “And we take lots of pictures of kernels to give it. Say we pick those kernels in central Illinois. But one mile over, the farmer planted a slightly different hybrid, which has slightly different coloration of yellow. Meanwhile, this other farm harvested three days later in a field five miles away; it’s the same hybrid, but it also looks different. It’s an overwhelming classification challenge, and that’s just for corn. But you are not only doing it for corn, you have to add 20 more varieties of grain to the mix; and some, like canola, are almost microscopic.”A major hurdle is the ever-changing state of things on a farm, one year and one season to the next.“Deep learning is great at interpolating conditions between what it knows; it is not good at extrapolating to situations it hasn’t seen,” said Sanchez, stating a universal AI truth. “And in agriculture, you always feel that there is a set of conditions that you haven’t yet classified.”Alexey Rostapshov, Deere’s head of digital innovation, told IEEE Spectrum that ag complexity adds up to very big data, resulting in the company becoming one of the largest users of cloud computing services in the world. He said Deere gathers between 5 and 15 million measurements per second from 130,000 connected machines around the world.“We have over 150 million acres in our databases, using petabytes and petabytes [of storage],” Rostapshov said. “We process more data than Twitter does.”Beyond the challenge of storing all the data, Deere also must cleanse it, and this is difficult because much of it comes in different formats – not only from various of its own machines but also weather information, aerial imagery and soil analyses.Rostapshov said the company put its initial data wrangling emphasis on its own sources. “We started simply by cleaning up our own data. You’d think it would be nice and neat, since it’s coming from our own machines, but there is a wide variety of different models and different years. Then we started geospatially tagging the agronomic data—the information about where you are applying herbicides and fertilizer and the like—coming in from our vehicles. When we started bringing in other data, from drones, say, we were already good at cleaning it up.”Even as the world is facing a growing shortfall of farming skills, Deere must deal with the general unmet demand for data science and machine learning skills. In hiring meetings, Sanchez said the company pitches both the challenges and importance of bringing ML to ag in the hope of instilling in software engineers the sense “that feeding a growing population is a massive problem (and that they) are excited about the prospect of making a difference,” Rostapshov says.Deere’s overall software strategy is to deliver capabilities that allow the decreasing number of farmers in the U.S. and around the world to do more with less: maximized crop yields with less seed, fertilizer, pesticides and workers. Data, of course, is the driver, and Sanchez told IEEE Spectrum he foresees a day when the company will anonymize and aggregate customers’ farming data.“We are not asking farmers for that yet,” Sanchez says. “We are not doing aggregation to look for patterns. We are focused on offering technology that allows an individual farmer to use less, on positioning ourselves to be in a neutral spot. We are not about selling you more seed or more fertilizer. So we are building up a good trust level. In the long term, we can have conversations about doing more with deep learning.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2019-10-15 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Slider: Cloud",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "agriculture",
        "AI",
        "farming",
        "John Deere",
        "Machine Learning"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/agriculture/",
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/farming/",
        "https://www.enterpriseai.news/tag/john-deere/",
        "https://www.enterpriseai.news/tag/machine-learning/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/farming-agriculture-farm-shutterstock_644903410-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/John_Deere_logo.svg_-300x201.png"
    ]
}