{
    "title": "Datacenters Flush with All-Flash Storage",
    "text": "Storage based on all-flash NVM Express arrays is gaining a foothold in enterprise datacenters even as the overall server storage market stumbles.The datacenter storage market is in the midst of a hangover following a big 2018. IHS Markit reports that global server storage revenue declined 4 percent year-on-year during the second quarter, with unit shipments dropping 10 percent. Overall, the server storage market is expected to contract by 1.5 percent in 2019.At the same time, the all-flash storage array sector rose a healthy 21 percent over the same quarter last year—despite a second-quarter revenue dip of 1.7 percent. The flash market is being driven in part by a what the analyst defines as “performance-optimized” storage arrays based on flash NVMe drives.Revenue in that category continues to rise. “Adoption of NVMe solid-state drives in all-flash arrays is starting to ramp up, and the use of NVMe inside arrays will continue at a surprisingly strong pace,” predicted Dennis Hahn, principal analyst at IHS Markit.As enterprise datacenters continue to burst at the seams, the market tracker remains bullish about the overall data storage sector, forecasting global revenues will grow at an annual rate of 9 percent to $62 billion by 2023, up from an estimated $40 billion this year.That growth will be driven by data-intensive AI and other workloads, also including Internet of Things and related industrial automation deployments as well as streaming video.At least part of the recent dip in all-flash revenues was traced to the inability of some suppliers to meet growing datacenter demand, the analyst said. As a result, leading supplier NetApp (NASDAQ: NTAP) struggled to expand shipments during the second quarter.The market correction also reflects last year’s booming datacenter storage segment as companies made the transition from storage disk technology to all-flash storage, a move necessitated by more demanding workloads.Storage technology economics in the form of average selling prices (ASPs) also are playing a role in the unfolding datacenter storage sector. IHS reported much higher ASPs for all-flash storage in 2018.Those higher prices also translate into larger capital expense investments, prompting some datacenter operators to “pause” purchases during the second quarter, especially high-end arrays. As flash prices continue to decline, the market watcher said it expects the transition to all-flash to resume for at least the next year.In terms of market share, Dell EMC (NYSE: DELL) remains the top supplier of array storage for datacenters, accounting for 29 percent of the global market. As noted, NetApp slipped in the second quarter behind Hewlett Packard Enterprise (NYSE: HPE). HPE’s market share rose to 7 percent.IHS said “white box,” or small systems integrators, collectively accounted for 22 percent of the datacenter storage market, trailing only Dell EMC.  George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-11-11 00:00:00",
    "cats": [
        "Datacenter",
        "Edge/IOT",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "All-flash storage",
        "ASPs",
        "datacenters",
        "IHS Markit",
        "NVMe",
        "server",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/asps/",
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/ihs-markit/",
        "https://www.enterpriseai.news/tag/nvme/",
        "https://www.enterpriseai.news/tag/server/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/Screen-Shot-2017-05-09-at-2.05.19-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}