{
    "title": "Standard Hardware Fueling Datacenter Boom",
    "text": "Datacenter construction is booming in the second half of 2019 as cloud providers and co-location service providers embrace common platforms that scale to accommodate data-driven applications and services.IHS Markit reports that 9.9 million square feet of datacenter capacity is currently under construction and is expected to come online by the end of the year. The construction boom is attributed largely to the industry embrace of standard hardware that complies with Open Compute Project (OCP) guidelines.The industry group has emerged as the primary clearinghouse for standard datacenter hardware, doing for computing, storage and networking what the open-source movement did for software development.The result is a project 59-percent compound annual growth rate for OCP-compliant hardware through 2021, IHS Markit forecast this week. Cloud service providers account for 56 percent of new datacenter construction in the second half of this year while colocation services (37 percent) and telecom carriers (7 percent) account for the remainder.OCP launched a datacenter certification program last year that has so far yielded four new OCP-compliant facilities, including two in London, another in Boden, Sweden, along with the GIGA Data Centers facility in Raleigh, N.C.“A common platform approach provides scalable, efficient designs for all adopters, and is especially well-suited for large enterprise and telecom operators (those providing private cloud services) that benefit from leveraging the technology and products developed by the world’s biggest service providers,” the group said in a blog post outlining OCP’s 2020 roadmap.“The common platform concept would ideally support modularity, standardization of hardware management and security, and open system firmware.”The construction surge is expected to taper off next year. IHS estimates about 4.7 million square feet of datacenter capacity will open during the first half of 2020.“The second-half spike this year is the product of an unusual deployment-timing phenomenon, driven by cloud-provider projects initiated over the last three years and colocation projects starting during the last six to 18 months,” said Alan Howard, IHS Markit analyst.The market tracker previously forecast that purchases of OCP-compliant storage equipment will more than double to $5.4 billion through 2023 as enterprise customers hustle to cope with soaring data volumes.Those forecasts mesh with others that note the steady growth of hyperscale datacenters. For example, Synergy Research reported in October that large-scale datacenter growth topped 500 facilities by the end of the third quarter. The current count of 504 hyperscale datacenters represents a tripling of capacity since 2013, Synergy Research said.“There were more new hyperscale datacenters opened in the last four quarters than in the preceding four quarters, with activity being driven in particular by continued strong growth in cloud services and social networking,” said John Dinsdale, research director at Synergy Research Group.“This is good news for wholesale datacenter operators and for vendors supplying the hardware that goes into those datacenters,” Dinsdale added.Synergy Research reckons there are at least 150 datacenters planned or under construction, indicating that “there is no end in sight to the datacenter building boom,” Dinsdale said. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-12-04 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Storage",
        "Slider: Systems",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "cloud servers",
        "datacenters",
        "hardware",
        "hyperscale",
        "IHS Markit",
        "OCP",
        "Open Compute Project",
        "Synergy Research"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-servers/",
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/hardware/",
        "https://www.enterpriseai.news/tag/hyperscale/",
        "https://www.enterpriseai.news/tag/ihs-markit/",
        "https://www.enterpriseai.news/tag/ocp/",
        "https://www.enterpriseai.news/tag/open-compute-project/",
        "https://www.enterpriseai.news/tag/synergy-research/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/07/Construction-02-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}