{
    "title": "Breaking The Storage Bottleneck In The Datacenter",
    "author": "George Leopold",
    "date": "2014-10-13 00:00:00",
    "text": "As more applications are virtualized, storage is said to be emerging as a bottleneck in datacenter performance. These performance issues mean many applications cannot take full advantage of the benefits of virtual machines, according to an industry survey.The survey of more than 350 IT professionals by server-side storage intelligence vendor PernixData contends that the majority of those surveyed (51 percent) favor increased storage performance over capacity. Only 21 percent of respondents said more storage capacity was needed. Hence, the survey found that 44 percent of respondents have rolled out or are considering server-side flash over the next 12 months.Predictably, the vendor also touted another survey finding: 70 percent said they would consider deploying storage acceleration software.The survey found that storage concerns included improved virtualized database performance (44 percent), poor virtual machine response times (41 percent), the need for more storage IOPS and improved virtual desktop scaling and performance.As virtualization spreads throughout the enterprise application infrastructure, the PernixData survey concluded that the proliferation of virtual applications is fueling a shift to software as a way to remedy storage performance bottlenecks. The shift would enable \"existing virtualized environments to become more effective while allowing mission-critical applications like databases to transition to the virtual age,\" the survey argues.Moreover, the results revealed \"strong demand for a decoupled storage architecture that leverages high speed server resources, like host-side flash and RAM, in conjunction with existing (or future) shared storage.\" PernixData argued in a white paper releasing its annual virtualization and storage report that storage acceleration software could help harness the decoupled environment while helping to rein in hardware costs.The vendor claimed those 70 percent of survey respondents would be willing to purchase server virtualization software if it improved storage performance without have to buy more storage hardware. Hence, \"the concept of decoupling is extremely attractive,\" PernixData asserted.The emerging decoupled architecture includes server-side flash deployed in conjunction with existing shared storage. PernixData said that approach places storage performance \"in the server tier,\" closer to the virtual machine and applications, thereby leaving capacity in the storage array.Among the approaches taken by IT administrators to improve storage performance are server-side flash (44 percent of respondents), hybrid arrays (39 percent) and all-flash arrays (20 percent). These approaches have either been deployed or will be in the next 12 months, according to the survey.The challenge when upgrading storage hardware is the resulting linkage between storage performance and capacity, the software vendor argued. \"This leads to increased storage costs and inefficient usage of available storage resources,\" it added.PernixData said it commissioned the survey of 352 IT professionals conducted over a two-week period. Respondents worked for small businesses and large enterprises along with government agencies, schools, and service providers. All were based in the United States.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).Ha ha ha IT people are still not knowledgeable about the number one pb in IT although it is quoted everywhere. Lack of maturity probably and still caught by marketing concepts instead of real insights.\nThe storage architecture is the most secret topic at AWS, no need to ask why.\nJust a reminder for readers : Datacenter, Data processing, …, regards, an IT guy",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/08/datacenter_graphic1.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g",
        "https://secure.gravatar.com/avatar/bf8b6cd45f9cd8789b77d0d83d25d3b1?s=60&r=g"
    ]
}