{
    "title": "Nutanix Raises $101 Million To Push Storage Server Hybrids",
    "author": "Timothy Prickett Morgan",
    "date": "2014-01-14 00:00:00",
    "text": "Upstart system maker Nutanix, which has created a mashed up distributed file system and virtual server environment that can be clustered to support a variety of enterprise workloads, has just brought in a monster $101 million in its fourth round of funding.Nutanix is one of the big names in this expanding field of converged system appliances with built-in virtualization, and its competitors include Simplivity, Scale Computing, and Pivot3. Like many converged systems, the underlying servers are based on Xeon processors from Intel and include both flash and disk storage with automatic tiering. Nutanix counts eBay, the US Army, McKesson, Toyota, Orange Business Services, and Hyundai Hysco among its largest customers.The secret sauce in the Nutanix Virtual Computing Platform is something called the Nutanix Distributed File System, and it is not an open source program but rather something created from scratch by the company's founders. In short, NDFS turns the storage on a cluster of X86 servers running a hypervisor into a distributed storage area network. To scale out the storage or the compute, you simply add nodes to the cluster.The storage side of the Nutanix NX appliances includes flash-based PCI-Express cards from Fusion-io and flash-based solid state SATA drives from Intel as well as Seagate disk drives. NDFS presents the virtual SAN as either a file or block device for applications and also includes de-deduplication feature that can radically cut down the required storage for virtual machines running on the system that have common operating system and application software components. The Nutanix software stack also makes use of the Snappy data compression software that was created by Google for its internal MapReduce and BigTable systems and that was open sourced a few years back.On the server side, Nutanix supports VMware's ESXi 5.0, 5.1, and 5.5 hypervisors and more recently has added support for Red Hat's KVM hypervisor. Concurrent with the announcement of the fourth round of funding, Nutanix is now supporting Microsoft's Hyper-V 3.0 hypervisor and is tuning up its clusters to take advantage of the storage and virtualization features in the Windows Server 2012 R2 operating system that came out last fall.Nutanix was founded by storage and cluster experts from Google, Oracle, and Aster Data Systems back in 2009 and came out of stealth mode in the summer of 2011. The company's CEO, Dheeraj Pandey, who helped Oracle forge the initial versions of its Exadata database cluster appliances, was previously was vice president of engineering at Aster Data. Aster was acquired by Teradata back in early 2011 to give it a hybrid row-column parallel database to support both SQL and MapReduce workloads. Mohit Aron was chief architect at Aster Data and was the leading designer of the Google File System, which underpinned the company's first MapReduce system. The company's third co-founder, Ajeet Singh, work on Oracle's cloud before joining Aster Data as director of product management.The company is one of the fastest-growing infrastructure companies in history, according to its own math. It had a run rate of $25 million in sales as 2012 came to a close, and had boosted that run rate to $80 million in May 2013 ended. At that time, Nutanix had 200 employees, and today it has 400. The company is not disclosing what its current run rate is, but says that it has sold $100 million in machines in the past eight quarters. What Howard Ting, vice president of marketing, tells EnterpriseTech, is that around 75 to 80 percent of that revenue came in during calendar 2013, and this is without the channel and marketing might of a behemoth like Cisco Systems. Nutanix is growing sales on the order of 30 to 40 percent per quarter right now.So while that $100 million in total sales may be a speck in the $50 billion server and $25 billion storage array markets, Nutanix is part of the wave of sales for converged systems, which bring together servers, networking, and storage to simplify installation and provide tuned systems for specific workloads. Converged systems are growing fast while the rest of these two individual markets are growing slowly or not at all. Nutanix has over 750 software and reseller partners helping it peddle its gear, and those channels are doubling every year as well and are set to accelerate with the new funding.Nutanix has raised a whopping $172.2 million in venture capital so far. The new investors in the fourth round were Riverwood Capital, SAP Ventures, Morgan Stanley Expansion Capital, and Greenspring Associates; they join existing investors Lightspeed Venture Partners, Khosla Ventures, and Battery Ventures. The latest round gives Nutanix a valuation of around $1 billion, if you are wondering how much it will cost for a server or storage incumbent to buy it.A year ago, Nutanix was talking about how it was finally getting traction in Global 2000 accounts, and was successfully taking on those incumbents to win big deals. The company was also being pushed by these big customers to offer heftier configurations of its NX appliances to support their workloads.Last summer, Nutanix won a seven-figure deal at a big pharmaceutical company based in the United States, beating out Cisco on the server side and EMC on the storage side, and now it has closed thirteen deals worth over $1 million. The company is also boasting a 70 percent repeat purchase rate – something that rivals that of Cisco with its Unified Computing System converged systems. Cisco started selling its systems in early 2009, three years ahead of Nutanix, and now has an annual run rate of well over $2 billion.Cisco has grown its systems business so fast by having repeat customers who come back and spend a lot more the second and third time. Nutanix has those as well. Ting says that a very large retailer in the United States did an initial installation of NX appliances six months ago and spent $1 million. After running them for six months, this week this retailer came back and placed an order for $6 million more of machines and will be standardizing its entire server virtualization stack on NX appliances.\"We're really getting on that hockey stick curve now,\" says Ting. \"This is just scratching the surface.\"Nutanix wants to become a system player just as Cisco has become, and the $101 million funding round is designed explicitly to help Nutanix broaden and deepen its product line and bolster its sales ahead of an initial public offering that could happen in late 2014 or early 2015, according to Pandey. Morgan Stanley and Goldman Sachs are both investors, and as Ting points out, it is very rare when these two archrivals participate in the same investment.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/nutanix-logo-370x290.jpg"
    ]
}