{
    "title": "Elastifile’s ‘Cross-Cloud Fabric’: Flash-Native Distributed File System for Hybrid IT",
    "author": "Doug Black",
    "date": "2017-04-06 00:00:00",
    "text": "The tidal movement toward hybrid on- and off-prem IT is well underway and well understood. But the data management challenges of multi-site implementations, with data and applications straddling multiple storage and compute environments on-site and in a public cloud, can be highly complex.Deeply funded start-up Elastifile, formed in 2013 and now coming out of stealth, has been toiling on the development of a software-defined, flash-native “cross-cloud data fabric” that, if it delivers on its promises, addresses many at-scale hot button issues enterprise IT managers struggle with as they “lift and shift” data and applications to and from the cloud, as needed.Before explaining what Elastifile’s distributed file system is, let’s first outline the problems it attacks. The company set as its goal the elimination of storage barrier and hardware vendor lock-in problems, allowing “true hybrid IT and dynamic cloud workflows across all sites.”Elastifile contends that on-prem and cloud “are still really isolated, for the most part,”Jerome McFarland, director, product marketing, told EnterpriseTech. “You have the two sides…, but the data and the applications on each side are still tightly tethered to their locations. And you still have this IT dependence with a lot of manual intervention and complexity involved in managing storage to allow the applications in back of the data to get the data that they need.”These needs are addressed with cloud gateway products and cloud connector features within storage products, but “it really is a static model where data moves from one location to the other, or is generated in one location or another.”True hybrid IT, he said, involves multiple on-prem and cloud sites that are “all connected in a way that allows the applications and the data to meet dynamically between them so this static tethering to one location gets removed, and also dependence on IT gets removed and things become a lot more self-service.”The objective, he said, is to end dependence on IT administrators and allow infrastructure architects and analysts using data to provision storage and compute themselves, to move production workloads into stateful containers for integrated analytics and other high-performance NAS use cases.“Application architects and analysts using data can do these things seamlessly themselves and actually have these things be automated for the most part. So they can concern themselves with dealing with the data and getting value out of the data, and not worrying so much about the storage.”The Elastifile Cloud File System is a flash-native software-defined offering that the company says allows users to move data and applications freely between on- and off-prem environments, delivering, in its words, “hyperscale efficiency to enterprises and cloud service providers.”Key to Elastifile’s solution is the industry’s first scale-out distributed file system built from scratch for the cloud and for flash, according to the company, providing the “application readiness” of file with the scale of cloud and the performance of flash, while extending those capabilities transparently to object/cloud storage tiers. The Elastifile architecture is based on a patented distributed metadata model and its Bizur consensus algorithm that delivers 1-2 millisecond latency at scale in noisy and heterogeneous cloud environments.“To do that several things are required,” McFarland said. “You need to have this global name space that connects these environments together seamlessly, so the data can be accessed between each location with no requirements for static migration or complex interaction. It needs to support the scale this type of interaction requires because of course the cloud can have hundreds or even thousands of nodes applied to a workload. You have to have a software-only interface, because with the cloud, you definitely won’t be able to control what type of hardware, what servers, would actually be underlying those cloud instances. You need to maintain quality of service. And you need to have interfaces that are standardized so you don’t have to do any complex translation between them.”Elastifile also offers data reduction (global deduplication, compression and snapshot shipping) and CloudConnect object tiering, along with a consumption-based subscription pricing model. The company claims its TCO is 50 to 90 percent lower than alternatives, including traditional arrays, hyperconverged infrastructure appliances and cloud services, such as Amazon Elastic File System.“The Elastifile Cloud File System provides a new primary storage and data management option, while also providing cloud-like elastic efficiency through its OpEx pricing model based on consumption,” said Henry Baltazar, research director, 451 Research. “A distributed file system with advanced features such as QoS allows for the kind of scalability and elasticity that’s become so imperative to enterprises that are moving to and maintaining hybrid cloud deployments. Automatic migration between on-prem and public clouds helps enable the level of agility that clients are demanding, and which is not found in traditional software defined storage environments.”Elastifile has been financed to date primarily by more than $50 million from enterprise cloud and flash storage providers, as well as venture investors LightSpeed Venture Partners and Battery Ventures, and strategic investors that include Cisco and Western Digital.“Enterprises have struggled to safely migrate to the cloud their most demanding applications, with all their performance, availability, and data services requirements,” said Amir Aharoni, CEO and co-founder of Elastifile. “With Elastifile, they can do so immediately, without refactoring, and with scale-out consistent performance and mobility to innovate true hybrid cloud workflows.”McFarland said Elastifile decided in 2013 to commit to flash, which he said was a “pretty bold” decision at the time and one that is key to Elastifile price/performance.“We’re not the first ones that have thought of this utopia of data and applications being able to interact seamlessly across environments. But it hasn’t happened practically yet in the real world because the technology hasn’t been there to make it usable and to make it functional in the way it needs to be run.”But with flash, Elastifile “can leverage the random parallel capabilities of flash to get maximum performance,” McFarland said. “We don’t have to design in what are traditional work-arounds to try to hack in performance, like adding caching layers and other things that cause unpredictable performance when caches get built. We built a very clean design that optimizes flash performance and flash endurance as well.”Early customer Paul Camacho, SVP cloud products and services at technology and services company Innova Solutions, said Elastifile enables new cross-platform capabilities.\"Elastifile is helping us solve two of our biggest agility challenges for our analytics and cloud services: data mobility and performance,\" said Camacho. \"Its elastic scale-out performance and CloudConnect object and cloud tiering is enabling our transition to containerized micro services and a multi-cloud analytics delivery model. At the same time, Elastifile helps us finally align our infrastructure costs to our true demand and avoid vendor lock-in at both the cloud provider and hardware levels.\"",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/Elastifile-image-1-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/Elastifile-image-2-1.png"
    ]
}