{
    "title": "Dell at the Edge: Servers, Data Centers and Software for Deployment Anywhere",
    "author": "Doug Black",
    "date": "2020-02-20 00:00:00",
    "text": "Dell Technologies launched servers, a modular data center, telemetry management and streaming analytics software this week designed for the growing volumes of enterprise-generated data created and processed outside of data centers and the cloud – at the edge.Dell has long touted its integrated edge-core-cloud strategy, with the ultimate goal of supporting a future in which data emanates from virtually any object (Gartner: within two years, more than half of enterprise-generated data will be created and processed at the edge), is processed and produces analytics insights in near time. The “AI Everywhere” future will be enabled by the “holy trinity” of high performance computing, high speed networks and rapid machine learning.The challenges in achieving all this are many, particularly at the edge, whose demanding characteristics include high bandwidth, IT and security skills, space constraints, extreme weather, efficient power consumption and low latency, with the overriding need to deploy applications and infrastructure close to the point of data creation.With its announcement this week, Dell – one among many companies building out technologies to support this vision – showed how its approach is taking form.Leading its new edge products and available starting next month, the Dell EMC PowerEdge XE2420 is a dense, “short depth,” high-performance server designed for space-constrained and challenging operating conditions, the company said. Capable of supporting 5G implementations, it’s a two-socket system with capacity for up to four accelerators and 92TB of storage, and it has a ruggedized, Network Equipment-Building System certification with extended temperature tolerance and a filtered bezel for dusty locations, according to the company.The Dell EMC Modular Data Center Micro 415 is shorter and narrower than a parking spot, Dell said, and offers pre-integrated, enterprise-level data center IT, power, cooling and remote management. Available in the second half of this year, the company said complete details on the product are not yet available. Conceptually, the MDC Micro is designed for non-data center locations, such as the base of a telecommunications cell tower, Dell said, and “provides enhanced physical protection for IT equipment at the edge with extreme temperature-resistant enclosures, key lock doors and option for smoke detection and fire suppression.” Its enclosure supports up to 17U of compute and storage, it can operate in temperatures ranging from -40°C to 55°C, is compatible with short-depth and standard servers and utilizes integrated closed-loop cooling for environmental control.Available now, the Dell EMC iDRAC9 Data Center software is intended to provide remote access “for a consistent, more secure server management experience from the edge to the core to the cloud,” the company said. Its embedded management technology delivers streaming data analytics for understanding edge operations with up to 20 metric reports providing nearly 2.9 million data points per server, according to Dell, significantly reduce administrator-attended time per server compared to manual deployments. “With streaming telemetry on iDRAC9, customers can discover trends, fine tune operations, and create predictive analytics to help ensure peak performance, reduce downtime and prevent risk,” Dell said.The Dell EMC Streaming Data Platform, for ingestion and analysis of edge streaming data, is designed to simplify infrastructure management and to enable improvements in the data infrastructure. Able to handle streaming and non-streaming data, the platform provides auto-scaling ingestion, tiered storage with historical recall on-demand and unified analytics for both real-time and historical business insights, Dell said.“As we enter the next data decade, the challenge moves from keeping pace with volumes of data to gaining valuable insights from the many types of data and touchpoints across various edge locations to core data centers and public clouds,” said Jeff Boudreau, president, Infrastructure Solutions Group, Dell Technologies. “We offer a portfolio that’s engineered to help customers address the constraints of edge operations and deliver analytics for greater business insights wherever their edge may be.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/Dell-EMC-edge-IoT-slide-0220-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/Dell-EMC-Poweredge-XE2420.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/Dell-EMC-MDC-Micro.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/Dell-EMC-edge-IoT-slide-0220.png"
    ]
}