{
    "title": "Survey: Virtual Storage Emerges as Key Cloud Need",
    "text": "Storage is a critical component of cloud services as providers seek to differentiate their offerings via storage platforms designed to handle more virtual workloads, an industry survey concludes. That requirement also has fueled various \"multiple hypervisors\" strategies as a way to reduce the cost of delivering virtualized enterprise applications.In a survey of 78 cloud service providers conducted at the end of 2015, virtual machine-focused storage vendor Trinti Inc., Mountain View, Calif., found that three-quarters of respondents have virtualized more than 80 percent of their infrastructure. In so doing, nearly one-third of cloud providers surveyed said they are spending more than 10 percent of revenues on storage.Storage specialists such as Trinti point to these requirements as evidence that \"VM-aware\" storage is required to handle the growing number of virtualized applications. The storage company asserts that the percentage of virtual workloads has soared from about 2 percent in 2005 to more than 80 percent today.Infrastructure-as-a-service was the primary offering of 84 percent of survey respondents, followed by private cloud hosting (67 percent) and traditional managed services (48 percent), Trinti reported. Smaller cloud service providers are targeting specialized services as a way to differentiate themselves in a highly competitive market dominated by the likes of Amazon Web Services (NASDAQ: AMZN, Microsoft Azure (NASDAQ: MSFT) and Google Cloud (NASDAQ: GOOG, GOOGL).As for virtualization platforms, VMware vSphere (NYSE: VMW) continues to dominate, accounting for 95 percent of hypervisors used by cloud services providers. Microsoft Hyper-V was far behind, list by 33 percent of respondents.The largest enterprises with more than $500 million in revenue \"were much more likely to have integrated Microsoft Hyper-V alongside VMware vSphere,\" the Trinti survey noted. Given the continuing dominance of vSphere along with Trinti's contention that \"storage integration with VMware tools is key,\" the company asserted that cloud providers are seeking alternatives such as Hyper-V to reduce costs.Indeed, the survey found that multi-hypervisor strategies prevail. One reason is that cloud providers tend to be early adopters. Hence, the survey found that OpenStack is \"gaining some traction\" among cloud vendors, with 31 percent of respondents embracing the open source framework last year. Twenty-nine percent of respondents said they plan to roll out OpenStack in the coming year, while 62 percent said they had no immediate deployment plans.\"The cost to maintain your OpenStack footprint can be resource-intensive, especially if it requires separate storage needs to procure and manage,\" the survey's authors noted. \"Keep your eyes out for storage systems that can handle OpenStack side-by-side with other hypervisors to allow for experimentation.\"Other hypervisors cited by \"VM-aware\" cloud providers included Red Hat Enterprise Virtualization (11 percent), Citrix Xenserver (9 percent) and kernel-based virtual machines (5 percent).Based on these findings, Trinti asserted that storage spending is on the rise, accounting for more than 10 percent of cloud providers' revenue. The \"highly virtualized environments that [cloud service providers] operate depend on storage to serve as an enabler rather than a bottleneck,\" the storage vendor argued, concluding that cloud storage is fast becoming a \"make or break\" proposition for providers looking for ways to differentiate their services.Among the cloud storage requirements most often cited by respondents were cloud-hosting features like multi-tenancy and data security along with expanded automation of application development and deployment. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-03-07 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "OpenStack",
        "storage",
        "Trinity",
        "Virtualization",
        "vSphere"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/storage-2/",
        "https://www.enterpriseai.news/tag/trinity/",
        "https://www.enterpriseai.news/tag/virtualization/",
        "https://www.enterpriseai.news/tag/vsphere/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}