{
    "title": "Big Banks Discover Atlantis Storage Virtualization",
    "author": "Timothy Prickett Morgan",
    "date": "2014-02-13 00:00:00",
    "text": "Atlantis Computing has carved out a niche for itself in the datacenter by virtualizing desktops and storing them in main memory in server farms for fast access. Some of its biggest customers, including its flagship account, JPMorgan Chase, wanted to accelerate other workloads besides virtual desktops, and so Atlantis set out to develop a more generic implementation of its storage virtualization.The idea is to accelerate server workloads other than virtual desktop infrastructure (VDI) by pooling together main memory, flash, and disk storage already in the datacenter and using some of the tricks Atlantis learned speeding up VDI on this storage pool. This pool is virtualized and – here is the clever bit – presented to hypervisors running on servers as generic storage running either NFS or iSCSI protocols.Some Atlantis customers were impatient for this new product, called ILIO USX, to come to market. (The latter bit of the name is somehow short for Unified Software-Defined Storage; the first part stands for In Line Image Optimization.) These users, we have heard, had already hacked some server workloads onto systems that were running the VDI acceleration software. So it looks like the Atlantis customer base, which includes more than 400 well-recognized large financial institutions, healthcare companies, and US government agencies, is ready for an enterprise-grade storage virtualization tool.JPMC is one such customer, and like most big financial institutions, is pretty secretive about its technology. But here is what EnterpriseTech has been able to piece together about its evolution with Atlantis.Because of security concerns, financial companies were early adopters of hosted applications and then hosted desktops, and they have been enthusiastic about virtual desktops, too. If the applications or PC images are running in the corporate datacenter, then there is less of a risk of a security breach or data loss. JPMC had hosted desktops, and back in 2010 it came to Atlantis to use its initial ILIO VDI, a layer of software that used a mix of server main memory and disk storage to accelerate virtual desktops. This acceleration boosted how fast virtual desktops loaded and how fast applications ran. The initial rollout at JPMC was for 30,000 desktops, which was a monster deployment for the time.In 2011, JPMC subsequently spun up virtual desktops to over 100,000 of its employees, backed by thousands of servers in its datacenters. This newer setup is using the latest ILIO Diskless VDI software, which has de-duplication and compression technologies. This software allows a typical two-socket X86 server with 256 GB of main memory to store somewhere on the order of 70 to 80 virtual desktops. These VDI images run in main memory and do not require slow-as-molasses disk drives. The number of virtual PCs depends on the similarity of the software on those images.JPMC did a server upgrade concurrent with moving to the ILIO Diskless VDI software, and chose the UCS C250 M2 rack servers from Cisco Systems as its platform. (Cisco is a big investor in Atlantis and which has gotten a lot of traction with VDI with the UCS iron because it is a greenfield workload at a lot of companies.) These UCS C250 M2 machines have a memory extender chip in them that allowed JPMC to cram even more virtual desktops into a server node, which topped out at 384 GB, which is 50 percent more memory than available in other two socket servers at the time. (The exact configuration of the JPMC VDI server farms is not known, but presumably it was pushed to the limit.)Atlantis has around 500,000 VDI seats worldwide running atop XenDesktop from Citrix Systems or Horizon View from VMware, with an aggregate of over 12 PB of main memory hosting those images. This base attests to the fact that Atlantis can deliver enterprise-grade software used by companies that are averse to risk. Having virtualized the desktops and put them on servers, Atlantis has the chance to virtualize other workloads in the datacenters of Bank of America, JPMC, UBS, MetLife, M&T Bank, AIG, American Express, RBS, DowJones, CIBC, and Nomura Securities, just to rattle off the big customers that Atlantis has in the financial sector using its VDI add-ons.\"Pretty much every customer that has deployed us on the desktop side has kind of played around with running server stuff on it,\" says Seth Knox, vice president of products at Atlantis. \"But we haven’t supported it and we still needed some functions such as high availability without any downtime added.\"The initial workloads that the big banks and healthcare companies want to improve with USX include the usual suspects: Microsoft's Exchange Server email server, various SQL databases, transaction processing systems, and analytics workloads. Big banks also tend to have very large application development and test environments – sometimes with storage capacity rivalling that of production systems, says Knox – and this is also what USX is aimed at.If the ILIO Diskless VDI software is about boosting the performance and management of virtual desktops while eliminating the need for storage area networks or other disk-based storage for PC images, then USX is about taking the existing storage and systems in the datacenter and cramming up to five times as many virtual machines on them just by virtualizing and pooling the storage that is already sitting there in those machines. It sounds simple enough, but it has taken years to develop.The USX stack includes in-line de-duplication, which was critical to being able to get VDI instances into main memory; most PCs running the same operating system have a lot of the same code, so you only need one copy of it even if all VDI instances are running from it. The USX stack also includes data compression and thin provisioning, two common features on storage arrays, and has a virtual controller that can coalesce and manage the I/O processing across a cluster of servers running VMware's ESXi 5.1 and 5.5 hypervisor. Knox says that Atlantis is working to support the virtualization of storage underneath the Hyper-V 3.0 hypervisor from Microsoft and the XenServer 6.2 hypervisor from Citrix Systems.What USX does is take all of the storage that is available to virtual machines, including main memory and flash inside the servers. The flash can be solid state disks, PCI-Express flash cards, or flash-based UltraDIMM memory like that being sold by SanDisk in IBM's new System X6 servers. USX doesn't care. The USX pool also includes disk arrays attached to servers or NAS or SAN arrays external to the servers on their respective networks. All of this storage is virtualized and presented to the hypervisor as pool for any applications to use. USX manages the placement of the data across those storage devices, with everything looking like an NFS or iSCSI mount point as far as applications are concerned. The USX software can even ride atop the vSAN virtual storage array from VMware if customers want to do that.Here's the problem that USX solves. Flash devices inside of servers have lots of I/O and not a lot of storage capacity. SANs typically have a lot of capacity, but they often run out of I/O and limit a workload in this manner long before capacity runs out. With this storage all being pooled and being made available to virtual machines running on the hypervisor, the flash and SAN, for instance, can be made to work together to give the application both the I/O and the capacity it needs.USX has two virtual machines equipped with virtual disk controllers, which span all the storage in the server cluster and in the storage networks attached to it. Customers can add a third one for extra redundancy. These virtual USX controllers typically have one or two virtual cores of processing capacity and somewhere between 20 GB and 30 GB of virtual memory allocated to them. For each server and its storage that you want to bring in the pool, you have to have a storage aggregation VM installed. This typically runs on a single virtual CPU and consumes 4 GB to 6 GB of capacity.\"We can create the equivalent of a Nimble Storage array in your hardware,\" says Knox, referring to one of the hot hybrid flash-disk storage vendors. \"We can create the equivalent of doing SAP HANA for any application with an in-memory data store that has services layered on top of that. And we can create the equivalent of a Pure Storage or Xtremio all-flash array, or pool a NetApp EF or an IBM FlashSystem or what have you. What you can get from this is high performance, and it will be something that is priced more like a typical commodity SAN or NAS but you get all-flash array performance.\"In an example provided by Atlantis, an existing collection of DAS, NAS, and SAN storage with 100 TB of capacity somewhere around 250,000 I/O operations per second of throughput was converted into a storage pool that had 300 TB of capacity and 800,000 IOPS of throughput.Atlantis is not providing specific pricing for USX, but says that it will be priced on a per-terabyte basis. That is not the raw capacity of the storage in your systems, by the way, but rather the effective capacity after USX does its de-duplication, thin provisioning, and compression. Pricing is the same for main, flash, or disk capacity. The pricing model, says Knox, was created with the idea of being 50 percent less costly than the storage that customers would have to buy to expand their virtual machine farms but also delivering them more performance.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/stargate-atlantis-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/atlantis-usx-block-diagram.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/atlantis-usx-performance.jpg"
    ]
}