{
    "title": "HPE Adds ‘Predictive Flash’ with Storage Deal",
    "author": "George Leopold",
    "date": "2017-03-07 00:00:00",
    "text": "Hewlett Packard Enterprise continued its headlong push into the hybrid IT market with its second large acquisition of 2017: a $1 billion deal to acquire flash specialist Nimble Storage Inc.The company (NYSE: HPE) announced Tuesday (March 7) it would pay $12.50 per share for Nimble common stock. Nimble Storage (NYSE: NMBL), San Jose, Calif., began trading publicly in December 2013. HPE also said it would assume or pay out Nimble’s unvested equity awards, values at about $200 million at closing.Completion of the deal is expected in April.HPE announced in January is acquiring hyper-converged infrastructure specialist Simplivity Corp. for $650 million in cash to expand its hybrid IT offerings. The company said the deals are designed to make it easier for customers to adopt hybrid IT infrastructure.In announcing its acquisition of Nimble Storage, the company added that Nimble’s predictive flash offerings would complement its 3PAR data storage systems. \"This deal will enable HPE to deliver a full range of superior flash storage solutions for customers across every segment,\" the company noted in a statement.HPE also said it would integrate Nimble Storage's predictive analytics platform across its current storage offerings. That tool can be used to detect and resolve customer infrastructure issues.HPE CEO Meg Whitman said the storage acquisition reflects the company's strategy of focusing on systems software and software-defined infrastructure as its targets hybrid IT. \"We’re leaning into new technology either through our own innovation, acquisitions or partnerships,\" Whitman said last year in announced the spin out of its application software unit.To that end, HPE and data preparation vendor Tamr Inc. announced a reseller partnership deal last week. Hewlett Packard Pathfinder was an early investor in Tamr, an MIT spinoff.The storage acquisition would help fill out HPE's flash storage portfolio while adding cloud-based predictive analytics used to tweak hybrid IT infrastructure. The combination of Nimble Storage and 3PAR expands the company's flash storage options while providing \"more effective on-premises control and performance, at public cloud economics,\" asserted Antonio Neri, general manager of HPE's Enterprise Group.As it sharpens its focus on hybrid IT, HPE said the storage deal would allow it to offer platforms for moving data and replicating it across hybrid and all-flash storage. \"As flash becomes the new normal, customers are driving additional requirements, like hybrid IT automation, integrated data protection and flexible consumption models,\" Neri noted in a blog post announcing the storage deal.The predictive flash capability also fills out HPE's storage portfolio that includes an \"all-flash datacenter\" capability along with hyper-converged infrastructure bolstered by HPE's earlier acquisition of Simplivity.Nimble Storage announced an alliance with Lenovo (HKG: 0992) in October 2016. Lenovo said in a statement that partnership was in its \"early stages\" and this week's acquisition would have little impact on its storage portfolio. Lenovo added it plans to unveil new flash storage products later this year.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_acquisition-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}