{
    "title": "SanDisk Gets Deeper Into Enterprises With Fusion-io Deal",
    "author": "Timothy Prickett Morgan",
    "date": "2014-06-16 00:00:00",
    "text": "SanDisk may have become a player in flash storage through the consumer market, but it has been making headway in the past couple years establishing itself as a key supplier of flash technologies to enterprises. With its $1.1 billion deal to acquire Fusion-io, SanDisk is completing its product set and also getting its hands on a large reseller channel and patent portfolio that it will be able to leverage in years to come.Fusion-io is one of the key suppliers of PCI-Express flash cards for servers and has Facebook and Apple as its marquee customers, and in years gone by these two companies have accounted for more than half of the company’s revenues as they deploy server-embedded flash to accelerate database and other workloads. In addition to the key hyperscale datacenter operators, Fusion-io has hundreds of reseller partners that have deployed the ioMemory cards in products at over 7,000 customers worldwide. Fusion-io has just released its latest generation of ioMemory cards, called the Atomic series, which were designed to span up to 6.4 TB in a single card and which have variants aimed at SMB, enterprise, and hyperscale customers. All three have different capacity needs, different mixes of reads and writes, and, as you might expect, different price points. SanDisk is picking up Fusion-io after it has gone through the process of developing and launching its latest products, and interestingly, after SanDisk and its partner Diablo Technologies have caused a bit of creative disruption by bringing memory channel storage to market.With memory channel storage, which has started shipping in IBM’s System x X6 server line and which is also known as UlltraDIMM memory, flash memory is put on a module that plugs into the memory slots of a server, bringing it even closer to the processor than a PCI-Express card. The UlltraDIMMs come in 200 GB and 400 GB capacities and they make use of flash memory chips manufactured under a partnership between SanDisk and Toshiba, which share a flash fab. The modules make use of a converter chip created by Diablo Technologies, which allows for the SATA connector on the flash chips to be converted to the signaling used by DDR3 memory modules.The fit between Fusion-io and SanDisk is a good one. Fusion-io has its core PCI-Express flash card business as well as shared external flash storage appliances based on its ioMemory cards, called the ION Accelerator. Fusion-io does not make its own flash memory and does not make flash drives that slide into the same form factors as disk drives and use the same electrical connections that disk drives use. SanDisk has a flash card business but admitted to EnterpriseTech back in March that it was between generations on these products and was “still finding the right solution given the evolving market.”It looks like SanDisk has come up with the right solution as far as its management is concerned, and that is to acquire Fusion-io and take over an ongoing and large PCI-Express flash card business. SanDisk has been on an acquisition tear in the past few years as it pushes its way into enterprise datacenters. It acquired Smart Storage back in July 2013 for $307 million, which gave the company the memory channel storage and its entry Optimus flash-based SSDs. These Optimus SSDs as well as the popular Lightning SSDs commonly used in disk, flash, and hybrid arrays, were both updated back in May and are based on the 19 nanometer enterprise multi-level cell (eMLC) flash chips coming out of the SanDisk-Toshiba foundry in Japan. It is not when SanDisk might deploy its own flash chips on future Fusion-io cards, but it has plans to do so. Samsung Electronics currently supplies flash memory chips to Fusion-io.The competition is heating up in flash storage. SK Hynix just bought Violin Memory’s Velocity PCI-Express card business for $23.5 million and Seagate Technology has just bought the SandForce PCI-Express card business from Avago Technologies (and originally created by LSI Logic) for $450 million. Seagate said that it expects for the Avago flash card line to generate about $150 million in its fiscal 2015, which will end in June 2015, and be moderately accretive to the company’s earnings. In its most recent full financial year, which ended in December, Fusion-io posted revenues of $432.4 million, but lost $38.2 million. SanDisk has offered to buy Fusion-io for $11.25 billion in cash, which works out to about $1.1 billion and is nearly three times revenue. This is roughly the same multiple that Seagate just paid for the LSI Nytro PCI-Express flash card business that Avago got through its $6.6 billion acquisition of LSI that closed in May this year.Wall Street probably thinks that SanDisk should pay more for Fusion-io, with the offered price being only 21 percent higher than the close of Fusion-io’s shares last Friday. Fusion-io went public in June 2011 and soon after going public its shares peaked at three times the level that SanDisk is offering to pay. But Fusion-io has its share of competition these days, and while its business outside of Apple and Facebook has been growing at a compound annual growth rate of 122 percent between 2009 and 2013, it is still heavily dependent on those two key accounts for a little less than half of its sales. By shifting to SanDisk flash chips in future products, SanDisk can in theory cut back on costs for the Fusion-io cards and external arrays and get the company on the path to sustainable profitability.SanDisk had $6.17 billion in revenues in 2013 and brought a little more than $1 billion to its bottom line. The company had around $6.3 billion in cash in the bank prior to announcing the Fusion-io deal, which it hopes to close in the third quarter. If a competitive bid for Fusion-io materializes – and there is no indication that there will be and there are few obvious such suitors given all of the other acquisitions that have been done in recent months – SanDisk will be able to pay more for the company.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/fusion-io-flash-logo-370x235.jpg"
    ]
}