{
    "title": "NetApp Gives A Sneak Peek At Future FlashRays",
    "author": "Timothy Prickett Morgan",
    "date": "2014-09-17 00:00:00",
    "text": "After several years of development, storage array maker NetApp is starting to ship its FlashRay family of all-flash arrays to selected customers and partners and is looking to ramp up production as quickly as possible in 2015.With the FlashRay line, NetApp now has three different styles of all-flash arrays, all aimed at different customer use cases and price points. The company obviously believes that it needs a diverse product line to compete against a slew of all-flash array upstarts, who are having their pockets stuffed with cash and who are keen on taking aim at all of the disk array incumbents.The FlashRays are coming to market later than expected – they were first talked about publicly in February 2013, with limited beta testing expected in the middle of 2013 and shipments in 2014. NetApp has not said what caused the delay, but designing a new set of FlashRay controllers and the Mars OS to make better use of flash is not trivial, as the development time for all of the flash array startups attests to. It took all the upstarts years to do this. The storage market is large and all-flash arrays have not even begun to dent the tier one storage (accounting for about $15 billion in revenues annually) where disks still reign supreme and perhaps have seen their peak. This is certainly the case where I/O performance matters more than cheap capacity.Flash started coming onto the enterprise storage scene a few years back, just about the time that NetApp acquired the Engenio disk array business from LSI Logic and sold them as the E Series arrays. Back in February 2013, NetApp launched an all-flash variant in this line, the EF540, and last November updated that with the EF550, which uses 800 GB \"Lightning\" solid state drives from SanDisk as its storage. The EF550 now supports 1.6 TB drives and has a sustained I/O rate of over 450,000 I/O operations per second (IOPS) and delivers a sustained throughput of over 12 GB/sec. The controller chassis holds 24 drives, and you can attach another four shelves for a total of 120 drives and 192TB of raw capacity. The EF550 links to systems through 16 Gb/sec Fibre Channel, 6 Gb/sec SAS, 10 Gb/sec iSCSI, and 40 Gb/sec InfiniBand ports and is based on the SANtricity storage operating system, which has features such as snapshotting, thin provisioning, and remote mirroring, but which does not have data deduplication or compression and which cannot have their controllers clustered to scale out the performance of the arrays.For this, NetApp has the all-flash versions of the FAS8000 series arrays, which run its flagship Data ONTAP operating system. These do have data compression and deduplication, and with the clustered Data ONTAP software, up to a dozen dual-controller FAS8000 arrays can be linked together. Customers can mix and match all-disk, all-flash, and hybrid arrays in these FAS clusters, moving data to the most appropriate part of the cluster.In NetApp's first quarter of fiscal 2015, shipments of all-flash versions of the EF and FAS series machines rose by 48 percent and the capacity shipped in devices more than doubled. Across all of its lines, NetApp has shipped over 100 PB of flash capacity and has shipped more than 30 PB in the past two quarters alone, with over 35,000 hybrid systems and over 1,500 all-flash systems shipped. NetApp is a contender in the all-flash market and what it has really needed is inline deduplication and compression to match the features of the all-flash upstarts. It has also needed to shift from enterprise multilevel cell (eMLC) flash memory to consumer MLC, which is cheaper and which allows it to lower the cost of a unit of effective capacity on its all-flash units.With the FlashRay hardware and its Mars OS, NetApp is starting with Xeon-based storage controllers, just like with the FAS arrays and just about every other all-flash array controller on the market today. The specific Xeon configuration was not revealed, but to do inline data deduplication and compression at wirespeed (instead of doing it after data has been stored as is the case with the Data ONTAP operating system) takes a lot of computing oomph. So we presume it is a pretty hefty two-socket Xeon controller.The initial FlashRay machines have a single controller, but a second can be added to scale out its performance and presumably to also offer redundancy where customers want it. NetApp tells EnterpriseTech that it will eventually allow clustering like the FAS arrays do. The specific interconnect and software for this FlashRay clustering feature was not divulged, but it stands to reason that it is not simply a ported version of clustered Data ONTAP. The Mars OS has optimizations for the very different Variable Length Block Layout (VLBL) approach that was created to minimize the I/O activity hitting the flash and to deliver sub-millisecond response times for I/O as well as to work with the inline dedupe and compression to boost the effective capacity of the flash by as much as 20X. (Data ONTAP uses the Write Anywhere File Layout, or WAFL, which is a kind of a hybrid between a file systems and a volume and a block manager and which is the key innovation that made NetApp the dominant force in network attached storage.) Anyway, customers will be able to add a second controller to scale up and then more controllers to scale out, and everything will look like a single large \"container,\" as NetApp put it.Data is protected on the FlashRay arrays using a proprietary, flash-optimized, dual-parity RAID algorithm that NetApp cooked up, and the company is shifting to cMLC to lower the cost of its flash as it must. The initial FlashRay device will have 11.5 TB of raw capacity and 7.86 TB of usable capacity, and NetApp says that effective capacity will vary depending on the data compression and deduplication rates on top of that. The company did not provide any guidance on that front. To keep pace with Pure Storage, the upstart in this all-flash array market, NetApp has to offer data reductions of between 2X and 10X. Pure Storage sees compression of between 4X and 6X on virtual servers, 5X to 10X on virtual desktops, and 2X to 4X on relational databases. Over time, the Mars OS will be integrated with the Data ONTAP operating system so that data can be moved back and forth between the FlashRays and FAS arrays seamlessly and the same management tools (such as OnCommand Insight) that FAS customers are used to can be employed with the FlashRays.The FlashRay arrays will hook to servers through 16 Gb/sec Fibre Channel ports initially, but obviously a full set of links will be provided for customers using multiple network protocols. The device does not use PCI-Express flash cards (like the FAS arrays do for some caching), but has SAS-based SSDs that link to the controller through 6 Gb/sec SAS links.In a single node configuration, the FlashRay will deliver 250,000 IOPS on 8 KB files with a 500 microsecond latency; it will deliver 8 GB/sec of sustained bandwidth on large-block I/O. That positions the performance of the FlashRays somewhere between the EF Series and the FAS all-flash configurations. The EF Series will remain the price/performance leaders because they do not include data reduction capabilities and are focused on the lowest possible latency. Presumably NetApp can charge a premium for the inline deduplication and compression in the FlashRays, but maybe not given the intense competition from Violin Memory, Pure Storage, Kaminario, Cisco Systems, SolidFire, IBM, Hewlett-Packard, Hitachi, and a handful of others.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/netapp-flashray-370x288.jpg"
    ]
}