{
    "title": "Facebook Expected to Move WhatsApp Off IBM SoftLayer",
    "author": "George Leopold",
    "date": "2017-06-15 00:00:00",
    "text": "In a potential blow to IBM’s efforts to carve out a major share of the intensely competitive public cloud services market, Facebook is reportedly in the process of moving its chat platform off IBM's SoftLayer cloud.Cable network CNBC cited a source \"close to the company\" as saying Facebook (NASDAQ: FB) intends shift its WhatsApp messaging service into its own datacenters. That move runs counter to the prevailing enterprise trend toward moving more workloads to the cloud.When the shift occurs, it would deprive IBM (NYSE: IBM) of a major customer for its public cloud service that lags behind market leaders Amazon Web Services (NASDAQ: AMZN) and Microsoft Azure (NASDAQ: MSFT).Facebook acquired WhatsApp in February 2014 for a hefty $19 billion. The chat service has attracted more than 1 billion users. Unlike earlier acquisitions that were quickly moved in-house, Facebook has so far left the chat service running on SoftLayer. The social media giant was reportedly spending about $2 million a month to run WhatsApp on IBM public cloud services.CNBC also reported that Facebook could begin running WhatsApp on in-house serve as early as later this year.In a statement responding to the June 7 report, IBM said WhatsApp \"used our global footprint and capabilities to scale their business.\" IBM added, \"It is completely natural for Facebook to seek synergies across their business.\"WhatsApp reportedly ran on more than 700 SoftLayer bare-metal servers in datacenters based on the Washington, DC, area and San Jose, Calif. (IBM acquired SoftLayer in 2013.)According to reports, Facebook held off on bringing WhatsApp in-house since it was already in the process of integrating other major acquisitions such as the Instagram photo-sharing application purchased in 2012.While WhatsApp is a major SoftLayer customer, it was unclear precisely how much it provided IBM in terms of revenue. The company discounted reports that WhatsApp was among its top five public cloud customers.Facebook did not respond to a request for comment.The expected loss of WhatsApp comes as IBM SoftLayer is attempting to differentiate itself in the ongoing public cloud price wars. Market analyst 451 Research reported in April that IBM opened a new front late last year by cutting prices for object storage on SoftLayer. Rivals Amazon Web Services, Google (NASDAQ: GOOGL) and Microsoft responded in kind, prompting the market watcher to predict that prices for virtual machines—long the focus of cloud price wars—will continue to decline along with object storage.\"This is the first time there has been a big price war outside compute, and it reflects object storage’s move into the mainstream,\" the market researcher noted.IBM SoftLayer along with rivals Google Cloud Platform and Microsoft Azure together are estimated to account for about 24 percent of the public cloud market, according to another cloud tracker, Synergy Research Group.-Doug Black contributed to this report.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-15-at-12.07.48-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}