{
    "title": "At GTC: Nvidia Expands Scope of Its AI and Data Center Ecosystem",
    "author": "Doug Black",
    "date": "2019-03-19 00:00:00",
    "text": "In the high-stakes race to provide the AI life-cycle solution of choice, three of the biggest horses in the field are IBM, Intel and Nvidia. While the latter is only a fraction of the size of its two bigger rivals, and has been in business for only a fraction of the time, Nvidia continues to impress with an expanding array of new GPU-based hardware, software, robotics, partnerships and – with its purchase last week of Mellanox – acquired technologies. On opening day of Nvidia’s 10th annual GPU Technology Conference in San Jose, company founder and CEO Jensen Huang offered up a densely packed two-and-half hour keynote in which he surveyed the landscape of his company’s datacenter, data science, AI and robotics portfolio.Echoing the often-heard statement that “AI is the new HPC workload,” Huang began his address by highlighting Nvidia GPU’s role within the world’s two most powerful supercomputers, IBM’s Summit and Sierra systems, along with many other of the 500 most powerful HPC systems – against the backdrop of the acquisition of Mellanox, maker of high-speed network gear also used in most of the Top500 supercomputers.“Accelerated computing is not just about the chips,” Huang said. “Accelerated computing is a collaboration, a codesign, a continuous optimization between the architecture of the chip, the systems, the algorithm and the application.”Backing up this sentiment, Nvidia and Huang announced that major server vendors (Cisco, Dell EMC, Fujitsu, HPE, Inspur, Lenovo and Sugon) now offer Nvidia T4 GPU servers for data analytics, machine learning and deep learning.Integrated into the servers is Nvidia’s new data science acceleration software, CUDA-X AI, also announced during Huang’s keynote, which the company said “unlocks the flexibility of our Nvidia Tensor Core GPUs (including Volta and the Titan V series) to uniquely address this end-to-end AI pipeline.” Adopted by PayPal, SAS, Walmart and Microsoft, the CUDA-X AI acceleration libraries can speed up machine learning and data science workloads by up to 50x, according to Nvidia.Nvidia said the T4 servers are designed to fit into existing datacenter infrastructures while accelerating AI training and inference, machine learning, data analytics and virtual desktops.Of the T4 GPU processor used in the new servers, Huang said, “It literally draws only 70 watts, it’s the size of a candy bar, it fits into every single of the high volume most popular dataccenter servers in the world, it can fit in a blade, it fits in a hyperscale server, it fits in an enterprise datacenter server. Four T4s gives you about 260 teraflops of FP16 (65 teraflops per processor), so it’s a supercomputer, essentially, and it comes with Mellanox or Broadcom Ethernet NICs.”In addition, Nvidia said the systems are NGC (Nvidia GPU Cloud)-Ready validated, which means they have “demonstrated ability to excel in a full range of accelerated workloads.” NGC offers a repository of GPU-accelerated software, pre-trained AI models, model training for data analytics, machine learning, deep learning and high performance computing accelerated by CUDA-X AI, according to the company.“As more enterprises begin to institute artificial intelligence into their business operations, the need for dense servers equipped with versatile GPU accelerators continues to grow,” said Madhu Matta, VP/GM of HPC/AI, Lenovo Data Center Group. He said the Lenovo ThinkSystem SR670 supports up to eight Nvidia T4 GPUs in 2U.Nvidia also announced the RTX blade servers, designed for rendering, remote workstation, and cloud gaming. The company said servers, which include optimized software stacks, “deliver cinematic-quality graphics enhanced by ray tracing for far less than just the cost of electricity for a CPU-based rendering cluster with the same performance.”The RTX server is comprised of 40 GPUs in an 8U space and can be shared by multiple users with Nvidia’s GRID vGaming or container software. Nvidia RTX pods encase up to 32 servers within 10 racks for total of 1,280 GPUs. Connected with Mellanox InfiniBand, RTX pods support up to 10,000 concurrent gamers. Dell EMC, HPE, Lenovo, ASUS and Supermicro have unveiled RTX servers.“We are enabling content producers to create more visually-rich graphics and renderings faster than ever before,” said Bill Mannel, VP/GM of HPC and AI Group, Hybrid IT, at HPE. “With the HPE Apollo 6500 Gen10, HPE ProLiant DL380 Gen10 and HPE ProLiant ML350 Gen10, we will offer the RTX server to provide designers with GPU-accelerated power and performance for the most efficient end-to-end rendering solutions, from interactive sessions on the desktop to final batch rendering in the datacenter.”Nvidia also launched, in concert with HPE, Dell EMC and Lenovo, a line of high-performance workstations it says are purpose-built to help data scientists prepare, process and analyze the massive amounts of data used in finance, insurance, retail, professional services and other industries.The workstations are based on a reference architecture made up of dual Nvidia Quadro RTX GPUs and Nvidia CUDA-X AI data science software is a collection of libraries, such as RAPIDS, TensorFlow, PyTorch and Caffe, designed to enable higher performance of applications using Nvidia GPUs.The workstations are powered by the Nvidia Turing GPU architecture and designed for enterprise deployment. Dual Quadro RTX 8000 and 6000 GPUs deliver up to 260 teraflops of compute performance and 96GB of memory using Nvidia NVLink interconnect technology, according to the company.Finally, Nvidia announced Jetson Nano, a $99, palm-sized CUDA-X AI computer (akin to a Raspberry Pi single-board computer) with 472 gigaflops of performance used to create intelligent systems, including robots, drones, digital assistants and automated appliances.Designed for makers, developers, inventors and students, Nvidia said Jetson Nano supports high-resolution sensors, can process many sensors in parallel and can run multiple modern neural networks on each sensor stream. It joins the Jetson product lineup, which includes Jetson AGX Xavier for autonomous machines and Jetson TX2 for AI at the edge.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/Nvidia-GTC19-Jensen-Keynote-1-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/GTC19-keynote-Nvidia-CUDA-X-AI-ecosystem-800x-300x173.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/GTC19-keynote-photo-Jetson-Nano-700x-300x147.jpg"
    ]
}