{
    "title": "Panasas Rolls Out ActiveStor 18",
    "author": "no author",
    "date": "2015-07-09 00:00:00",
    "text": "Hybrid scale-out NAS specialist Panasas today introduced ActiveStor 18, the latest in its ActiveStor appliance line. According to the company, the new appliance features a 33 percent increase in density, is available in 4TB and 8TB hard drive configurations, and delivers 20PB and 200GB/s scalability. The product will ship in September.“We’re now using Western Digital HGST He8 technology – a seven platter, helium filled design. This is also our first generation of ActiveStor with the file system support necessary to leverage 4KB native sector support,” said Geoffrey Noer, Panasas vicep president of product management. The amount of cache per storage blade also doubled. (Specs snapshot below)Panasas has mainly served HPC workflows with strength in traditional technical computing markets such as oil and gas, government and manufacturing. The new release continues that focus but also supports the company's new thrust into media and entertainment, which Panasas says is a market in transition and increasingly turning to HPC technologies. Company literature indicates ActiveStor 18 is well suited for mixed workloads: large file throughput, IOPS performance and lowest cost per TB.Of note, Panasas is one of the few storage vendors sticking with its proprietary storage operating system, PanFS, which the company considers an important differentiator: By closely integrating PanFS with the hardware, “You substantially improve reliability, manageability and performance. PanFS provides a single global namespace for simplified storage management,” said Noer. That said, three protocols are supported, Panasas DirectFlow, NFS (Linux), and SMB (Windows).The most important differentiator may be the Panasas two-blade hybrid architecture and DirectFlow protocol. “We have a storage blade and a director blade. The storage blade scales the amount of storage capacity and throughput performance; the director blades are responsible for metadata, small files, and transactional type of performance. Both of those resources scales you scale the system,” said Noer. Separating the two functions (main storage and metadata handling) reduces the need to frequently interrupt the storage blade and boosts throughput performance.In typical HPC workflows, said Noer, 60 to 80 percent of all of the files by count are smaller than 64 kilobytes, they’re very small files, but all of those small files take up less than one percent of the file systems’ capacity.Also included on the appliance is PanFS RAID 6+, first introduced last summer by Panasas. PanFS RAID6+ is an intelligent per-file distributed RAID architecture implemented with erasure codes in software instead of traditional hardware RAID controllers. “Rebuilding drives was starting to be a problem even at 1TB or 2TB hard drives. Now with 6TB and 8TB drives you can be looking at upwards of a week or certainly days to do a rebuild in that sort of an environment with hardware RAID.”“If you approach things very differently [as in RAID 6+] and protect the files instead of the blocks of hard drives you can limit the rebuilds to only the work that absolutely has to be done. So if we have a clump of bad sectors for example we only have to rebuild the files that touched the bad sectors, we don’t have to rebuild the entire storage,” said Noer. “If the whole hard drive actually dies, again we don’t have to rebuild the unused capacity, we only rebuild the files that were affected by that drive and avoiding rebuilds means not having to bring the performance of the systems down unnecessarily.”Interest in RAID 6+ is growing according to a recent survey of 90 Panasas ActiveStor users in which 62 percent reported RAID 6+ will be important and 16% characterized it as critical. “About the only place RAID 6+ is not so valuable is in a very pure HPC scratch environment where the data is temporary and can easily be regenerated,” Noer said.Snapshot of ActiveStor 18 features:Though at home in HPC, Panasas has begun looking towards broader enterprise opportunities. Media and entertainment is the first.“That segment has already gone from standard resolution to HD and now a lot of filming is being done in 4K resolution and media is being distributed in more formats. There’s mounting pressure on data storage they are staring to consider scale out solutions over older SAN technology,” said Noer.   George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/red-hat-storage-server-logo-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}