{
    "title": "Rackspace is Latest to Roll Bare Metal Service",
    "text": "Rackspace is expanding it managed private cloud services with the addition of six new bare metal instances that it collectively refers to as bare metal as a service.The private cloud vendor announced the new managed hosting service this week that combines increasingly popular consumption pricing model along with “on-demand” infrastructure. The combination would allow users to provision infrastructure “in minutes rather than hours,” the company claimed.In a twist on cloud-based serverless computing, Rackspace is touting its managed hosting service as a way to ease the migration of workloads out of enterprise datacenters. The combination of on-demand hardware and pay-as-you-go pricing is designed to attract customers looking to save money while still getting the performance and availability of dedicated but expensive infrastructure.The new service follows an announcement last November that Rackspace was partnering with Hewlett Packard Enterprise (NYSE: HPE) to offer metered private cloud services. The partners predicted the consumption model would remove barriers to private cloud adoption, particularly OpenStack deployments.Along with the ability to scale resources to avoid the cost of additional fixed—often unused—capacity, the new bare metal instances include on-demand provisioning along with access to APIs designed to automate infrastructure purchases, consumption and management.San Antonio-based Rackspace also said its bare metal infrastructure leverages GPUs and NVMe storage for workloads ranging from application containers and micro-services to databases that are quickly becoming a priority workload for analytics applications. Further, the bare metal service combined with high-end networking could serve as the foundation for scalable private clouds that use local and external computing and storage.As more users adopt managed services as an alternative to maintaining their own datacenters, Rackspace and other IT vendors also emphasize the so-called “lift and shift” challenges of moving from private datacenters. Hence, the bare metal portfolio is positioned as easing the migration of broad class of legacy applications without having to rewrite them. The service also permits the use of existing load balancing and network security platforms, Rackspace said.The bare metal cloud service segment is booming as enterprise users dedicate instances to multiple databases on a single server to minimize idle capacity while speeding access to customer and other data. Hence, some analysts forecast the market will grow to more than $4.7 billion by 2021.Rackspace’s bare metal service is the latest offering from a competitive market that includes IBM (NYSE: IBM), Oracle (NYSE: ORCL)and others. Last July, IBM introduced new bare metal servers based on Intel Xeon Scalable (codenamed “Purley”) processors running on the IBM cloud.Rackspace countered last fall with the acquisition of Datapipe, a provider of bare-metal and managed services across public and private clouds.The new bare metal service “brings much needed flexibility to managed hosting such as on-demand provisioning and utility pricing while retaining its strongest features: predictable performance and reliability,” said Henry Tran, head of Rackspace’s managed hosting unit.Early access to the Rackspace bare metal service is available here.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-04-26 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "Backspace",
        "bare metal",
        "cloud",
        "databases",
        "Datapipe",
        "HPE",
        "IBM",
        "private cloud"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/backspace/",
        "https://www.enterpriseai.news/tag/bare-metal/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/databases/",
        "https://www.enterpriseai.news/tag/datapipe/",
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/ibm/",
        "https://www.enterpriseai.news/tag/private-cloud/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/bare-metal-cloud-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}