{
    "title": "Spectra Logic Aims TS1140 Drive at Enterprise Libraries",
    "author": "Timothy Prickett Morgan",
    "date": "2013-11-29 00:00:00",
    "text": "Tape may seem retro to a lot of people, but it is still the cheapest way to store huge amounts of data for the least amount of money. The Linear Tape Open (LTO) tape drive format, which has been around for thirteen years now, has increased its capacity by a factor of 25 since it was first introduced in 2000, but some customers need faster drives and fatter cartridges than the current LTO-6.So Spectra Logic is taking the TS1140 tape drive from IBM, which uses a linear serpentine recording format that is faster than LTO-6 and which allows for more data to be packed onto a slice of tape, and putting it into its midrange tape libraries. Spectra says customers in the financial services, life sciences, oil and gas industries are showing early interest in the IBM drive.The LTO-6 cartridge has a native capacity of 2.5 TB and with 2.5 to 1 data compression can pack 6.25 TB of data on the tape. The tape has a 160 MB/sec sustained data rate, and compression boosts that to 400 MB/sec. The TS1140 drive created by IBM, which Big Blue uses in its own libraries as well as reselling to Spectra, has a 4 TB native format that jumps to 12 TB with compression on; it offers up to 250 MB/sec sustained data rates and with compression that jumps to 650 MB/sec. (The compression imposes some overhead on throughput, which is why the data rate doesn't increase to 750 MB/sec.)Up until now, the TS1140 drives have only been available as an option on Spectra's high-end T-Finity libraries, which is a truly immense machine. A T-Finity frame can have as many as 24 tape drives and multiple robots that fetch tapes from storage shelves inside the library; each frame has room for 920 cartridges with a dozen drives or 800 cartridges with 24 drives. The T-Finity scales up to 40 frames and up to 120 drives for a maximum of 50,100 cartridges. That yields a total storage capacity of 125 PB of uncompressed data using LTO-6 drives. Assuming 2.5 to 1 data compression, that T-Finity could house 313 PB of data. With a TS1140 drive, a T-Finity has only 38,115 cartridge slots with 120 drives, but it can house 153 PB of data uncompressed on those tapes, and with 3 to 1 compression, the same T-Finity can hold 457 PB of data.Not only does the TS1140 drive allow for more data to be stored in the same space compared to a library using LTO-6 drives, but the throughput for the TS1140 is higher. With compression turned on and running against a typical set of data that is amenable to such compression, a T-Finity library can push or pull 172 TB/hour of data using LTO-6 drives, but this jumps to 281 TB/hour with a set of TS1140 drives. With compression, the TS1140 has a 46 percent capacity advantage across the T-Finity library fully loaded with drives, and can push 63 percent higher throughput, too.This kind of speed and capacity advantage is what many enterprises are looking for, Molly Rector, executive vice president of product management at Spectra, tells EnterpriseTech. But most companies do not need a T-Finity beast, and in fact, they are more interested in getting the most capacity and throughput into the smallest space possible.\"While LTO is about 96 percent of the market, it is not growing capacity as fast as the IBM TS and Oracle STK drives,\" says Rector. \"We have TS cartridges that are twice the capacity of LTO and it will be three times by next year. Customers that have big files have had to go with LTO for cost reasons, but when you are storing petabytes of data, you sometimes want more density. Not having the TS drives for our enterprise customers is like saying that 6 TB drives are only available for HPC environments.\"So starting next month, Spectra will make the TS1140 drive available in its T950 enterprise-class library and in the first quarter of next year it will drop it into the T380 midrange library. The T950 has the same speeds and feeds as the T-Finity on a per-frame basis and expands up to eight frames in a single library. The T380 is a much smaller library, taking up only 28U in a standard rack, and has from 50 to 380 cartridges. With LTO-6 drives, that yields 950 TB uncompressed and 2.4 PB compressed, and with the TS1140 drives, this will boost to 1.52 PB uncompressed and 4.56 PB compressed with a substantial boost in throughput. While the TS1140 drive costs more than LTO-6 drive, if you look at it on a cost per capacity or cost per throughput basis – as customers in confined spaces or with the need for speed will – then it is fairly easy to justify using the more expensive TS1140 drive.The typical object store at an enterprise customer is on the order of between 1 PB and 3 PB, says Rector, and at chip manufacturers their files tend to be on the order of 1 PB to 2 PB.The cost differential between libraries using the LTO-6 and TS1140 drives has come down a lot over the past several years, says Rector. \"It used to be a factor of two premium for both the tape drives and the media,\" she explains. \"Now, on average it is between 5 and 10 percent more expensive for a TS setup, but you also have more data in a smaller footprint. And if you take that into account, it is better than breakeven.\"Spectra resells Oracle's STK T10000C tape drives as well, and it is reasonable to assume that at some point this drive, which competes against the TS1140, will also be added to the T380 and T950 units. Rector was unable to comment on such plans at this time. The T10000C has a native capacity of 5 TB with a 252 MB/sec sustained data rate; it punches up to 360 MB/sec with compression turned on.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/11/spectra-logic-t380.jpg"
    ]
}