{
    "title": "At ISC19: HPC on Pace for 5-Year 6.8% CAGR; Guess Which Hyperscaler Spent $10B+ on IT Last Year?",
    "author": "Doug Black",
    "date": "2019-06-20 00:00:00",
    "text": "In the neck-and-neck horse race for HPC server market share, HPE has hung on to a slim, shrinking lead over Dell EMC – but if server and storage market shares are combined, Dell EMC has taken a three-plus point lead (29.8 vs 26.5 percent), according to analyst firm Intersect360 Research’s latest HPC market update.Overall, the HPC industry grew by 3.2 percent YoY to $36 billion in 2018, according to the firm, driven by the enterprise sector, now comprising 58 percent of the market, and by the server product category, which captured 35 percent of HPC spending and grew by 9.1 percent.Growth was weighted toward the higher end of the market, with supercomputing-class systems (above $1.5 million expenditures) outpacing all categories, and entry-level systems (under $50,000) trailing. Cloud HPC grew 16 percent to more than $1.2 billion and HPC storage rose by slightly more than 1 percent to $5.7 billion.Countering scattered concerns of another AI winter, Intersect360 reported that $8 billion was spent on machine learning 2018, a whopping 90 percent by hyperscale companies. Within HPC markets, most advanced AI use cases were in the financial services industry, while 56 percent of HPC organizations are running machine learning – usually with the same hardware as HPC but often with configuration changes (i.e., GPUs). “AI workloads are sweeping through all types of enterprises and research, which is affecting both the HPC and Hyperscale markets. In HPC, we’re seeing not only a measurable effect on top-line budget expectations, but also different technology choices being made to accommodate machine learning workloads.”“The growth (in HPC) was concentrated in the server market…,” said Addison Snell, Intersect360 Research CEO during a presentation on the floor of the ISC High Performance conference in Frankfurt yesterday. “What that means is people were buying heavier nodes – in this case the biggest effect came from machine learning, with people configuring in more GPUs as part of their server nodes, which made the node relatively more expensive. We also saw storage components getting pulled back into the server, mostly in the form of flash... Now storage is coming back into the node again, but instead of with spinning disk, we see it with flash and NVME components.”Looking ahead, Intersect360 foresees an HPC market CAGR of 6.8 percent over the next five years, surpassing $50 billion in 2023, “based on strong market fundamentals and increases in machine learning and analytics workloads.”Some of Intersect360’s most interesting findings were in the hyperscale sector, which the firm places in a different category from HPC. Overall, the hyperscale market grew by 30 percent last year to $57 billion, with 11 tier 1 hyperscalers spending more than $1 billion each on IT infrastructure and comprising 81 percent of all hyperscale spending – with one of them, which Snell declined to name, breaking through the $10 billion barrier for IT spending in a single year. In fact, Snell said, that company spent “well over” $10 billion.“If you think people (vendors) are paying attention to hyperscale companies ahead of, say, HPC, consider that a large supercomputer costs on the order of $100 million or more,” Snell said, “but there are 11 companies that spent more than $1 billion on hyperscale infrastructure in one year, so that’s an order of magnitude greater. So if you get one of those companies, that’s a lot of chips or NICs that you sell.”Looking at HPC revenues by verticals, Intersect360 found that commercial sectors now total 58 percent of the market, led by financial services at 13 percent followed by large product manufacturing and bio-sciences, both at 8 percent, and energy, consumer product manufacturing and retail, each at 5 percent.On the research, or “traditional HPC,” side of the industry, Intersect360 said the academic/not-for-profit sector had 17 percent of HPC market last year, followed by national security at 11 percent and national research labs at 10 percent.As for HPC server market shares, Dell EMC continues to close on HPE’s lead, now less than a percentage point, Snell said. He added that HPC servers are selling well relative to the rest of HPE server products. “This is actually about the highest pull through HPE has ever gotten as a proportion of their entire server business,” said Snell, noting that HPE has lost business in the hyperscale sector, including servers sold to Microsoft Azure.”Based on Intersect360 survey results, the “top named” system suppliers for 2018 were HPE, Dell EMC and Lenovo, accounting for 43 percent share of all mentions, with HPE continuing to account for about one-third of the reported installations, Snell said. Supermicro continues to gain share, according to Intersect360, with 5.2 percent of the systems reported, up from 4.4 percent the previous year.HPE's recent acquisition of Cray will add to HPE's server market share (though Snell said that, according to his latest research, when server and storage market shares are combined, Dell would remain ahead of HPE combined with Cray).\"The HPE-Cray deal puts together two powerhouses in high-performance computing,\" Snell said. \"In 2018, HPE was the market leader for worldwide HPC server revenue for the sixth consecutive year. Meanwhile Cray had the greatest percentage growth in the same category from 2017 to 2018, in addition to its massive exascale wins looking forward. The combination will add to HPE’s position in market revenue while establishing HPE as an elite provider at the apex of the supercomputing market.\"Among storage system suppliers, Snell said DDN, Dell EMC and HPEs’ share of reported storage systems, based on its HPC site census survey, increased slightly from 2017. He said 49 of all active storage systems have 1 petabyte or more of storage capacity.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/ISC19-Snell-Server-share-feature-image-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/ISC19-Snell.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/ISC19-Snell-Server-market-share.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/ISC19-Snell-HPC-market-sectors.png"
    ]
}