{
    "title": "Storage Study Warns of Growing ‘Databergs’",
    "author": "George Leopold",
    "date": "2016-03-15 00:00:00",
    "text": "The ability to sweep up, store and organize vast amounts of data, then turn the connections among data points into insights and strategies is creating new revenue streams for enterprises. But what happens when stored data reaches its freshness \"expiration date\"?As more enterprises look to get a handle on storage and other costs via virtualization and a shift to hybrid cloud architectures, many are finding that much of the data they are storing is \"dark,\" or lacking in known value. Worse, a study released this week by information management vendor Veritas Technologies found that one-third of stored data was considered \"redundant, obsolete and trivial,\" or ROT.The result, the company argues, are \"databergs\" characterized by a relatively small amount of data deemed \"business critical\" while the remainder is \"dark\" or ROT data below the metaphorical surface. Moreover, the study found that U.S. companies tend to have the highest rates of dark data.Veritas, Mountain View, Calif., said it surveyed more than 2,500 IT executives. The study found that more than half of the data stored and processed by companies in 22 countries has no known value. It estimated that 30 percent of the information stored in the U.S. is ROT data.Along with \"a fear of the 'delete' key,\" the inexorable shift to the cloud may be accelerating the data ROT problem. The reason, Veritas argued, is that \" pushing data to the cloud can just move the problem further away, adding to the unclassified dark data.\"Adding to the data mishmash on enterprise IT platforms is the growing amount of personal data on corporate networks as more workers store more private data on work devices. That data exposes companies to new data privacy rules that can differ from one region to the next.While vendors like Veritas offer storage management and data governance tools designed to get a handle on the \"databerg,\" other storage and virtualization vendors highlight the need for an IT roadmap as they shift to hybrid cloud platforms. That includes a big push toward virtualized data storage, according to an IT transformation study released this week by EMC Corp. (NYSE: EMC) and VMware (NYSE: VMW).Ultimately, the Veritas study warns, the inability to reverse the databerg phenomenon could end up costing companies trillions of dollars in wasted storage resources by 2020. One solution is implementing IT policies that schedule when ROT data must be deleted. According to the Veritas survey, 35 percent of companies with such policies in place require data to be deleted on a quarterly basis. The study found a direct correlation between freeing up storage and other IT resources and improved cash flow.\"The direct costs consumed by databergs in IT resources and management time do not account for the current and future investment cash which they tie up and which could be better spent elsewhere,\" the survey notes. \"By classifying more of their data, organizations would have a better view on how much money could be re-invested.\" George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/03/Screen-Shot-2016-03-15-at-11.51.17-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}