{
    "title": "Netlist, Samsung Partner on Memory Channel Storage",
    "author": "George Leopold",
    "date": "2015-11-19 00:00:00",
    "text": "Analytics and other data intensive applications continue to drive new enterprise memory and storage approaches along with device manufacturing partnerships needed to scale production of emerging memory channel storage platforms.Another case in point is this week's announcement from Netlist Inc. (NASDAQ: NLST) that it is joining forces with Korean memory chip powerhouse Samsung Electronics Co. (KRX: 005930) to develop memory modules based on the non-volatile DIMM-P (NV-P) spec. The partners said Thursday (Nov. 19) their new storage class memory products would be based on Samsung's NAND flash and DRAM technologies and Netlist's HyperVault platform.The five-year joint development and licensing deal calls for the partners to create a standard product interface for the cloud computing, big data and storage markets.Along with licensing their respective patent portfolios, Netlist, Irvine, Calif., said it would receive $23 million from Samsung Electronics, including $8 million in cash and $15 million in investment via the Korean chipmakers' venture arm.The partners are betting that NV-P will emerge as an industry standard for flash-based memory channel storage. Other competitors like the memory channel storage team of Diablo Technologies and SanDisk began ramping memory modules and interface chips last year for DDR4.Samsung's NAND flash and memory modules would be combined with Netlist's HyperVault memory-storage architecture billed as delivering cheaper, high-density NAND storage with the performance of costly high-speed DRAM memory.For chipmakers like Samsung, the partnership creates potential new markets driven by big data applications for its DRAM and NAND flash memory as the computing market continues to slow. Samsung is betting that standard hybrid storage platforms like NV-P will drive consumption of its NAND flash and memory chips.\"By using a standardized hybrid storage solution, our customers will be able to efficiently extract intelligence from large amounts of data in storage systems,\" Jung-Bae Lee, senior vice president for memory products at Samsung Electronics, noted in a statement announcing the partnership with Netlist.Industry researcher Objective Analysis projects the market for NVDIMM-P memory modules in applications like memory channel storage in servers could reach $2 billion by 2019. NVDIMM-P is the nomenclature adopted by industry standard groups to describe storage class memory products combining the functionality of persistent DRAM and block-accessed NAND flash operating in the memory channel—the fastest data path in a computer.Netlist describes its HyperVault approach as a \"superset\" of NVDIMM-P, designed to expand the capabilities of NAND flash to achieve DRAM-like performance along with compatibility with DDR4 without system software modifications.Flash-based memory channel storage platforms based on the NV-P spec are expected to initially target high-end storage tiers where latency and data throughput are critical. Among the applications are big data analytics, in-memory and other high-performance databases, transaction processing and virtualization.Netlist and Samsung Electronics said they plan to begin sampling NV-P storage memories next year.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/lightning-flash-370x261.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}