{
    "title": "SanDisk Rides Flash Wave, Eager For Fusion-io",
    "text": "Over the past several years, key acquisitions and initiatives have transformed SanDisk into an enterprise storage powerhouse with its own flash memory capacity, making it one of the key vertically integrated players in the storage space. The company’s push into flash-based drives is paying off and it is expected that its drive into PCI-Express flash cards with its Fusion-io acquisition and push into UlltraDIMM memory channel storage through its partnership with Diablo Technologies will also become an important part of its enterprise business.In the second quarter ended in June, SanDisk’s revenues rose by 10.7 percent, to $1.63 billion. Research, development, sales, and marketing costs all rose a bit faster than this as SanDisk continues to invest in its 15 nanometer 1Z manufacturing technologies, ramps up its X3 three-bit-per-cell flash, and works on 3D NAND flash chips. Because of this, net income ramped a bit slower, rising only 4.6 percent to $273.9 million. But that still worked out to bringing 16.7 percent of revenues to the bottom line, which is not too shabby for a hardware manufacturer.As was the case in the first quarter, SanDisk is seeing great uptake of its solid state drives (SSDs), both on the enterprise and the consumer front. Flash drives are being used in servers to accelerate workloads and all-flash arrays are now all the rage and with sophisticated de-duplication, compression, and thin provisioning algorithms can offer a cost per effective gigabyte that rivals that of spinning disk arrays.On a conference call with Wall Street analysts going over the figures for the second quarter, Sanjay Mehrotra, president and CEO at SanDisk, said that SSDs represented around 29 percent of revenues, or about $473.8 million, compared to about 16 percent of revenues in Q2 2013, or about $236.2 million. That is a doubling of the revenue stream, thanks in large part to the acquisitions of Pliant and Smart Storage and the ramping up of sales by SanDisk to hyperscale datacenter operators and to server and storage equipment makers.Mehrotra said that the enterprise SSD business more than doubled in the quarter, and grew 30 percent sequentially from a strong first quarter. Significantly, the CloudSpeed SATA SSD products that are aimed at budget-conscious hyperscale datacenter operators have now been qualified for the buy list at a number of these companies. “We are pleased with the strong traction and revenue ramp achieved in the initial phases of our engagement in this market,” Mehrotra said. In many cases, enterprise customers prefer SAS interfaces for their storage, and therefore tier one storage array makers often use SAS SSDs. Mehrotra said that the Optimus Eco SAS SSD, which comes in a 2.5-inch form factor and which tops out at 2 TB, is now being used in an all-flash array from one of the tier one suppliers. (He did not name names, as is customary with OEM agreements.) The Optimus Eco drives as well as CloudSpeed SATA drives, were refreshed back in early May. SanDisk is expected to ship its 4 TB Optimus Max drive, which weighs in at 4 TB with a 6 Gb/sec SAS interface, as well as its Lightning II, which has a 12 Gb/sec SAS interface and a maximum capacity of 1.6 TB, in the current quarter. The Optimus Max is getting a lot of interest as a replacement for 15K RPM SAS drives as well as for slower but fatter 10K RPM drives of equivalent capacity. Mehrotra said that the big server and storage array makers were qualifying these drives now and they would deliver meaningful contributions to SanDisk’s revenues in the second half of this year.On the flash memory front, Mehrotra said that demand was picking up for flash chips based on its 19 nanometer 1Y process, and given this the amount of aggregate bits shipped would be a little bit lighter than many on Wall Street might have been anticipating. The company has been projecting that aggregate memory capacity, expressed in bits, would grow at between 25 and 35 percent, and now it says that the fabs that it operates in conjunction with Toshiba will probably crank out capacity at the low-end of that range. The good news is that there is demand for current generation 19 nanometer flash and SanDisk and Toshiba have inventory to burn, which they will do.SanDisk warns that it expects to be somewhat supply constrained in the second half of this year and would manage its revenue mix with a “focus on our strategic priorities and customer relationships.” In the first quarter, the aggregate bit supply sold, as measured in petabytes, was up 51 percent year-on-year and up 31 percent sequentially from the first quarter, just to give you a feel for the jump. This supply constraint comes even as SanDisk expects to ramp up wafer production at its fabs by around 5 percent. This expanded capacity is expected to come online in the fourth quarter. The company is considering additional wafer capacity expansion for next year, and will talk about that later this year when the plan comes to fruition. What SanDisk will say is that next year its total memory production as measured in bits (not chip count) will grow along with the flash industry average of 30 to 40 percent.This tightness of flash supply could impact how quickly SanDisk can move the PCI Express cards from its Fusion-io acquisition to in-house flash chips. Generally speaking, it takes a couple of quarters to integrate SanDisk’s flash into an acquired product line, so no one is expecting this to happen overnight. SanDisk expects for the $1.1 billion Fusion-io acquisition, which was announced in mid-June, to close in the third quarter. But the company is not providing any revenue guidance with Fusion-io in it or integration plans until the deal closes. Judy Bruner, chief financial officer at SanDisk, reminded Wall Street that Fusion-io was operating at a loss and that any synergies and cost-cutting between the two companies will take some time to materialize and there will be restructuring and others costs relating to the deal. That said, Bruner repeated that SanDisk expected Fusion-io to have a positive effect on SanDisk’s overall earnings starting in the second half of 2015, after the deal and restructuring is all done.Looking ahead to other process nodes and technologies, Mehrotra said SanDisk and Toshiba would begin production of flash using its 15 nanometer 1Z technology toward the end of this year, with meaningful production in the first quarter of next year. The company expects 3D stacked NAND flash memory to pilot in the second half of 2015, with production set for 2016.SanDisk closed out the second quarter with $885.1 million in cash, $1.79 billion in short-term investments, and $3.57 billion in long-term investments, so it will have plenty of cash to play with even after closing the $1.1 billion Fusion-io deal. The company is carrying just under $2 billion in debt, however, so it cannot spend like crazy. But if it wants to control the UlltraDIMM memory channel storage market, it may be considering an acquisition of Diablo Technologies. Then again, it could also be thinking of ways of deploying engineers from its combined SanDisk and Fusion-io teams to come up with a homegrown alternative to the memory-to-SATA interface chip that Diablo licenses to SanDisk to create the UlltraDIMM flash-based memory chips. Time will tell.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-07-21 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Flash",
        "Fusion-io",
        "SanDisk"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/fusion-io/",
        "https://www.enterpriseai.news/tag/sandisk/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/flash-disk-370x290.jpg"
    ]
}