{
    "title": "OCP Storage Hits the Datacenter",
    "text": "The emerging market for storage equipment based on the Open Compute Project is expected to more than double through 2023, according to datacenter storage equipment forecast.IHS Markit said this week it expects global revenues from the purchase of OCP-compliant storage gear to reach $5.4 billion by 2023. The current market is pegged at $2.5 billion, with OCP storage revenue currently growing annually at a 27-percent clip.Those robust revenue estimates reflect growing big data storage requirements as datacenters burst at the seams with structured and unstructured data generated by the growth of the Internet of Things, edge computing and data security requirements.The bullish revenue forecast also highlights how datacenter tool vendors ranging from Intel (NASDAQ: INTC), Microsoft (NASDAQ: MSFT) and Rackspace along with standards-driving users such as Goldman Sachs (NYSE: GS) have coalesced around the OCP charter.The market tracker said this week OCP storage accounted for about 4.5 percent of overall server external storage revenue during the first quarter of 2019. Traditional servers still account for the lion’s share of revenue, with a market share of 71 percent.Server technology based on OCP specs has gained much traction among datacenter operators. Now it appears storage technologies are catching up as data volumes soar.“Rising activity and solid member participation within the OCP storage community are sparking increased interest from equipment suppliers,” said Dennis Hahn, principal analyst at IHS Markit.Along with influential founding vendors and users, new member companies are forging OCP-compliant storage platforms, including a growing number of Asian vendors, the market watcher noted.“Open partnerships on datacenter storage hardware helps buyers through equipment savings and by cutting operating usage costs,” Hahn added. “By offering open products, vendors can better engage their [datacenter] customers in a dialogue about best practices that pay off in the long-run.”Along with a nascent edge computing market, IHS sees software-defined storage (SDS) driving demand for OCP-compliant platforms. The virtualization of storage effectively separates hardware and software, allowing the former to benefit from standards-based frameworks.Standards such as OCP “allow for greater choice when marrying together SDS hardware and software to create storage solutions and allow for consistent remote edge storage deployment,” the analyst said.Meanwhile, IHS estimates the datacenter storage market will reach $63 billion by 2023, up from $40 billion last year. That works out to a healthy five-year compound annual growth rate of 9.3 percent.While storage array revenues remain relatively flat, all-flash arrays continue to gain ground in the datacenter, rising 16 percent year-on-year. Another key storage networking component, Fibre Channel controllers, are beginning to slip as service meshes and other application microservices technologies gain traction.Fibre Channel is expected to account for 24 percent of controller ports by 2023, down from its current share of 26 percent, IHS reckons.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-08-23 00:00:00",
    "cats": [
        "Data Analytics",
        "Datacenter",
        "Edge/IOT",
        "Networks",
        "Security",
        "Silicon",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Silicon",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/silicon/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-silicon/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "datacenter",
        "Fibre Channel",
        "flash arrays",
        "IHS",
        "OCP",
        "Open Compute Project",
        "standards",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/datacenter-2/",
        "https://www.enterpriseai.news/tag/fibre-channel/",
        "https://www.enterpriseai.news/tag/flash-arrays/",
        "https://www.enterpriseai.news/tag/ihs/",
        "https://www.enterpriseai.news/tag/ocp/",
        "https://www.enterpriseai.news/tag/open-compute-project/",
        "https://www.enterpriseai.news/tag/standards/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/Open-Compute-Project-OCP-logo-370x200.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/OCP_storage-1024x607.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}