{
    "title": "SanDisk Spins Out Hybrid Storage Unit",
    "text": "SanDisk Corp. said it has completed the spin out of its ioControl unit acquired as part of its deal announced in June 2014 to purchase Fusion-io. The new company will be called NexGen Storage Inc.Terms of the transaction were not disclosed.The completion of the $1.1 billion acquisition clears the way for SanDisk, a major player in the consumer flash storage market, to become an indirect supplier of flash technologies to enterprises. NexGen will develop hybrid storage appliances that combine PCIe flash storage with traditional hard disk drives, SanDisk said January 8 in announcing completion of the spin out.\"Hybrid systems incorporating hard-disk drives are not part of SanDisk’s strategic focus,\" Sumit Sadana, SanDisk's executive vice president and chief strategy officer, noted in a statement. \"Spinning out the ioControl business allows us to focus our resources on our core business, while positioning the independent company to address the significant opportunities in the dynamic enterprise storage market.\"The company added that it would remain a supplier of PCIe flash storage technology to NexGen but would not maintain an ownership interest in the flash spinoff.John Spiers, co-founder and CEO of the original NexGen, will head the new company that reverts back to its original name before it was acquired by Fusion-io. Spiers noted that NexGen's original focus was blending multiple types of storage, including NVDIMM flash, hard disk drives and cloud as a tier, along with emerging storage technologies yet to be commercialized.As part of Fusion-io's ioControl solutions business, NexGen claims to have tripled its research and development investments over the last 20 months.NexGen hinted at details of its upcoming product portfolio expected to be disclosed at the end of January, including several-fold increases in flash capacity and performance. It is also readying a data-priority caching system said to provide a 25 percent cost reduction by prioritizing what data is stored in flash.When the SanDisk-Fusion-io deal was announced last summer, observers noted that Fusion-io was a key supplier of PCI-Express flash cards for servers. Key customers like Apple and Facebook accounted for more than half of Fusion-io's revenues as they deployed flash in servers to accelerate the performance of databases and other workloads.The Fusion-io acquisition is the latest in a series of SanDisk acquisitions as its targets enterprise datacenters. It acquired Smart Storage in July of 2013 for $307 million, giving the company entry into memory channel storage and flash-based SSDs.The flash storage market continues to heat up as enterprise customers embrace the technology and hard disk drive storage systems struggle to keep up with the growing I/O performance of emerging applications and workloads. Flash storage deployments in datacenters are also expected to grow in 2015 as prices for various implementations of the technology continue to decline.Meanwhile, storage giants continued to pursue flash vendors throughout the last year. In mid-December, for example, the HGST enterprise arm of Western Digital acquired all-flash array vendor Skyera in an all-cash deal. HGST did not disclose details of the transaction but said Skyera would be \"fully integrated\" into the Western Digital unit when the acquisition is completed.Micron Technology, Toshiba and SK Hynix had reportedly invested in Skyera.",
    "date": "2015-01-08 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-08-at-12.50.32-PM.png"
    ]
}