{
    "title": "EMC Extends Flash with XtremIO Upgrade",
    "text": "EMC this week expanded the capacity of its XtremIO all-flash storage array in a free upgrade to existing customers, and launched a 40TB X-Brick building block to scale all-flash clusters.During a presentation at EMC World 2015, the developer presented its new flash offerings as a way for enterprises to consolidate more common workloads on solid-state storage systems. XtremIO 4.0 supports larger all-flash array configurations; expands on-demand capabilities, and consolidates workloads at higher levels of performance and availability than the prior iteration, according to EMC. The upgrade more than doubles previous density with 40TBs per X-Brick and configurations of up to eight 40TB X-Bricks with non-disruptive performance, the company said. In addition, organizations can opt for capacity expansions that automatically rebalance data for consistent, predictable sub-millisecond performance, EMC added.Flash is slowly gaining traction in the enterprise, where its speed, small size, and energy efficiency can make it an attractive alternative to hard disk drives – especially in datacenters where big data and virtual machines rule supreme, said Rana Pratap, principal consultant, technology, at LexInnova, in an interview. However, cost continues to be a factor: Flash is more expensive than its predecessor, he added.Because XtremIO 4.0 allows entire workflows to be streamlined and automated – from storage through the hypervisor and into the application itself – enterprises are adopting the array across mission-critical workloads and workflows including DevOps, real-time analytics, database acceleration, private and hybrid clouds, messaging, and electronic medical records, the company said.The new version, which comes about 18 months after EMC began offering XtremIO, scales up to eight X-Bricks with 16 N-way active controllers, compared with the prior 12, and enterprises can non-disruptively expand arrays for performance and capacity. The storage array uses EMC RecoverPoint software for scale-out replication; data on the arrays can be replicated to other XtremIO arrays or any other array RecoverPoint supports, leveraging up to one-minute recovery point objectives (RPO). EMC integrated XtremIO's copy data management functions in enterprise application management stacks including VMware, Oracle, Microsoft SQL Server, and Microsoft Exchange, and allows single pane of glass management for multiple clusters via XtremIO Management Server (XMS). The interface features historical reporting over two years of operating history; tagging and search capabilities; hosts; snapshots, and built-in reporting. Finally, the XtremIO and Federation Enterprise Hybrid Cloud 3.0 offering is designed to allow businesses to consolidate all critical workloads and non-production lifecycle copies in a hybrid cloud with Tier 0 storage and copy services.The array is available for order this quarter.EMC acquired XtremeIO about three years ago for $430 million, predicting flash would become an important piece of the software-defined datacenter. In its most recent report on flash, IDC reported EMC earned $112.3 million and held 22.6 percent of the worldwide flash array market, followed by Pure Storage at $90.9 million and 18.3 percent share, and IBM at $82.9 million and 16.7 percent of the market. Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.You can read real user review of EMC XtremIO on IT Central Station. http://www.itcentralstation.com/products/emc-xtremio-flash-storage\nFor a more integrated solution you can read reviews for FlexPod from NetApp http://www.itcentralstation.com/products/flexpod",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-05-05 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "EMC",
        "Flash",
        "storage",
        "XtremIO"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/storage-2/",
        "https://www.enterpriseai.news/tag/xtremio/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/XtremeIO-370x290.png",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g",
        "https://secure.gravatar.com/avatar/55a71a79912d277e40119bded88bb25d?s=60&r=g"
    ]
}