{
    "title": "AWS Launches Greengrass IoT Service",
    "text": "Amazon Web Services has extended its Internet of Things offerings with the launch a new platform designed to boost computing power for devices at the network edge via its public cloud.AWS Greengrass unveiled on Wednesday (June 7) aims to connect local devices to the public cloud service via its Lambda software to provide local computing and other capabilities to devices running IoT applications. Among the goals of this and other IoT networking projects in bringing computer horsepower closer to IoT data.Greengrass brings \"cloud programming and functionality to sets of IoT devices,\" the company explained in a promotional video, allowing them to \"communicate and react when a cloud connection is not possible.\" Groups of IoT devices are defined and configured from the cloud, the cloud giant (NASDAQ: AMZN) said.The new IoT platform essentially extends the public cloud to connected devices \"so they can act locally on the data they generate.\" The service would allow developers to move intelligence to the network edge by embedding AWS Lambda computing and other services into IoT devices.Those connected devices could then run AWS Lambda functions, sync device data and communication with each other. The Lambda platform is designed to let users run code associated with applications and services in the public cloud without provisioning servers. Along with computing power, the platform would manage applications in the cloud while also handling analytics and storage.AWS also touted the service as reducing to cost of transmitting IoT data via the public cloud along with allowing edge devices to operate with only intermittent cloud connections. One result would be improving the ability of IoT devices to \"act locally on the data they generate\" and respond in near real-time.AWS also is pitching the new IoT service as allowing developers to build IoT frameworks that connect different devices to the cloud and each other.For instance, the service supports IoT devices running on ARM, Linux and x86 architectures. Each can host a Greengrass \"Core\" that executes Lambda code and other functions locally. The core acts as a cloud-based hub that communicates with other devices such as microcontrollers while securely connects devices to the AWS cloud.Canonical, developer of the Ubuntu operating system that targets cloud and IoT devices, said it collaborated with AWS to deliver Greengrass as a \"snap,\" the Linux packaging format. The tool allows developers to install and distribute Greengrass across hardware running on different operating system distributions.\"AWS Greengrass will enable more customers and developers to realize the benefit of processing and analyzing data at the edge,\" asserted Mike Bell, Canonical's general manager of devices and IoT. Deploying Greengrass via the tool also would allow developers to \"reduce the time and complexity of building smart edge solutions across new and existing hardware,\" Bell added.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-06-08 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Networks",
        "Slider: Cloud",
        "Slider: Networks",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS",
        "Greengrass",
        "iot",
        "Lambda",
        "Linux"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/greengrass/",
        "https://www.enterpriseai.news/tag/iot/",
        "https://www.enterpriseai.news/tag/lambda/",
        "https://www.enterpriseai.news/tag/linux/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_IoT-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}