{
    "title": "DDN Claims Faster Object Storage ‘Cross-Region’ S3 Connectivity than AWS",
    "text": "Advanced-scale storage specialist DataDirect Networks (DDN), whose solutions populate the upper-rung of the Top500 supercomputing list, today announced new “cross-region” features to its WOS object storage platform that support multi-site AWS connectivity as well as new data protection and disaster recovery capabilities.According to DDN, Extended ObjectAssure offers low-cost data protection along with control for local-only rebuilds the company said lowers risk of data loss during a rebuild and reduces drive failure impacts. In addition, DDN has expanded its AWS S3 multi-site capabilities in support of collaboration, disaster recovery and content distribution for customers that share data across multiple sites. DDN said its S3 interface is a faster and cheaper alternative to public clouds.“We’ve done skunkworks-type research about Amazon S3’s own replication,” Michael King, DDN senior director of marketing, told EnterpriseTech, finding DDN has a 3X performance edge, he said. “Important for us is to make this replication work well in a timely enough fashion that it provides the redundancy, resiliency and availability that’s required for our customers.”Typically, King said, the use case for object storage is low cost storage on disk. But DDN customers are getting “real-world” WOS performance of up to 2.2Gb/second, he said, “so the idea of being a performant object storage system is where we’re headed.” Added Laura Shepard, DDN senior director of product marketing, “Object storage is really coming into its own with surging adoption across key use cases like large active archives, multi-site collaboration, content distribution, disk backup and disaster recovery.”DDN said the WOS architecture allows organizations to start with a single WOS appliance in four standard rack units and scale in single-node increments. It can deliver up to a quarter-million drives in a single, shared namespace and provide a single view of files and objects, supporting high-performance storage for active archive and collaboration environments.“Most of our success with object storage is not in that cheap-and-deep kind of storage, but rather in an active archive (environment) that is so performant that it can help supplement Tier 1 storage,” King said. “It (WOS) can pull data back so quickly to supplement semi-warm data that you didn’t know if you’d need in an active archive; it pulls it back quickly enough that it makes everything work out. You can reduce the size of your Tier 1 and save money in the process.”DDN’s object storage suite includes WOS as software-only along with several appliances. Extended ObjectAssure provides additional erasure coding and replication combinations, enabling WOS to be configured to rebuild failed drives within a single node. These features reduce rebuild time and risk of data loss – capabilities the company said are increasingly important as drive sizes grow.\"The new digitized world demands infrastructure solutions that are extremely scalable and flexible in terms of delivery performance and connectivity models and that offer full data protection with a wide choice of user-selected protection methods,\" said Amita Potnis, research manager in IDC's Storage team. \"With continual innovation in object storage technologies and features, DDN’s object storage platform is leading end users along this path of digitization.\"Users recently added to DDN’s WOS customer list include Cold Springs Harbor, Van Andel and Children’s Mercy Hospital of Kansas City. In addition, the company said, the University of Edinburgh’s Parallel Computing Centre is evaluating WOS to support an infinitely scalable storage pool and to manage what will become a large active archive of research data, the goal being to offer a scalable, lower cost alternative to file storage to the university’s industry users and Tier 3 HPC centers around the UK.DDN said ObjectAssure is available this quarter across the WOS product line.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-04-11 00:00:00",
    "cats": [
        "Cloud",
        "Slider: Cloud",
        "Slider: Front Page",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/DDN-WOS-front_HR-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/DDN-WOS-protection-schemes-April-2017-1400x-1024x425.png"
    ]
}