{
    "title": "Translating AI and Storage Innovation into Business Value – Innovate or Die",
    "text": "Determining value and adapting a business to a changing environment is the focus of the University of Saint Gallen working paper, “The St. Gallen Business Model Navigator.” With examples such as Kodak’s comical projection in 1999 that in 10 years digital cameras would only account for 5 percent of the market (the converse was true, digital cameras had 95 percent market share in 2009), the working paper conceptualizes the value of innovation in four dimensions: the Who, the What, the How, and the Value in the “magic triangle”:Technology is a major driver of innovation in the current business environment, so much so that the two frequently appear inseparable.In this article, we will provide a concrete example where the magic triangle signaled a win-win for Siemens as a technology end user to incorporate AI and digital twin technology to increase the reliability of trains operated by the Spanish rail company Renfe. We then use this case to extrapolate how recent AI and storage innovations are similarly affecting end user business models throughout the computer industry, be they HPC, cloud, or enterprise, viewed through the lens of the Saint Gallen paper.In a nutshell, the magic triangle gets technologists and business people on the same page as they answer four associated questions: (1) the target customer, (2) the value proposition for the customer, (3) the value chain behind the creation of value, and (4) the revenue model.In toto, answers to these four questions provide a concise idea of how a business works, signal when the value proposition of a new technology reflects an innovation opportunity and provide a common ground for rethinking the business model.[i] Expressed in terms of the magic triangle, an optimization or change at one of the key points in the triangle (such as the revenue model) automatically requires adjustments of the other two sides (value proposition or value chain). If at least two of the four dimensions of a business model change, then a good opportunity exists. [ii] This is illustrated in Figure 2 and discussed at greater length below.A concrete example\nSiemens has been rethinking its business models as they apply the advantages of AI and “digital twin” technology to better service their customer needs.In defining a digital twin, Forbes notes that “a digital twin is a virtual model of a process, product or service. This pairing of the virtual and physical worlds allows analysis of data and monitoring of systems to head off problems before they even occur, prevent downtime, develop new opportunities and even plan for the future by using simulations.” [iii] Digital twins were named one of Gartner’s Top 10 Strategic Technology Trends for 2017.One use case for AI and digital twin technology is the Spanish train operator Renfe, which operates a high-speed rail line between Madrid and Barcelona, which takes two and a half hours (in-the-air flight time is one hour and twenty minutes). To attract customers Renfe guarantees that if a delay of fifteen minutes or more arises, they will refund the full fair.[iv]To minimize this from happening, Renfe formed a joint venture with Siemens, which services Renfe’s high-speed trains, to increase reliability through predictive maintenance.For Renfe, this joint venture did not change its business model. The company simply continued with business as usual in the hope that they would experience fewer failures that would require reimbursing customers.But for Siemens, two of the four dimensions in its magic triangle changed. Increased reliability through predictive analytics, based on a new technology and data collection value proposition to Renfe (i.e., the What) presented Siemens with an innovation opportunity. In doing so, the Siemens revenue model changed because predictive analytics gave them the ability to offer this new service (e.g. the Value).The difference between the magic triangles for the two companies is illustrated below.To enable this new business model, sensors were installed on Renfe locomotives to monitor critical components, with the data was sent to the cloud for analysis using AI and digital twin computational technology.In his ISC’18 presentation discussing the importance of the Saint Gallen paper, Thomas Hahn, Siemens AG chief expert software, Corporate Technology, Research and Technology Center, noted that with the aid of predictive analytics Renfe achieved an on-time rate of 99.9 percent. As reported by Siemens in a recent 2019 press release, “when the train line was put into operation a good 10 years ago, Renfe says only 20 percent of travelers chose to travel by rail; today, it’s more than 60%.” [v] Thus technology provided a capability that Siemens leveraged to develop a new business model that increased customer draw and revenue, a win-win situation for both Siemens and its customer. This innovation was signaled by the magic triangle in Figure 2.AI, Storage Innovation and Digital Twins\nLike Siemens, many companies are interested in leveraging AI, data mining and big data to get more value for their money, optimize their businesses, innovate and increase revenue.The advent of inexpensive cloud-based ML and HPC capability means has brought on adoption of sophisticated AI and digital twin technology. An extensive software ecosystem supports such efforts. Evidence of success include the UberCloud experiment compendium and use cases highlighted by AWS. Overall, the impact is significant. Even the highly conservative legal system is starting to accept computational results in settling legal disputes. [vi]With all the excitement surrounding AI, it is easy to forget that data scientists spend most of their time managing data to create representative data sets. Unfortunately, data management – along with storage – are too often undervalued, making both a seen-but-not-heard “Victorian-era child of the 21st century.”However, new technologies are redefining storage performance and memory capacity, which in turn impacts all aspects of computation from AI (e.g. data curation and management) to databases.For example, the Non-Volatile Systems Laboratory at the University of California, San Diego performed over 330 hours of machine time testing on a dual-socket machine containing 3 TB of Intel Optane DC persistent memory.[vii] Overall the NVSL team observed that, “Optane DC will profoundly affect the performance of storage systems” and they back their observation with benchmark results.The reader is encouraged to examine the NVSL report in detail, but in summary, Optane memory can be byte accessed as memory across a memory bus. There is no PCIe bus overhead. This is critical, as tweaktown notes, “On a cellular level, 3D XPoint [ed note: which Intel now calls Optane DC persistent memory] is 1000x faster and 1000x more enduring than NAND flash memory. In the real-world, actual performance is limited by bus performance.” [viii]Business Model PatternsAt this time, the Business Model Innovation Lab, a spinoff of Saint Gallen, has analyzed some 350 cases of disruptive business models, from American Express Traveler Cheques to Zara, and identified 55 underlying business model patterns. [ix]These patterns help solidify thinking so technologists and businesspeople can work together to change those two axis in the Saint Gallen working paper’s magic triangle.Looking to the patterns identified:\nSummaryIn short, look at the Saint Gallen working paper, answer the magic triangle questions and see if two of the magic triangle axis change. If so, then look for an innovation opportunity for the business.As Doug Black (managing editor, EnterpriseAI) observed, the magic triangle is another example of augmented decision making, “to put more and more data into the hands of decision makers”.Rob Farber is a global technology consultant and author with an extensive background in how HPC and machine learning technology can redefine business models and research efforts. He can be reached at info@techenablement.com. [i] https://www.thegeniusworks.com/wp-content/uploads/2017/06/St-Gallen-Business-Model-Innovation-Paper.pdf[ii] https://www.ask-flip.com/method/148[iii] https://www.forbes.com/sites/bernardmarr/2017/03/06/what-is-digital-twin-technology-and-why-is-it-so-important/#94d4ef72e2a7[iv] https://news.usa.siemens.biz/blog/industry-where-real-potential-ai-lies[v] ibid[vi] https://aws.amazon.com/solutions/case-studies/all/[vii] https://arxiv.org/pdf/1903.05714.pdf [viii] https://www.tweaktown.com/articles/8119/intel-optane-memory-matters/index.html[ix] https://blog.bosch-si.com/business-models/business-models-and-the-internet-of-things/[x] https://www.thegeniusworks.com/wp-content/uploads/2017/06/St-Gallen-Business-Model-Innovation-Paper.pdf",
    "date": "2019-08-19 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Datacenter",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/AI-generic-data-shutterstock_777221539--370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/Saint-Gallen-triangle-1.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/Saint-Gallen-triangle-2.png"
    ]
}