{
    "title": "When the Going Gets Tough, the Smart Optimize",
    "text": "IT departments are always asked to do more with less. But it is much easier to buy shiny new toys in a good economy than a bad one, which is one of the reasons why the all flash array (AFA) market has been so strong in recent years.If the economy turns south in 2016, which some are starting to predict, will IT spending patterns change?Let’s take a look at the history books...In 2001, VMware first started shipping ESX, which was right on the heels of the dot.com recession.  This product propelled the company to its current level of success. Why was it so successful? At that time, IT departments were focusing their efforts on value – concentrating spend on projects that improve the bottom line. ESX provided a great way to do just that. More specifically, it enabled companies to optimize server infrastructure using virtualization instead of buying more server hardware. The ROI was real, and easy to quantify.Is there a lesson here?When the going gets tough, people optimize. VMware made a name for itself selling software that optimizes server performance, and Isilon became a multibillion dollar company by optimizing storage hardware with scale-out growth. In both instances, the solutions were embraced because they minimized hardware expenditures while providing substantive value.So, what can we expect in 2016? Economic uncertainty will cause CIOs to harshly scrutinize IT spend in the coming year. This means it will be increasingly difficult to blindly throw hardware at problems. For example, buying capacity to get performance in a storage array is inefficient and expensive, and will be increasingly tough to justify as customer affordability goes down. Similarly, investing in more onsite equipment will be seriously questioned in lieu of more cost effective cloud based services.In addition, other “Cadillac” spends will be increasingly questioned. For example, we are already seeing customers scrutinize their database environments more to see which individual instances require Oracle vs less expensive SQL server or MySQL. And they are pushing back on investments in expensive in-memory computing solutions and specialized hardware like Exadata in favor of alternative solutions that provide equal performance at lower costs.Looking specifically at the storage space, in my opinion, these factors will cause the AFA and hyperconverged markets to soften a bit in the near term. Companies will look to optimize their existing storage instead of replacing it with expensive new hardware. And, unless more storage capacity is absolutely needed, they will hold off on purchasing new storage platforms until next generation solutions emerge with better scale-out capabilities (and other cost savings measures).",
    "date": "2016-02-22 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2012/05/Money4_32-530x320.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/Jeff-Aaron-249x300.jpg"
    ]
}