{
    "title": "Heptio Looks to Reduce Container Complexity",
    "author": "George Leopold",
    "date": "2017-09-13 00:00:00",
    "text": "Startup Heptio announced its latest funding round this week as it seeks to drive application container orchestration deeper into enterprise IT infrastructure by making the technology more accessible to frontline systems engineers.The Seattle-based startup launched last year by ex-Google engineers and Kubernetes project founders Joe Beda and Craig McLuckie announced Wednesday (Sept. 13) the closing of a $25 million funding round. \"This new funding accelerates our growth and enables us to look beyond Kubernetes to support businesses' IT transformation efforts in a hybrid-cloud world,\" CEO McLuckie noted in a statement.Launched last November, Heptio has so far raised $33.5 million in a pair of funding rounds. Madrona Venture Group led the latest round along with Lightspeed Venture Partners and Accel Partners.Kubernetes, the open source container orchestrator, continues to gain traction as DevOps teams embrace containers as a way of simplifying the process of deploying software into production. Startups such as Heptio are also trying to expand that ecosystem as a \"stepping stone\" to cloud-native IT deployments as more enterprises shift operations to private and public clouds.Heptio CTO Beda and McLuckie, along with Brendan Burns (now with Microsoft [NASDAQ: MSFT]), developed Kubernetes while at Google (NASDAQ: GOOGL) before releasing it to the open source community under the auspices of the Cloud Native Computing Foundation. It has since emerged as a key competitor to other orchestration approaches such as Docker Swarm.A recent container adoption survey by 451 Research concluded that container management and orchestration remains a \"mixed-use market,\" with Kubernetes leading the way but not yet a \"de facto standard.\" Nevertheless, the market research predicted that hybrid cloud deployments would accelerate demand for enterprise container infrastructure as DevOps teams seek a consistent application development environment across on-premise and cloud infrastructure.Heptio said Tim Porter, managing director of Madrona Venture Group, would join its board of directors.With the goal of making Kubernetes easier to use in production, Heptio launched two new open source projects in August: Ark and Sonobuoy. As the name suggests, Ark is a utility for managing disaster recovery with users' cluster resources and persistent storage volumes. The utility backups and restores applications and persistent volumes via a series of \"checkpoints,\" the company said.Ark also enables \"cross-cloud provider migration of Kubernetes objects\" in multi-cloud deployments, McLuckie explained in a blog post.Sonobuoy is a diagnostic tool for understanding the state of a Kubernetes cluster. It works by running a set of conformance tests. \"To ensure that you can safely run Sonobuoy in production, we have carefully picked these tests to avoid side effects,\" McLuckie noted.As for the status of applications containers that have so far struggled to enter production, McLuckie conceded in a blog post there is much work to be done to reduce complexity. \"Kubernetes really speaks to systems engineers, but there is a huge body of work to do to make it truly accessible to engineers who don’t necessarily have the time to ‘dig into’ the details of the project.\"Added McLuckie, \"Upstream versions of Kubernetes remain inaccessible to many from an operations and accessibility perspective. It is still too hard to deploy a Kubernetes cluster, qualify whether it is conformant and stitch it into the fabric of enterprise IT systems.\" George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/google-kubernetes-logo-370x275.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}