{
    "title": "Memory Boom Propels Samsung Past Intel",
    "author": "George Leopold",
    "date": "2018-01-04 00:00:00",
    "text": "The turbulent—and profitable—memory chip market has a new leader: Samsung Electronics has overtaken Intel Corp. as the world's largest memory supplier, ending Intel's 25-year reign.Gartner reported Thursday (Jan. 4) that the South Korean electronics giant surpassed Intel during 2017 in terms of market share and revenues. Overall, global chip revenues grew a healthy 22.2 percent, driven by soaring demand for memory devices.While memory prices are expected to stabilize, other chip analysts are forecasting a wave of new memory technology deployments over the next five years.Meanwhile, Gartner (NYSE: IT) cited continuing shortages of flash memory.The market watcher said Samsung (KRX: 005930) holds 14.6 percent of the $419.7 billion global semiconductor market. The Korean chipmaker's revenues grew an impressive 52.6 percent over 2016. Meanwhile, Intel's annual revenues grew a modest 6.7 percent, totaling just over $57.7 million. No. 3 chipmaker SK Hynix (KRX: 000660) grew at a brisk 79 percent, with revenues of $26.3 million.\"Memory accounted for more than two-thirds of all semiconductor revenue growth in 2017, and became the largest semiconductor category,\" noted Andrew Norwood, Gartner's research vice president.Samsung's dominance of the global chip business is not expected to continue as memory prices weaken and Chinese memory production kicks in over the next year. Gartner forecasts that NAND flash and DRAM prices have peaked and will weaken during 2018.Gartner said Intel's datacenter server revenues grew 6 percent on the strength of demand from cloud and communications service providers.Several large chip mergers and acquisitions were announced in 2017, but Gartner notes that few if any were actually completed by year's end. Among them was Western Digital's (NASDAQ: WDC) acquisition in August of Tegile Systems, a provider of flash memory storage in datacenters. The deal reflects how all-flash storage arrays are making inroads in datacenters. Western Digital and other enterprise storage vendors are vying for a larger share of growing demand for all-flash arrays.According to the Gartner rankings, Western Digital recorded the highest annual growth rate among the top ten chip suppliers, a whopping 120.2 percent, with chip revenues totaling nearly $9.2 million.Demand for all-flash storage arrays in datacenters also propelled Western Digital from 17th to ninth place in Gartner's annual rankings.While market watchers such as Gartner forecast weakening memory prices in the coming year, others note that the so-called \"next-generation memory market\" is expected to take up the slack as more data is crunched by in-memory platforms. For example, Dublin-based Markets and Research pegs the next-generation memory market at $2.35 billion, and forecasts it will grow at an annual rate of 26.5 percent to $9.68 billion by 2023.The main drivers are big data demand for in-memory processing, increasing demand for enterprise storage of big data and growing requirements for more bandwidth and scalable memory technologies for AI and Internet of Things applications.A range of emerging non-volatile memory technologies are expected to fuel demand, the market watcher said, including magneto-resistive, or MRAM, along with emerging memory technologies like 3-D XPoint memory being rolled out by Intel (NASDAQ: INTC) and development partner Micron Technology (NASDAQ: MU). George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-22-at-6.20.32-PM-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-04-at-2.09.50-PM-300x176.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}