{
    "title": "Ex-NFL Star Patrick Willis Tackles Storage Technology",
    "author": "George Leopold",
    "date": "2015-04-23 00:00:00",
    "text": "Former star NFL linebacker Patrick Willis is trading his football spikes for a corner office with a Silicon Valley storage technology company.San Jose-based Open Source Storage said it has appointed Willis executive vice president for strategic partnerships for the media, entertainment and sports sectors. Willis is listed as an owner Open Source Storage along with founder and CEO Eren Niazi.\"I have always had an interest in technology and innovation, and similar to my love for football, felt a passion for open source,\" Willis noted in a statement released by the company earlier this month. \"I want to be a part of history in the making as I am fascinated with Eren Niazi’s brilliant visions: past, present and future. This amazing opportunity allows me to connect my sports passion with the next chapter in my life, in business and technology.\"Willis, a five-time All-Pro linebacker with the San Francisco 49ers, shocked the NFL in March when he announced his retirement after eight years. Willis was the 49ers' first-round draft choice in 2007 out of the University of Mississippi.According to the web site cbssports.com, Willis was a liberal arts major at Ole Miss and made the Chancellor's Honor Roll in 2003, his first year at the university. The consensus All-American eventually earned a bachelor's degree in criminal justice.Niazi said Willis' appointment reflects the storage company's \"emphasis on expanding open source technologies as a disruptive force in the media, entertainment and sports sectors.\"Niazi founded Open Source Storage in 2001. The company specializes in storage technologies used to handle large software deployments while reducing technology implementation costs. According to his company profile, Niazi helped design Facebook's \"core systems during its hyper-growth phase\" and backed Friendster, an early social media platform.Marc Rotzow, the company's CTO, helped design data storage solutions for Facebook, KPMG and NASA, according to his company profile.Along with reducing storage costs, Open Source Storage stresses its ability to migrate customers away from proprietary \"lock-in\" storage systems. The company's core products include storage, servers and open standard solutions tailored to hyper-scale data center needs, including soaring web traffic workloads requiring greater storage capacity and bandwidth.As its targets the emerging sports, entertainment and media sectors, the company's open source storage products have been implemented in Fortune 500 companies and global startups. It has also capitalized on government mandates to use of open source technologies in cloud platforms.The storage sector is becoming increasingly competitive as traditional players seek to transition from disk-based to flash and other emerging storage technologies. Greater emphasis also is being placed on making storage \"data aware.\"Hence, Patrick Willis' competitive drive on the gridiron is likely to carry over to the smash-mouth world of storage.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/Screen-Shot-2015-04-23-at-2.30.59-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}