{
    "title": "Cray Taps HSM Startup for Tiered Storage",
    "author": "Timothy Prickett Morgan",
    "date": "2013-11-06 00:00:00",
    "text": "Cray has aspirations in enterprise datacenters and that means putting together a complete set of storage as well as heavy-duty compute clusters. To that end, Cray is working with partners to forge the Tiered Adaptive Storage appliance, which is used to archive data to disk and tape.\"Cray is investing in storage and data management components, not just compute,\" Barry Bolding, vice president of storage and data management at the company, explains to EnterpriseTech. \"A lot of our RFPs are asking for better software to manage storage.\"Companies have been using tiered storage, a mix of fast and slow disk arrays and tape, for a long time, archiving data that gets progressively colder and only keeping the hottest datasets on their fastest and most expensive disk arrays. Bolding says that in many Lustre shops, the movement of data on and off the parallel file system is done manually, using scripts, and that this is not acceptable for enterprise customers. They want a true hierarchical management system where they can set a policy for moving data off of Lustre or any other file system that is attached to the production cluster to archival disk arrays or tape libraries. This is precisely what the TAS appliance from Cray does.Cray did not write its own HSM software and it is not building its own NAS filers or tape libraries, either. The company is leveraging existing reseller agreements with NetApp for disk arrays and with Spectra Logic for its tape libraries. For HSM software, Cray is going to a startup called Versity, which has created a Linux version of the venerable SAM-QFS file system and archiving manager.Harriet Coverston, the original creator of the Quick File System and its Storage Archive Manager File System archiving extensions now controlled by Oracle, is a co-founder and chief technology officer at Versity. She started Versity in 2011 with Bruce Gilpin and together they self-funded the development of Versity Storage Manager. Coverston is a heavy hitter in supercomputing file systems. In the 1960s and 1970s, she was at Lawrence Livermore National Laboratory and worked on the team that created the timesharing system for the Control Data 7600 supercomputer; she joined CDC in 1974 and worked there until 1986 on operating systems and network stacks. She founded Large Storage Configurations, where QFS and SAM-FS were created, after leaving CDC. Sun Microsystems bought LSC for $71 million back in 2001. Oracle, of course, bought Sun nearly four years ago for $7.4 billion.Oracle still sells and supports SAM-QFS with its Solaris Unix variant. But a lot of companies don't want Solaris anymore. They want Linux. When Solaris was open sourced back in 2005, the SAM-QFS combination was also opened up. Versity has taken that open source SAM-QFS code and ported it to Linux to create Versity Storage Manager.The combined SAM-QFS setup is currently installed at thousands of sites worldwide in financial institutions, telecom companies, government agencies, and hospitals as well as in academic and government supercomputer centers worldwide, according to Bolding.Bolding says that customers are telling Cray that they want a bigger company than Versity to stand behind a tiered storage archiving system, given the long-term nature of archival storage. Companies make bets for five to ten years for these platforms. That is one of the reasons why Cray is forging this TAS appliance itself. And to ensure the economic longevity of Versity Storage Manager – no one doubts its technical merits, given the long history and broad adoption of SAM-QFS – Cray is also taking a minority stake in Versity.The TAS appliance has a bunch of switches at the top. There is a single Gigabit Ethernet switch for management and customers can choose from InfiniBand switches or Fibre Channel switches to hook their storage to the disk arrays in appliance; you have to use Fibre Channel switches to hook to tape libraries. Support for 40 Gb/sec Ethernet switches is in the works, says Bolding, for linking arrays to the TAS appliance. The TAS appliance supports NetApp's E2600, E5400, and E5600 disk arrays and with Spectra Logic for its T200 LTO-based tape libraries. If you need a larger tape library, you can attach to one outside of the rack, and you can configure racks as all-disk or all-tape as you need.Redundant X86 servers at the top of the rack run a clustered copy of the VSM software, which presents the aggregate disk and tape capacity as a single file system. VSN supports up to four different tiers in the hierarchy. Most datacenters will have a one level of archival disk and a tape library and mount them as a single file system, with the policy engine in VSM determining where to physically put the data. Secure FTP or Secure Copy are used to move files to the TAS device. VSM is also exposed through a gateway as an NFS mount. In the first half of 2014, VSM will have a gateway to link to Windows-based CIFS file systems and their open source clones for Linux and Unix.In the base configuration shown, the TAS rack has 1.7 PB of mixed disk and tape storage and sells for $500,000.For Cray and its customers, it gets even more interesting when Lustre 2.5 is commercialized. As EnterpriseTechpreviously reported, the new iteration of the Lustre parallel file system will have a set of APIs that will allow hierarchical storage management (HSM) software to reach into Lustre and orchestrate the movement of data on and off it from archival devices like the TAS unit. Cray will be showing off this combination at the SC13 conference in Denver in a few weeks, and plans to have commercial support for Lustre 2.5 on its Sonexion storage arrays in the second quarter of next year.Just in case you are wondering. Cray has no plans to offer a different HSM software option with the TAS setup, such as the TrustedEdge and StorHouse that rival SGI just took control of last month when it acquired assets and people from FileTek. While Cray is happily reselling Spectra Logic's tape libraries, Bolding says that it has no plans to use its BlackPearl deep storage appliance, which is in beta testing now. The VSM software will support any LTO tape drive, and based on customer needs, Bolding hints that it is very likely that the TAS setup will support Oracle's StorageTek libraries at some point in the future.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/11/cray-tas-rack-260x290.jpg"
    ]
}