{
    "title": "Qumulo’s QF2 NVMe All-Flash File Storage: 4GBs/Second Per Node",
    "author": "Doug Black",
    "date": "2018-04-05 00:00:00",
    "text": "Claiming for itself the title of the world’s highest performance file storage system, Qumulo this week announced a new “enterprise-ready and cloud integrated” NVMe all-flash solution that the company said delivers 16GBs/second in a minimum configuration four-node system.The new Qumulo P-series enables Qumulo File Fabric (QF2) software to run on advanced, industry-standard hardware components, including high-speed NVMe, Intel Skylake SP processors, high-bandwidth Intel SSDs and 100GbE networking.  Qumulo said QF2 on the Qumulo P-series outperforms proprietary all-flash hardware and “marks a new era of high performance on industry-standard components.”According to Qumulo, the storage industry has been doing all-flash all wrong.“By focusing scarce development resources on low-volume, proprietary hardware, all-flash storage vendors are holding customers back from benefitting from the tremendous innovation we’ve seen in the overall market for advanced server components,” said Peter Godman, co-founder and CTO of Qumulo. “Customers end up paying more and getting less, while being locked into designs that are obsolete the day they ship. QF2 software unlocks the power of advanced hardware components to create the world’s fastest and most scalable file system. The Qumulo P-series demolishes the myth that custom hardware is required for best-in-class performance by delivering up to four times the performance of proprietary all-flash appliances on a per-node basis.”In a world of rapid hardware innovation, advanced, distributed software running on standard hardware “is the unchallenged basis of modern low-cost, scalable computing,” declared Qumulo in its press announcement.Built for high-demand workloads, such as genomic sequencing and analysis, uncompressed 4K editorial, scientific computing and large-scale datasets for machine learning applications, features of QF2 on the Qumulo P-series include:Ben Gitenstein, VP of product management, told EnterpriseTech that Qumulo is primarily focused “around the world of unstructured data… We can build really big systems, in terms of capacity and number of files or objects you can put in the system. It means we provide instant and real time visibility into what’s going on inside of your  unstructured data – how it’s being used, who’s using it, why they’re using it, how it’s growing, how it’s shrinking.”Another area of focus, he said: “leveraging the best of industry standard hardware, to get great value, we do a lot of work on intelligence, getting the system to learn your workload and getting the system to be more intelligent in how it uses the hardware as it uses the product.”“We decided if we’re going to bring our product all-flash, let’s make sure we bring it to the next generation of all-flash that can serve the most demanding workflows and take advantage of all the best that’s coming out of the hardware ecosystem,” Gitenstein said. “So we built a platform that’s all Intel, it’s all NVMe…, it’s built for the future. This is a box that’s ready for the next five years and maybe longer. And we did all the work necessary to bring our software to that platform, so right out of the gate – with honestly not a whole lot of performance tuning done yet by our product team – we’re delivering the fastest multi-stream read number of any all-flash file vendor. We’re getting more gigs per second out of every node….”“Flash storage has emerged as a critical element of the modern data center,\" said Scott Sinclair, senior analyst at Enterprise Strategy Group, \"and now NVMe technology is poised to further extend the transformative benefits of flash. Given the value of data in this increasingly digitally-defined economy, more and more unstructured workloads are demanding the performance of flash, while still requiring massive capacity scaling. With storage infrastructure costs an ever-present burden for IT, decision makers need architectures that optimize the critical price-performance ratio of infrastructure while also providing the flexibility to integrate with the public cloud. Qumulo continues to lend innovation to organizations looking to transform their data centers, offering performance, scale, and flexibility as more industries move to a digitally-defined future.”Qumulo said the P-series is generally available today in 23TB and 92TB node sizes. At least four nodes are required for a QF2 cluster.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/Qumulo-QF2-schema-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/Qumulo.logo_.border_1.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/Qumulo-QF2-schema.jpg"
    ]
}