{
    "title": "Hybrid Cloud Dominates as Storage Challenges Mount",
    "text": "The steady enterprise migration to cloud services has users looking beyond the evident advantages of hybrid cloud approaches to consider the importance of attributes such as cloud storage scaling and the wisdom of adopting cloud storage management services.There is broad agreement that the cloud sector, especially hybrid cloud, is booming. Spending on public cloud services alone is expected to grow by an annual rate of 19 percent through 2026 to $522 billion, according to market watcher Wikibon.Moreover, a recent survey of more than 50 cloud providers by Wikibon and released by technology investor North Bridge found that the hybrid model is the most popular cloud strategy at 47 percent, followed by public (30 percent) and private cloud (23 percent). Hybrid cloud blends the best of public cloud scalability with a private cloud cost savings, the survey noted.\"Cloud environments will remain predominantly hybrid in the coming years, enhancing the importance of a clearly defined cloud governance and orchestration strategy to optimize for security, self-service and agility, while minimizing costs,\" added Holly Maloney McConnell of North Bridge. \"The continued growth in the cloud-first enterprise is forcing traditional IT vendors like Oracle (NYSE: ORCL) to accelerate pace of acquisition to fortify their cloud platform strategies.\"Meanwhile, software services remain the most popular cloud technology, followed by infrastructure and platform services, Wikibon found.Data-driven enterprise applications are also driving public and private cloud storage. The cloud survey found that 59 percent of respondents stored more than half of their data in a private could while 28 percent trust the public cloud. Those trends are expected to reverse over the next several years as public cloud security increases.\"This reflects specific benefits the public cloud offers in storage, development/test environments, security and the ability to more easily integrate with analytics,\" North Bridge noted. Nevertheless, the survey notes that multi-cloud strategies continue to emerge as companies look to avoid vendor lock-in and portability issues when switching cloud providers for applications and infrastructure services.Other industry surveys stress the growing need for capabilities such as scalable cloud storage services as more companies embrace hybrid strategies. Elasticity, the ability to quickly scale cloud storage up or down to meet data requirements, has emerged as the top cloud challenge, according to a vendor survey released this week. Enterprise services specialist Zadara Storage, Irvine, Calif., said its survey of European and U.S. IT managers found that 33 percent ranked cloud storage scalability as their top challenge.\"Whether in the public or private cloud, IT decision makers need a flexible, scalable and reliable data storage solution,\" asserted the Zadara Storage survey.Meanwhile, noted Wikibon senior analyst Stuart Miniman, \"broad [software service] adoption, deep analytics and emerging areas such as [Internet of Things] and AI highlight that the value of data is a large consideration when building a cloud strategy.\" George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-02-08 00:00:00",
    "cats": [
        "Cloud",
        "Slider: Cloud",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "cloud storage",
        "Hybrid Cloud",
        "IaaS",
        "private cloud",
        "public cloud",
        "SaaS",
        "storage scaling"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-storage/",
        "https://www.enterpriseai.news/tag/hybrid-cloud/",
        "https://www.enterpriseai.news/tag/iaas/",
        "https://www.enterpriseai.news/tag/private-cloud/",
        "https://www.enterpriseai.news/tag/public-cloud/",
        "https://www.enterpriseai.news/tag/saas/",
        "https://www.enterpriseai.news/tag/storage-scaling/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}