{
    "title": "FPGA-Based Genome Processor Bundles Storage",
    "text": "Bio-processor developer Edico Genome is collaborating with storage specialist Dell EMC to bundle computing and storage platform for analyzing gene-sequencing data.The partners said this week the platform will be based on Edico Genome's DRAGEN processor that uses an FPGA for hardware acceleration. That processor will be integrated with a Dell 4130 server for souped up genome analysis along with Dell EMC's (NYSE: DVMT) Isilon network attached storage for genomic data storage.The bundle is touted as enabling analysis of an entire genome in as little as 22 minutes. Standard software currently requires as much as a day to complete a full genomic analysis. The partners said applications for rapid genomic analysis include faster diagnoses for cancer patients and critically ill newborns along with faster results for drug developers and researchers.Along with the Dell server and Isilon storage, the FPGA-based platform is coupled with the storage giant's Virtustream storage cloud. The genomics platform also supports third-party cloud providers.The DRAGEN processor leverages an FPGA to provide hardware-accelerated implementations of genome pipeline algorithms. Hardware-based algorithms are used for mapping, alignment and sorting of genomic data, San Diego-based Edico Genome said.DRAGEN, which stands for Dynamic Read Analysis for Genomics, is based on a configurable \"bio-IT\" processor architecture. The flexible platform enables development of custom algorithms as well as refining existing algorithm pipelines.The partners noted that the DRAGEN engine addresses unmet computing and storage needs for big data genomics. The result is a scalable platform for secondary analysis used in genomics applications along with cheaper storage of soaring genomic data sets.The FPGA-based platform also addresses the reanalysis of raw sequencing data as updated algorithms and applications are released. That approach has resulted in huge computational loads and associated costs.The other problem addressed by the engine is big data storage, the partners stressed. Raw data files are typically maintained and duplicate copies of files are retained as backups, generating huge data storage requirements for each initial sample.The partners said the bundle is available in three tiers ranging from up to 100 terabytes for applications such as neonatal intensive care units implementing genome-sequencing capabilities to 1 petabyte of data throughput for \"major sequencing centers.\"The DRAGEN engine also is being offered in on-premise, cloud and hybrid cloud versions. The hybrid version allows genomic big data to be processed, stored and moved to the cloud.Dell-EMC said its bundled Isilon storage platform consolidates large, semi-structured file-based workloads into a single system that supports Edico's multiple DRAGEN pipeline workflows. The single volume storage system supports the DRAGEN input formats as well as industry standard output formats.The partners further asserted that the bundled approach reduces the need for clusters of larger servers, thereby reducing costs related to storage space and IT infrastructure.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-01-05 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "dell emc",
        "DRAGEN",
        "Edico Genome",
        "FPGAs",
        "genomic sequencing",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/dell-emc/",
        "https://www.enterpriseai.news/tag/dragen/",
        "https://www.enterpriseai.news/tag/edico-genome/",
        "https://www.enterpriseai.news/tag/fpgas/",
        "https://www.enterpriseai.news/tag/genomic-sequencing/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_genomics-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}