{
    "title": "Western Digital Buys Flash Vendor Tegile",
    "author": "George Leopold",
    "date": "2017-08-30 00:00:00",
    "text": "Consolidation in the enterprise storage sector continues with Western Digital Corp.'s acquisition of Tegile Systems, a provider of flash and persistent memory storage in datacenters.The deal announced Tuesday (Aug. 29) is expected to close during the week of Sept. 4. Others terms of the transaction were not disclosed.Western Digital (NASDAQ: WDC) currently offers a range of storage products under the HGST, SanDisk and WD brands to OEMs and cloud infrastructure providers. (SanDisk acquired flash memory specialist Fusion-io in 2014.) The Tegile acquisition would expand its enterprise portfolio with a range of flash storage options, including its IntelliFlash storage platform.The partners said the acquisition would position San Jose-based Western Digital to meet growing demand in hyper-scale datacenters for scalable platforms that include persistent storage, a key requirement for emerging micro-services based on application container technology.As Western Digital targets big data and fast data applications, it said Tegile's product line would allow it to expand its flash memory-based storage options. The deal also gives the buyer more than 1,700 new customers for its enterprise and cloud-based storage platforms.Western Digital is among the world's largest disk drive manufacturers along with main competitor Seagate Technology (NASDAQ: STX). With its heavy focus on big data storage, Western Digital argues that Tegile's \"fast data\" approach would complement its enterprise datacenter efforts by speeding access to stored data.Phil Bullinger, general manager of Western Digital's Data Center Systems unit, said the Tegile acquisition would allow it to \"expand our product offerings in the fast-growing solid-state and hybrid array segments.\" As all-flash storage arrays make their way into datacenters, the company also said the deal would help it capture a larger share of flash array demand.Western Digital has previously invested in Tegile, Newark, Calif., and the partners have collaborated on engineering integration, disk drive supply chains and joint marketing.The deal for Tegile is the latest in the storage sector. In March, Hewlett Packard Enterprise (NYSE: HPE) acquired flash specialist Nimble Inc. for about $1 billion. HPE said Nimble’s predictive flash offerings would complement its 3PAR data storage systems. HPE is integrating Nimble Storage's predictive analytics platform across its current storage offerings.Other storage players such as Dell Technologies' (NYSE: DVMT) EMC storage unit also have made flash storage acquisitions as they compete against a group of agile storage startups such as Pure Storage (NYSE: PSTG).Earlier this week, Western Digital announced its acquisition of Upthere Inc., a consumer-oriented cloud storage service provider.Meanwhile, the deal for Tegile addresses the growing enterprise requirement for flexible storage options as data volumes soar. \"It’s critical that a storage system today supports both block and file storage protocols and accommodate different types of storage mediums, whether it’s all flash, a mixture of flash and disk, or a mixture of high-performance flash and high-density flash,\" Tegile stressed in releasing an industry storage survey. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/Screen-Shot-2017-05-09-at-2.05.19-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}