{
    "title": "HP Revamps Storage For The New Year",
    "text": "The storage system engineers at Hewlett-Packard are goosing the performance of various arrays this week through a mix of software updates and peppier components. The idea is to make a little noise about storage at the Discover customer and partner event in Barcelona, Spain, and set HP up for some sales in 2014.The 3PAR StoreServ 7450 storage array is getting a flash and software upgrade, and HP is also boosting the capacity and the performance of its StoreOnce backup and StoreAll file and object archiving systems.The StoreServ 7450 is an all-flash array that sits in the middle of the 3PAR product line. At the low-end are the two-node StoreServ 7200 and four-node Store7400 arrays, which are generally used with disks with a smattering of flash because these are aimed at customers working on a tight budget. At the high-end are the two-rack StoreServ 10400 and four-rack StoreServ 10800 arrays, which are designed for maximum capacity scalability. In this case, 1.1 PB in two racks and 2.2 PB in four racks. The StoreServ 7450 has two or four nodes and is aimed at customers who need peak I/O performance out of their arrays.In all cases, the 3PAR arrays are powered by a homegrown ASIC that runs the similarly homegrown 3PAR operating system. None of these technologies were designed inside of HP, but rather come from the company's $2.35 billion acquisition of 3PAR back in September 2010 after a contentious bidding war with Dell. The 3PAR product line is aimed at primary storage workloads and was the pioneer in the use of thin provisioning, which essentially lets a storage array tell an operating system on a server that it has all the extra storage it wants but is actually only giving it what it needs at any given time.Patrick Osborne, senior director of product management for the HP Storage division, tells EnterpriseTech that this line reached a $1 billion annual run rate this past spring and continues to grow. And, Osborne adds, the StoreOnce and StoreAll machines are growing faster as well. Both are based on a combination of technologies that HP got through its acquisition of IBRIX in July 2009 (for an undisclosed amount) and code created by HP Labs to do de-duplication and other functions on the backup and archiving appliances. In both cases, capacity and throughput are equally important. The StoreOnce business added 1,200 new customers in the fiscal fourth quarter of 2013 ended in October, according to Osborne, and had revenue growth of 50 percent in that quarter. StoreOnce is now at an annual run rate of several hundred million dollars. The StoreAll archiving appliances were up 64 percent in the fourth quarter and have just surpassed a $1 billion run rate.These three products are part of HP's revitalized push in the storage arena. The 3PAR and StoreOnce are popular among service providers as well as midrange and enterprise customers, and one marquee customer is package delivery company UPS, which has these machines installed at over 1,000 distribution centers, according to Osborne. One name-brand customer for the new StoreServ 7450 all-flash array is Nuance Communications, which is using the devices for the back-end of Apple's Siri voice response service for iPhones and iPads.The prior iteration of the 3PAR 7450 had 240 GB MLC flash drives and the controller could push about 550,000 I/O operations per second doing random reads of 4 KB blocks of data at an average latency of around 700 milliseconds. The array topped out at 96 TB of capacity. With the upgraded 7450 arrays, HP is shifting to 480 GB and 920 GB MLC flash drives, which boosts the capacity of the four-node array to 220 TB of flash. The 3PAR operating system 3.1.3 release, which will be available in January, has been tweaked to lower the latency to around 500 milliseconds on the 4 KB random read test. The controller in the StoreServ 7450 can now, thanks to the faster flash drives and software improvements, push around 900,000 IOPS. By the way, HP says the new flash drives are 50 percent less expensive than the ones used in earlier models.The updated software also includes a feature called priority optimization, which as the name suggests allows storage administrators to set thresholds for bandwidth, IOPS, or latency for an application or groups of applications to guarantee the performance they can expect out of the StoreServ array. This feature will be available to all 3PAR StoreServ customers who have a maintenance contract with HP when it ships next month, whether they have disk, flash, or a mix of drives.The StoreOnce backup arrays come in three different sizes corresponding to the 2000, 4000, and 6000 series. At the high-end, the new StoreOnce 6500 is based on HP's two-socket ProLiant Gen8 server using Intel's new \"Ivy Bridge-EP\" Xeon E5-2600 v2 processors. These chips have more oomph than the controllers in the StoreOnce backup arrays, not only because of the faster processors but also because they have more memory. Add it all up, and the performance of the 6500 versus the prior 6200 is about 40 percent higher.The new StoreOnce arrays also can use 4 TB nearline SAS disks. The StoreOnce 6500 scales from 120 TB to 2.24 PB of raw capacity, which formats down to 72 TB to 1.73 PB of usable capacity. It can pull in data at 138 TB per hour using HP's Catalyst de-duplication and backup software; they support virtual tape library emulation as well as NFS and CIFS/SMB protocols. The StoreOnce 6500 will be available in January with a starting price of $375,000.The prior generation of StoreAll object storage archiving systems were based on HP's blade servers, but the new StoreAll 8200 is a gateway based on ProLiant Gen8 servers that front end StoreServ 7000 and 10000 series storage arrays that are rebadged the StoreAll 8800. The gateways support NFS and SMB/CIFS protocols for accessing files as well as the OpenStack Swift object storage APIs. The StoreAll 8200 gateway will be available in February for $34,650, and the StoreAll 8800 storage will cost 97 cents per GB of capacity.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2013-12-09 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "3PAR",
        "HP",
        "IBRIX",
        "StoreAll",
        "StoreOnce",
        "StoreServ"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/3par/",
        "https://www.enterpriseai.news/tag/hp/",
        "https://www.enterpriseai.news/tag/ibrix/",
        "https://www.enterpriseai.news/tag/storeall/",
        "https://www.enterpriseai.news/tag/storeonce/",
        "https://www.enterpriseai.news/tag/storeserv/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/12/hp-storage-logo-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/12/hp-storeserv-7450.jpg"
    ]
}