{
    "title": "Oracle Offers Cloud GPU Simulation Service",
    "author": "George Leopold",
    "date": "2018-10-24 00:00:00",
    "text": "Oracle and high-end simulation specialist Altair are expanding their partnership to offer computational fluid dynamics (CFD) services on the Oracle cloud. The HPC simulations would tap into GPU cloud instances and data pipelines recently announced by Oracle and Nvidia.Earlier this month, Oracle (NYSE: ORCL) became the first public cloud vendor to support GPU specialist Nvidia’s HGX-2 “multi-precision computing platform.” That’s a reference to the ability to throttle the GPU for either precision or speed depending on the application.Altair (NASDAQ: ALTR), Troy, Mich., on Wednesday (Oct. 23) released a new CFD service running on the Oracle cloud that packages its vehicle aerodynamics and powertrain simulators. The cloud partnership with Oracle “provides customers the ability to use GPU-based solvers in the cloud for accelerated performance without the need to purchase expensive hardware,” said Sam Mahalingam, CTO of Altair’s for Enterprise Solutions unit.GPU instances are increasingly being offered public cloud vendors for high-end workloads like flow simulations, reducing the time to run complex simulations from days or hours. Along with the ability to use GPU-based solvers in the cloud, Altair noted that Oracle’s cloud storage capabilities based on SSD-based NVMe technology helps reduce the movement of large data volumes.Nvidia’s (NASDAQ: NVDA) GPUs also implement NVSwitch interconnect technology designed to reduce the data bottlenecks often encountered with HPC workloads such as simulations.Altair said its CFD solvers are tuned to Oracle’s cloud to deliver “overnight simulation results” on a single server. The product design software applies simulation and machine learning capabilities used to predict the aerodynamic properties of cars and trucks as well as the performance of rotating gears and shafts in vehicle powertrains.The CFD simulations would leverage Oracle’s recently announced cloud HPC capabilities that include bare-metal GPU instances that include Nvidia’s Tesla Volta V100 and Tesla P100 GPUs along with collaboration with the GPU maker on the new open-source RAPIDS data science training pipeline libraries.RAPIDS is available now on Oracle’s cloud infrastructure via Nvidia’s GPU cloud service.Oracle previously supported Nvidia’s Pascal GPU architecture cloud instances and, more recently, offered bare-metal instances of its Tesla V100 Tensor Core GPUs. Those chips were used to accelerate deep learning workloads.The HPC simulation partnership with Altair is among the latest efforts by Oracle to beef up its cloud offerings as it jockeys for position with other leading public cloud vendors. Earlier this week, Oracle announced support for cloud instances of AMD’s EPYC processor, with immediately availability in Oracle cloud’s eastern U.S. region.  George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/Altair_simulation_800x-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}