{
    "title": "When Buying HCI, Avoid These 3 Mistakes",
    "author": "no author",
    "date": "2018-03-19 00:00:00",
    "text": "The interest in hyperconverged infrastructure (HCI) appliances is widespread, replacing, and in some sense displacing, the hype around all-flash arrays as “the” hot topic in previous years. Organizations are turning to the HCI model due to one key benefit: simplicity. Users are no longer willing – or forced – to spend time on planning, building and implementing three-tier architecture designed around separate servers, storage and networking components. Now there are options that merge these functions into single HCI appliances.However, there also is a sense of urgency to deploy converged systems quickly and in multiple locations, and some IT managers are spending more money than is necessary to achieve their goals.Here are three areas of caution to consider when buying and deploying HCI.Mistake #1: Using a datacenter solution at the edge.Most HCI solutions are designed for datacenter use and can be overkill for edge deployments. Typically, the cost and management required to deploy these data center-class solutions at small, remote edge environments is too high and can be taxing on the IT organization's budget and people.During the RFP stage, customers should ask a few key questions to ensure they are not overbuying solutions that are better suited for large datacenters. First, users should ask about the minimum number of nodes or appliances required to achieve a highly-available solution. If one node or appliance fails, the other automatically takes overall interoperability. Second, they should identify what kind of network is required to operate the local cluster of appliances and the witness server. Many solutions require 1Gbit or 10Gbit connectivity for one or both, and edge environments are often in remote locations where high bandwidth networking isn’t possible. Third, you can review and then decline to add on data center-class features that are not required at the edge. Many solutions come with datacenter features that inevitably raise overall costs and are never used.Mistake #2: Deploying more hardware than is really needed.Since many HCI solutions come as pre-configured appliances, it’s easy to fall into the trap of deploying standard nodes that have either too much CPU, networking or storage than is needed. To remain within constricted budgets, particularly for edge deployments, users should analyze their exact IO, storage and networking requirements to size hardware appropriately and reduce excess waste.IT staff that are stretched for resources turn to HCI appliances for simplicity, but numerous hidden costs can break the bank. For example, if additional storage capacity or performance is needed, customers find out too late they have to buy a whole new appliance or node – plus licensing fees – to effectively expand the cluster. This means that digging into the details of the high-availability cluster quorum management requirements and the remote witness hardware requirements are imperative. Some remote witness solutions require a 1:1 relationship (i.e. one witness for each site) and have strict hardware requirements. If users aren’t careful, they can spend a large chunk of unnecessary budget on witness hardware alone.Mistake # 3: Using all-flash when it’s not really needed.All-flash arrays and hyperconverged appliances are touted by vendors for “extreme performance.” However, not all applications require this and comes at a high cost since flash is typically 10X the cost of disk drives. Users should investigate auto-tiering or caching software that can better optimize data placement between flash, spinning disk and, in some cases, even system memory to deliver the same performance without  paying a premium.The bells, whistles and speeds of all-flash arrays makes sense for specific applications that require extremely high performance (e.g. financial services, HPC environments, reservation systems, etc.). But for everyday applications that just need good performing, a mix of storage media performs well at a fraction of the cost.Future Outlook: HCI Buying and Deployment CyclesSo what could the future hold for HCI buying and deployment cycles? According to MarketsandMarkets Research, the HCI market is expected to reach $13 billion by 2022, a CAGR of 44 percent. With a bit of homework, IT staffs can find the right balance to deploy HCI appliances in multiple locations without over-provisioning – or breaking the budget. Your vendor will be able to analyze your IO and storage requirements and recommend the appropriately sized system to meet your storage needs at the edge.Luke Pruen is technical services director at StorMagic.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/Intel-Data-Center-370x290.jpg"
    ]
}