{
    "title": "VMware Lets Virtual SAN Software Out In Public",
    "text": "If there is one thing that companies installing private clouds or virtual desktop infrastructure don't want to do, it is shell out a lot of money to buy a storage area network to handle the storage needs for the servers in those clusters. SANs are expensive, even if they are fast and often have a lot of useful software running on their controllers.After much grousing from customers and with the onslaught of a number of clustered file systems that use X86 servers to make an array that functions, more or less, like a SAN, VMware's engineers cooked up their own. The product is called Virtual SAN, and it has just entered public beta testing.VMware did a baby virtual storage array, called the Virtual Storage Array in keeping with its perfectly obvious product naming, that could span three server nodes and offer local storage for virtual machines running atop an ESXi hypervisor on those physical servers.Virtual SAN, or vSAN for short, has a much wider scalability, and is meant to span a single vSphere cluster domain, which currently maxes out at 32 physical servers hosting a maximum of 4,000 virtual machines. The servers underpinning the ESXi hosts should probably have flash storage of some kind, since the vSAN software is designed to use it as read and write caching to boost its performance; persistent storage is done on disk drives running in the servers. You need the ESXi 5.5 hypervisor to implement the vSAN, and that software just started shipping, as EnterpriseTech previously reported. VMware is recommending that Ethernet links running at 10 Gb/sec be set up between the servers to get decent performance with vSAN, but you can use 1 Gb/sec Ethernet and it will still work. Each server node needs to have one disk drive and one flash SSD. VMware says that at least 10 percent of the capacity on the machines should be flash for decent performance. During the beta, the vSAN will be limited to only eight nodes, but the production version will scale up to the full 32 nodes.VMware expects for vSAN to be ready for commercial deployments sometime in the first half of next year. Pricing is not yet available, and with EMC as a storage partner and its parent company, you can bet there are plenty of conversations about how to price vSAN going on. What VMware has said is that there will be two editions of the software. The Advanced Edition will allow an unlimited amount of flash capacity and have higher performance than the Standard Edition, which will have its flash cache capped at 300 GB per server node.You can participate in the vSAN public beta at this link.Pingback: Big Banks Discover Atlantis Storage VirtualizationPingback: Users Line Up For VMware Virtual SAN StoragePingback: VMware Takes On Hyperconvergence Upstarts With EVO:RAIL",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2013-09-24 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "SAN",
        "Virtualization",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/san/",
        "https://www.enterpriseai.news/tag/virtualization/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/vmware-virtual-san-300x212.jpg"
    ]
}