{
    "title": "Seagate Seeks to Drive Down Flash Costs",
    "text": "The number of all-flash storage options continues to grow as datacenters burst at the seams and operators look for ways to connect legacy and flash storage while reducing cost.The latest entry comes from Seagate Technology (NASDAQ: STX), which like other purveyors of all-flash arrays claims to have made the performance gains of all-flash storage arrays more affordable. The storage specialist rolled out its latest series of all-flash storage and hybrid storage arrays this week, positioning them as \"complementary to existing [hard-disk drive] investments….\"Seagate, Cupertino, Calif., cites market research on the critical price points for all-flash storage, noting that systems priced at under $100,000 have yet to take off even as analysts peg the all-flash array market at nearly $9.3 billion by 2020.Pricing for Seagate's RealStor arrays with 20 Tb of flash storage capacity and 300,000 IOPS starts at less than $50,000, the company said Monday (April 3). The vendor also emphasizes backward compatibility with legacy hard drive storage, noting that its new flash arrays use \"auto-tiering\" to move data to either flash or hard drives depending on application requirements.That approach, the company noted in a blog post, underscores \"the complementary nature of flash and HDDs in enterprise and cloud deployments.\"The latest RealStor series includes an entry-level version available in what the company calls \"three personalities\": an all-flash version, a hybrid array that mixes flash with hard drive storage and an all-HDD array. The hybrid variant automatically \"promotes\" data to flash storage if faster access is required, otherwise maintaining storage in cheaper hard drives.Seagate's high-end version targets demanding datacenter workloads requiring speed and low latency (as much as sub-300 microseconds for 300,000 IOPS). Performance can be ramped to as much as 400,000 IOPS with 1-millisecond latency, the company added.Seagate's RealStor 5 series is available now.The company followed the all-flash storage rollout with the release a white paper that attempts to quantify the global data explosion. The IDC study commissioned by Seagate predicts a ten-fold boom in global data reaching 163 zettabytes by 2025.Among the drivers of storage requirements are embedded systems and the Internet of Things, streaming and real-time data along with the emergence of machine learning as a data analytics tool. Seagate and other data storage specialist see data analytics as the next big opportunity that could further drive down the cost of all-flash arrays.\"The value of data is really not in the ‘known’, but in the ‘unknown’ where we are vastly underestimating the potentials today,\" noted Seagate CEO Steve Luczo.Added IDC's Dave Reinsel: \"Technology innovation will be vitally important to evaluate and fully activate the intricacies of what’s contained within this large volume of data—and storage in particular will continue to grow in importance.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-04-04 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "Big Data",
        "hybrid arrays",
        "Seagate",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/big-data/",
        "https://www.enterpriseai.news/tag/hybrid-arrays/",
        "https://www.enterpriseai.news/tag/seagate/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}