{
    "title": "Storage Security Emerges Along With Flash",
    "author": "George Leopold",
    "date": "2017-04-11 00:00:00",
    "text": "The vibrant storage sector is churning out a steady stream of products, tools and network platforms as datacenter operators struggle to keep up with and secure torrents of terabytes.Much of the focus in storage technology development focuses on hyper-converged infrastructure as datacenter operators look to cut costs while boosting performance. Baked-in security and new management tools also are emerging as storage volumes soar.Claiming to address these requirements is VMware, Inc. (NYSE: VMW), which on Tuesday (April 11) released version 6.6 of its virtual storage area network platform. Along with new \"native security\" features including encryption of data at rest, the storage platform incorporates Intel Corp.'s 3D Xpoint flash memory technology.Intel (NASDAQ: INTC) announced its first Optane SSDs based on 3D Xpoint memory in mid-March. VMware asserts the new Optane drives would boost \"sequential-write\" application performance by as much as 250 percent. The company said it has been working closely with the chipmaker, making it the first infrastructure vendor to support Optane SSDs.VMware's vSAN product line has quickly evolved over the last year to support all-flash arrays along with support for cloud native applications and application containers. The latest version reflects steady improvements in storage performance along with infrastructure considerations such as native security and what VMware calls \"stretched\" clusters.That capability is intended to lower operating costs by boosting storage availability with \"disk group protection\" in the event of a server failure. The feature copies data so that workloads would continue running at a separate site, Michael Haag, VMware's group manager for product marketing, explained in an interview.Meanwhile, vSAN native security features are based on encryption of data at rest that uses key management to prevent unauthorized access. The approach is said to reduce hardware costs by replacing more expensive self-encrypting drives, the company claims.The data encryption features respond to an alarming increase in hacks that are forcing datacenter operators to consider integrated data security and governance features as they link legacy storage with emerging virtualized storage and hyper-converged approaches.As with many storage vendors, VMware also is adding cloud analytics capabilities that leverage flash memory performance. New data service algorithms are said to accelerate flash performance for cloud native and other applications. The data service adds support for workloads such as Hadoop and Splunk, among others.The all-flash upgrade also targets database workloads as well as Docker containers, Haag noted.VMware said vSAN 6.6 is expected to be available by May 5. The storage platform's list price starts at $2,495 per CPU, the company added.The latest vSAN release follows VMware's announcement last week that it sold its vCloud Air business to French cloud provider OVH. VMware CEO Pat Gelsinger said the deal extends its partnership with OVH to give its customers access to OVH's global operations while retaining access to VMware's software-defined datacenter technologies.Meanwhile, a steady stream of storage network platforms are seeking to leverage flash technology while adding new features such as analytics engines. For example, Cisco Systems (NASDAQ: CSCO) unveiled a high-bandwidth storage area network this week that along with flash storage addresses networking bottlenecks with a 32-Gb fibre channel switching module. Cisco is pitching its storage networking approach as a platform for real-time data analytics.The company said its storage-networking director would be available beginning in May. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-02-at-11.55.26-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}