{
    "title": "Data-Driven Business and Performance-Driven Storage",
    "author": "no author",
    "date": "2019-06-27 00:00:00",
    "text": "Board game maker TriBond published a popular game in the 1960s: “What Do These 3 Have in Common?” Sometimes, the answer was straightforward; for example what do a car, tree, and elephant have in common? At greater levels of difficulty, the answer could be more abstract. The best part of the game was that it made players think about similarities amongst random things.Along those lines, let’s discuss what three dynamic, highly differentiated industries – media and entertainment, life science, and automotive – have in common. Because the output of each is radically different, whether it be the latest Hollywood blockbuster, the newest treatment for Alzheimer’s, or the latest advancement in autonomous vehicle development.So what could these three industries have in common? At their core, they each have data-driven operations that are built on working with, preserving and protecting massive amounts of digital content.The Shared Requirement: Work, Preserve, ProtectAll three of these industries share requirements to work with the data they collect, preserve it for months or years, and protect it due to its inherent value. If they fall short in any one of these areas, their business would suffer immense consequences. Therefore, the importance of getting this right is paramount. However, given the velocity at which new data is being acquired, the volume of data under management, and the value to the business, finding an underlying storage system that supports each requirement can be a challenge.Working with the DataIn the life sciences, processes like genome sequencing require massive storage, high resolution analysis, and fast performance. Autonomous vehicle development also needs high performance. Each driverless car on the road produces TBs of data per day, which the central repository ingests at high speed. Once the data is stored, high performance processing generates data reference sets, which continually improve software algorithms for better safety and accuracy.Video editing also requires fast performance to produce high-resolution digital content. 4K resolution has already gone mainstream, and broadcasters will be playing out 8K as early as next year for the 2020 Olympics. Editorial teams also must have access to this data across geographies as different groups of individuals work remotely based on their area of expertise.Recommended Storage Solution: To accelerate this critical stage of the media workflow, invest in a storage system that can provide high levels of performance where and when it is needed most, and provide flexible accessibility options so that users can access all data in one global namespace no matter where they are located. Preserving the DataAfter all the luster and shine is stripped away, at their core, media organizations are in the digital content creation business. To make a profit, all media businesses must do all they can to monetize this valuable content. For example, sports video organizations produce historic content for marketing, brand loyalty, and monetization. Storage systems must not only have the capacity to store these fast-growing digital files, but allow users to quickly locate archived data and turn it into new content.In life sciences, archiving enables researchers to validate their research methodology and stay in compliance with government regulations. Researchers can access archived data to feed new research and products.Regulations require autonomous vehicle researchers to keep 20 years’ worth of test data. It’s not enough to simply store-and-forget; engineers need to quickly locate archived data to prove compliance and to defend themselves in liability proceedings. Archived data also lets research teams validate research methodology and preserve original log data for new research.Recommended Storage Solution: Preserving such massive amounts of data cost effectively requires a storage solution that can tier these volumes to capacity optimized storage infrastructure. Storage with this kind of attribute can be either on-premise tape libraries or off-premise cloud archives. Look for a solution that has the flexibility to offer both as an archive, as each is optimal for various use cases. This will help keep costs under control, yet data always accessible. Protecting the DataDigital content is at constant risk of being lost due to hardware or software failure, data corruption, natural disasters, user error, and even malware attacks. Cyber threats are especially troubling, and even large enterprises are not immune. In 2014 a bad actor hacked Sony’s network storage infrastructure and network. The widespread hack caused millions of dollars in damage and extreme reputation loss.For life sciences and automotive industries, losing data is also a disaster. Both industries depend on the ability to verify original data: life sciences to validate and recreate research, and automotive for compliance and liability protection. Neither industry can withstand a large data loss without suffering major business loss.Recommended Storage Solution: To safe guard against losing data, having a file system with the capability to automatically make copies of data, as well as the possibility to make one of those copies offsite and offline, is especially important. Implementing such a strategy can significantly help protect data against disaster, error, failure, and malware. Data Storage: The Technical Foundation of Modern BusinessStorage systems make or break the ability to work with, preserve, and protect digital content. Given the size and scale of these data sets, the need to access them continually and remotely, and do so at high-speed requires significant functionality. Only the most modern, advanced file systems can provide such capability, with the flexibility required to support a workflow optimized storage configuration.With more and more businesses becoming data-driven, the underlying technologies that support these operations will heavily impact productivity and bottom lines. Under investing in the right storage solution not only impacts today’s operations, but also the ability of the business to respond and grow relative to new opportunities in the future. So although enterprise-grade, highly available, high performance shared storage is not inexpensive, an investment in the right solution can yield extremely high ROI as it supports the foundation of modern business operations today.\n\nJason Coari is director, high-performance storage solutions, Quantum.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/data-storage-shutterstock-1085748272-370x290.jpg"
    ]
}