{
    "title": "Cost, Security Issues Persist Amid Cloud Boom",
    "text": "The billowing cloud market that is growing at an estimated 40 percent annually is being driven to new heights by the enterprise embrace of multi-cloud strategies along with a shift toward cloud native technologies ranging from application containers and serverless computing to analytics and machine learning.Those are among the key findings of the latest public cloud survey released this week by cloud management vendor Botmetric. For now, the survey found, infrastructure services ranging from storage to databases dominate, accounting for more than 85 percent of enterprise cloud spending.However, Botmetric reports that platform services continue to expand, including API management, deploying distributed applications in containers and security. Platform-as-a-Service \"offerings from cloud providers are gaining increasing momentum,\" concluded the survey released on Thursday (Nov. 30.)Cloud adoption patterns revealed in the survey confirm the decided enterprise shift to hybrid and multi-cloud adoption. Eight-three percent of enterprise customers polled said they are \"actively exploring\" hybrid cloud deployments. Meanwhile, 70 percent of mid-sized companies (with annual revenues between $50 million and $1 billion) are pursuing multi-cloud strategies as they hedge bets against overreliance on public cloud giant Amazon Web Services (NASDAQ: AMZN).\"The [Microsoft] Azure and Google cloud influence was very evident in 2017 from the adoption,\" the survey noted. Medium-size companies—which the survey refers to as \"masters of the public cloud\"—use multi-cloud strategies \"to achieve specific functional workloads that enables faster delivery on projects, handle software licensing and manage business needs.\"As deployment of multiple public clouds and public-private infrastructure accelerates, enterprises are also struggling to contain costs. Botmetric reports that reining in cloud spending remains a priority for 77 percent of enterprise cloud users.And as more data is stored and crunched in the cloud, recent adopters cite cloud security as a priority. Nevertheless, the survey found that 78 percent of small and medium-sized companies use un-encrypted endpoints in the cloud and datacenters. That percentage is likely to drop as strict data governance rules take effect in the coming year.Insecure network interfaces and access controls were cited as the main cloud security challenges. The survey also noted that security breaches involving databases and object stores such as Amazon Simple Storage Service almost tripled in 2017.The market for cloud surveys is as vibrant as the technology being analyzed, especially for cloud management vendors such as Botmetric, Santa Clara, Calif. In October, for example, Synergy Research Group compiled third quarter financial reports from leading public cloud vendors and reported the cloud market is growing at a 40 percent annual clip.The market researcher reported that quarterly cloud infrastructures service revenues (including infrastructure and platform services as well as hosted private cloud services) reached $12 billion.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-12-01 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Networks",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "AWS S3",
        "Botmetric",
        "cloud adoption",
        "cloud security",
        "cost management",
        "Hybrid Cloud",
        "multi-cloud"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/aws-s3/",
        "https://www.enterpriseai.news/tag/botmetric/",
        "https://www.enterpriseai.news/tag/cloud-adoption/",
        "https://www.enterpriseai.news/tag/cloud-security/",
        "https://www.enterpriseai.news/tag/cost-management/",
        "https://www.enterpriseai.news/tag/hybrid-cloud/",
        "https://www.enterpriseai.news/tag/multi-cloud/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/digital-cloud-shutterstock_105017696-800x-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}