{
    "title": "AI, Machine Learning Among Top Cloud Workloads",
    "author": "George Leopold",
    "date": "2017-10-27 00:00:00",
    "text": "More evidence is emerging of the inexorable shift of analytics and related workloads to the cloud, with adopters feeling more confident about hybrid infrastructure in their search for ways to become more agile, a new cloud study finds.While a sizeable number of executives remain skeptical that proprietary data will remain secure in the cloud, the Google-sponsored survey released this week by a unit of MIT’s Sloan Management Review found “increased confidence in cloud security.” Asked about their level of trust in the security of cloud applications and infrastructure over the last two years, the survey found that 74 percent of respondents said it has increased.The rise of data analytics, the unending need for greater storage capacity and increased collaboration are driving more analytics workloads to the cloud. The survey found that machine learning and AI are the fastest growing cloud-based workloads, with deployments expected to nearly double by 2019.As cloud security increases, data storage is the top cloud workload followed by collaboration tools and application development. Also in the mix were data analytics and Internet of Things (IoT) workloads, the survey found. Asked which workloads will be moved to the cloud over the next two years, 56 percent of respondents cited machine learning and AI.Stuart Madnick, a professor at MIT’s Sloan School of Management, told the survey authors that cloud adopters could gain greater benefits by combining cloud services with a web services framework that enables the sharing of critical data inside organizations and with business partners.The deluge of IoT sensor data also is expected to accelerate enterprise cloud adoption over the next two years. Data from connected IoT devices along with “employee-generated records” are expected to be the two most deployed data types through 2019. That sensor data only adds to the flood of unstructured data enterprises are storing in the cloud, the survey notes.Those deploying AI and machine learning workloads in the cloud cited flexibility, speed and the ability to integrate those workloads with emerging tools and platforms. “Machine learning is a natural fit for the flexibility, scalability and integration capabilities provided by the cloud because it requires so much data and computing power,” the authors asserted.Still, the survey found “pockets of skepticism” among senior executives of large companies about the ability of cloud infrastructure to protect critical data from unauthorized access. Skeptics are also increasingly worried about auditing and compliance with tighter data privacy regulations, according to the survey.Sixty-three percent of cloud skeptics said they remain worried about data security in the cloud while 41 percent were still not convinced workloads would run securely in the cloud.The survey urges cloud providers to allay these concerns by offering libraries of analytical algorithms along with APIs that would make it easier to exchange data among cloud providers.Google (NASDAQ: GOOGL) said it received 509 survey responses from CIOs and senior executives. The cloud security survey was conducted in June.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/digital-cloud-shutterstock_105017696-800x-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}