{
    "title": "Cumulus Networks, HPE Team on Open Net Storage",
    "author": "no author",
    "date": "2020-01-08 00:00:00",
    "text": "The shift to open networking platforms is getting another boost with a partnership between software vendor Cumulus Networks and Hewlett Packard Enterprise to provide storage networking frameworks in datacenters.The partners said this week that HPE’s (NYSE: HPE) StoreFabric Ethernet switches will run on Cumulus Network’s Linux and NetQ software. The latter is a network monitoring tool described as a telemetry-based fabric validation system. The switching and networking monitoring combination are billed as providing a scalable networking fabric for high-end datacenter workloads ranging from AI to Internet of Things applications.The partners emphasized that legacy storage networks are groaning under the weight of those and other high-end applications that increasingly require all-flash storage and greater automation. The solution, they add, is an open, fully automated storage networking fabric aimed at scaling datacenter operations.Founded by networking engineers from Cisco Systems (NASDAQ: CSCO) and VMware (NYSE: VMW), Cumulus Networks, has been introducing a steady stream of new switching hardware and open networking software. The list includes networking appliances that target web-scale networking adopters. Among them was an appliance offering 1G through 100G platforms pre-packaged with Linux OS features and accompanying gear.The partners are aiming switching gear and networking software at primary, hyper-converged, network-attached and object storage systems with the option of fielding the open networking approach on what they call a “Ethernet Storage Fabric.”Cumulus Networks, Mountain View, Calif., has so far raised about $130 million in venture funding. Those investments reflect the growing momentum of open networking efforts such as the Open Compute Project designed to encourage networking vendors to offer standard platforms that work with a variety of network operating systems.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/Primera_architecture-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}