{
    "title": "Seagate Buys Xyratex To Build Out Enterprise Array Business",
    "text": "Seagate Technology is one of the three suppliers of disk drives in the world alongside Western Digital and Toshiba, and now it is getting into the enterprise disk array business by virtue of its deal to acquire Xyratex. The deal, which is expected to close in May or June, will also give Seagate a separate but related business making and selling equipment to test disk drives.Seagate is paying $374 million in cash to acquire Xyratex, which is a 27 percent premium over the price that Xyratex shares were trading prior to the announcement of the acquisition.Neither Seagate nor Xyratex, which are public companies, can say much about their plans for the various Xyratex units until the deal closes. But what is clear is that Seagate will have to carefully balance its desire to integrate its own disk and hybrid disk/flash drives tightly with Xyratex OEM storage enclosures and ClusterStor Lustre-based disk arrays against what we presume are customers' desires to have multiple sources for disks from their array makers.To that end, Seagate did say in a statement announcing the deal that it would operate Xyratex as a standalone entity and would \"focus on opportunities to improve and expand the business.\"The largest part of the Xyratex business is supplying OEM disk enclosures, which are put through three weeks of \"shake and bake\" thermal testing before they ship out to customers. This disk enclosure business was set up in 1998 and represents approximately $700 million of the expected $1.1 billion in sales that Xyratex will book in 2013, Larry Jones, vice president of product management, tells EnterpriseTech. Xyratex was formed from a management buyout of disk manufacturing and testing operations at an IBM facility in Havant, England in 1994, and it currently ships approximately 3,000 PB of disk enclosures to OEM customers a year. Xyratex has shipped 1.5 million enclosures and 14,000 PB of capacity since 2002.One issue that Xyratex has been coping with is that NetApp has been winding down its OEM deal for disk enclosures, and that has put pressure on revenues even as Dell, IBM, Hewlett-Packard, Oracle, Cray, and others buy its storage shelves as the basis of their own storage arrays.Xyratex launched its first ClusterStor arrays, which run the Lustre file system, at the end of 2010 and shipped them in June 2011. These arrays have their origins in a company called ClusterStor that was founded by Lustre creator Peter Braam and whose assets ClusterStor acquired early in 2010.Xyratex reckons that the total addressable market for arrays aimed at traditional HPC shops was around $2 billion in 2013, with an additional $1 billion market for big data/analytics and storage clouds combined and another $2 billion for high-end computing in the financial services, energy, life sciences, defense, and pharmaceuticals industries.During SC13 last November, Xyratex was previewing its next-generation ClusterStor 9000 arrays, which will run the latest Lustre 2.5 file system when they come to market sometime in the first half of 2014 and which are aimed at all three of the market segments outlined above.The ClusterStor 9000s will have their controller brains upgraded to the latest \"Ivy Bridge-EP\" Xeon E5 processors from Intel, and these controllers are based on a single-socket motherboard with redundant boards in each storage server for high availability. The upcoming ClusterStor 9000s will also have two solid state flash drives for each array and will use software called Flash Xcelerator to host files that are smaller than 64 KB on that flash. While Lustre knows how to handle large files well, it struggles when it has to deal with large numbers of small files, and Flash Xcelerator will give balanced performance across all file size types, says Jones.The ClusterStor software stack, which is based on a stripped down version of Scientific Linux 6.2, also includes a new feature called Grid RAID, which is a way of spreading parity data for drive recovery across 40 disk drives in a pool instead of doing the normal thing, which would be to have separate RAID 6 groups across each set of ten disk drives in the array. Using 6 TB drives, Grid RAID can recover a disk in 9.5 hours compared to 33.3 hours for a traditional RAID 6 setup. The ClusterStor 9000s will also sport ClusterStor Manager 1.4, which allows the Lustre file system and underlying hardware to be managed and monitored from a single pane of glass.In terms of hardware, here is what the ClusterStor 9000s look like:Add it all up, and the ClusterStor 9000 will be able to pump data at 9 GB/sec out of each of the scalable storage units shown above, which is 50 percent higher than the previous ClusterStor 6000 arrays.Xyratex is not providing pricing for the ClusterStor 9000s yet, but generally speaking, Jones says that a Lustre array costs around $500 per TB, with larger arrays costing even less. This is roughly on par, by the way, with what it costs to build a Hadoop system for storing unstructured data.\"Ultimately, the way most customers think about it, they are worried about how they feed the beast,\" says Jones. \"They probably spend something on the order of 80 percent of their budget on the compute side, and if you do not provide sufficient storage I/O, then basically what you have bought is a big, expensive toaster.\"With the Xyratex acquisition, Seagate is now a player in the Lustre community as well as a significant OEM supplier of raw disk storage shelves. The company will have to tread carefully with other Lustre array makers, notably DataDirect Networks, NetApp, and Terascala, who sell into both the HPC and enterprise markets, as well as other disk array makers peddling other file systems, such as IBM with its various arrays running its GPFS alternative to Lustre. The one thing that Seagate does not want to do is in any way jeopardize its disk supply contracts with array makers. Similarly, while Seagate will now have control of the testing gear for disk components and finished drives that it can weave into its supply chain to help make its products more reliable, Xyratex sells this equipment to other disk makers who compete with Seagate and presumably it will continue to do so. This is why Seagate will be operating Xyratex as a standalone unit.Seagate expects for the Xyratex business to generate somewhere between $500 million and $600 million in revenues for Seagate's fiscal 2015, which ends in June of that year, with a neutral impact on earnings. That will be the first full year of sales once the Xyratex deal closes. According to a spokesperson for Seagate investor relations, these revenue estimates do not include a big drop in sales for Xyratex, but rather take into account the fact that Seagate was a big buyer of Xyratex testing equipment and Xyratex was a big buyer of Seagate disk drives. Those revenue estimates wash those effects against each other and presumably include expected declines in sales to NetApp as well.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-01-03 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "lustre",
        "Seagate",
        "Xyratex"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/lustre/",
        "https://www.enterpriseai.news/tag/seagate/",
        "https://www.enterpriseai.news/tag/xyratex/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/seagate-disk-drive-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/xyratex-clusterstor-9000.jpg"
    ]
}