{
    "title": "Whiptail Flash Is About Revving Compute, Says Cisco",
    "author": "Timothy Prickett Morgan",
    "date": "2013-10-10 00:00:00",
    "text": "There has been a lot of talk since Cisco Systems acquired flash array startup Whiptail for $415 million a month ago. Everyone wants to know if the networking giant is going to take on the incumbents in storage as it has done in servers. The answer, say executives from both Cisco and its Virtual Computing Environment partnership with EMC, is no.Whiptail flash storage, oddly enough, is not so much about fast storage as it is about accelerating compute.\"That tier of persistent storage is becoming a part of the compute tier,\" says Todd Brannon, director of product marketing for Cisco's Unified Computing System line. \"We don't view it as us entering the storage market. The dominant use case for our customers is still going to be the SAN. We will still go to market with EMC, Hitachi, and NetApp.\"To prove the point, Brannon said Cisco has no intention of selling the Whiptail flash arrays as standalone products. Rather, the idea is to tightly integrate the Whiptail flash arrays with the UCS system, which includes servers and networking integrated with a chassis under a single management framework. Those servers reach out to persistent storage, such as SAN and NAS arrays, through the Fibre Channel over Ethernet (FCoE) protocol running over the 10 Gb/sec Ethernet switch embedded in the chassis.One of the points that competitors in the converged systems business make about Cisco's UCS is that it does not have storage integrated into the system, but rather has storage as an external feature. (This, of course, also allows for customer choice, so this can be viewed as a plus, too.) The amount of I/O operations per second (IOPS, in the storage parlance) and raw capacity of the Whiptail products is, nonetheless, very large and in many cases may obviate the need for external storage, particularly for workloads where speed is everything and the data sets are small. Think of virtual desktop infrastructure with de-duplication technology to radically cut down the amount of capacity to serve up virtual desktops from the data center. Or any highly virtualized workload that has similar software stacks inside of virtual machines, for that matter.Whiptail has two main products. The Accela family, which is probably the most useful one for UCS customers at the get-go, comes in a 2U rack enclosure and offers from 3 TB to 12 TB of multi-level cell (MLC) flash. The flash comes with a seven-year wear warranty, something Whiptail says it can provide because of its own wear-leveling algorithms inside of its flash controller. It supports 10 Gb/sec Ethernet, 4 Gb/sec and 8 Gb/sec Fibre Channel, and 40 Gb/sec InfiniBand interfaces out to servers, and can deliver 250,000 read and 200,000 write I/O operations per second of performance. Windows, Linux, and Solaris operating systems can see the device, as can the VMware ESXi and Citrix Systems XenServer hypervisors. Both the B Series blade servers and the C Series rack servers in the UCS family will be able to hook into Whiptail devices.For very heavy duty flash capacity and I/O needs, Cisco now has the Invicta series that it can deploy. These Whiptail devices cluster up multiple flash arrays, including from 2 to 30 storage nodes and from 2 to 6 controller nodes, to create a monster flash array that scales from 6 TB all the way out to 360 TB and delivers between 300,000 and 4 million IOPS. The base machine takes up 2U of rack space and the full Invicta configuration takes up two racks by itself.The crucial part of the Whiptail acquisition, says Brannon, is that the Whiptail devices have a set of APIs to provide access to the flash array control plane, and this can be hooked into the UCS Manager software running inside the UCS switch and allow for the direct provision of flash storage capacity for compute nodes from within UCS Manager.The VCE partnership, which peddles UCS machines called Vblocks preconfigured with EMC storage arrays and VMware server virtualization hypervisors, is welcoming the Whiptail devices, no matter what EMC itself might be thinking.\"From our perspective, that's a good thing,\" says Todd Pavone, executive vice president of product development and strategy at VCE. \"Once that integration is done, we will take it from Cisco and we just got a better UCS system with better technology.\"Obviously, EMC has its own flash products and would love for these to be integrated deeply with UCS iron. EMC has its XtremeSF server-side flash, which plugs into the PCI slots of servers and which acts as a very fast storage tier or a very slow memory tier for compute, depending on how you want to look at it. EMC also sells the XtremIO all-flash arrays, which it got through its acquisition of the Israeli company of the same name back in May 2012 for $430 million. These devices are most like the Whiptail storage, and could have been used as a flash pool for UCS blades and racks.Instead, Cisco has decided that flash storage is part of compute, not persistent storage. And this will be borne out again if flash-based memory sticks, called Memory Channel Storage, which are being developed by Diablo Technologies, become popular. While Fibre Channel links out to flash arrays are great, having smaller chunks of flash right there on the memory bus will be even faster and presumably more cost-effective than buying main memory for the same performance or capacity. The Diablo MCS sticks come in 200 GB and 400 GB capacities and are being readied for market now.Another reason to buy Whiptail is that the pool of engineers who understand flash memory and all of its many eccentricities is small and the demand is high. That was the view of Kevin Rowett, who just retired from heading up engineering at Violin Memory, another flash array provider. Rowett spoke about the issues of enterprise-class flash array development at the Hot Chips 25 conference at Stanford University at the end of August.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/cisco-hq-370x290.jpg"
    ]
}