{
    "title": "IBM Doubles Up All-Flash Arrays, Texas Style",
    "author": "Timothy Prickett Morgan",
    "date": "2014-01-17 00:00:00",
    "text": "The first fruits of IBM's labors after the acquisition of Texas Memory Systems back in August have come to market, and the new FlashSystem 840 is the first all-flash array from Big Blue that breaks the 1 million I/O operations per second barrier.To be precise, a fully loaded FlashSystem 840 using 4 KB files in benchmark tests (more or less the standard for disk and flash arrays) is able to sustain 1.1 million IOPs on a random read workload that is 100 percent reads. It can handle 600,000 IOPS on 100 percent random writes – flash does worse on writing than reading – and about 775,000 IOPS on a mixed workload that is 70 percent random reads and 30 percent random writes. With 256 KB files on sequential data, the FlashSystem 840 can sustain 8 GB/sec of bandwidth on totally percent reads and 4 GB/sec on completely random writes.This is a lot of I/O performance to pack into a 2U enclosure, but it is by no means the densest all-flash array on the market. The fact that it is sold by Big Blue, which has systems in the majority of the top 5,000 IT accounts worldwide, so integration with IBM's servers and operating systems is perhaps as important as storage density and price for a lot of customers. You can always negotiate on the price, but you cannot do so for AIX, IBM i, or z/OS support on the arrays from other storage vendors.The existing FlashSystem 820, which is a rebranded RamSan flash array that IBM got from the Texas Memory Systems deal, packed up to 24 TB of enterprise-grade, multi-level cell NAND flash storage into a 1U enclosure. It had a minimum write latency of 25 microseconds and a minimum read latency of 110 microseconds.The new FlashSystem 840 puts up to 48 TB of eMLC NAND flash into a 2U chassis. While the system is no denser, it has twice the capacity and a lot more I/O bandwidth, as well as additional reliability features compared to its predecessor. The minimum write latency is around 90 microseconds and the minimum read latency is around 135 microseconds, so the flash is a bit slower in the newer array. But the FlashSystem 840 makes it up in IOPS volume for random data access and in sustained bandwidth for sequential data. The IOPS are a little more than twice as high, the sequential read bandwidth is about 60 percent higher, and the sequential write bandwidth is about 43 percent higher.The FlashSystem 840 has room for a dozen hot-swappable flash modules, which come in 2 TB and 4 TB capacities. The switch to the 2U form factor allowed for IBM to switch to this modular form factor, which is a better form factor than the prior flash modules employed by Texas Memory Systems. To change the capacity on the FlashSystem 820 and its single-level cell baby brother, the FlashSystem 720, you had to slide the enclosure out of the array and lift off the cover. Moreover, by going modular, if a chunk of the flash memory fails, it can be removed without taking the system down. The FlashSystem 820 had a hot spare flash module inside in the event of failures.The new all-flash array has two battery modules in the front and two I/O canisters that slot into the back of the array. The array also has redundant power supplies. Here's what the back looks like:Each canister has two fan modules to cool the flash as well as a RAID controller for data protection, two network interface cards to link the FlashSystem 840 to servers, and a separate management controller with its own Ethernet port. The four Fibre Channel interface cards for the two canisters can support sixteen ports running at 8 Gb/sec (these ports can step down to 4 Gb/sec speeds if need be to interface with older server adapter cards); it also supports eight ports running at 16 Gb/sec. There is an InfiniBand adapter card for the FlashSystem 840 that has two ports running at 40 Gb/sec, and four of these fit into the two canisters. Yet another 10 Gb/sec Ethernet adapter card with four ports per card can run raw Ethernet or the Fibre Channel over Ethernet (FCoE) protocol, and four of these slide into the two canisters. You can, of course, mix and match connectivity as your servers require.The flash controllers inside the box support RAID 0 mirroring (with full capacity available, but split in half because it is mirrored) or RAID 5 data striping with parity recovery data (which kicks a 48 TB array's usable capacity down to 40 TB). IBM also has an additional data protection algorithm called Variable Stripe RAID, or VSR, which was invented by Texas Memory Systems and for which it obtained a patent. VSR is one of the goodies that made the company worth acquiring, and it allows for some of the multiple logical planes on a flash die to be recovered and reused when a plane has a sufficient number of bad blocks. For example, when a chunk of flash memory gets to its wear limit. IBM supports a combination of VSR and RAID 5 called 2D Flash RAID to boost the error correction and recovery even more.IBM is also bundling the SAN Virtualization Controller (SVC) module inside of its Storwize V7000 disk arrays with the FlashSystem 840 to add SAN services such as Easy Tier storage virtualization, real-time data compression (with something on the order of a 5:1 data compression), snapshotting, thin provisioning, and flashcopy. Asynchronous and synchronous copy services, over global and metro distances, respectively, are available through this SVC functionality in the bundle. IBM has over 3,000 customers who are using the data compression features in the SVC unit or Storwize arrays, and has over 1,000 customers it has sold flash arrays to since acquiring Texas Memory Systems.The base FlashSystem 840 costs $32,000. A 2 TB flash module costs $26,250 and the 4 TB module is twice that at $52,500. Each host interface canister costs $5,000, and each eight-port 8 Gb/sec Fibre Channel adapter costs $4,000. The 40 Gb/sec InfiniBand adapter costs $6,500 for eight ports, and the 10 Gb/sec Ethernet adapter costs $3,500. In a base configuration with 4 TB of raw capacity, two Ethernet adapters and two Fibre Channel cards and the activation of the AES TXT 256 encryption for data at rest on the flash (which normally costs $15,000 but which is tossed in for free in the base bundle), the FlashSystem 840 costs $102,680, including cables. If you wanted to load this system up with the full 48 TB of capacity, it will list for $680,180.The FlashSystem 840 will be available on January 24.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/datamining-e1381947795574-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/ibm-flashsystem-840-front.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/ibm-flashsystem-840-back.jpg"
    ]
}