{
    "title": "EMC Storage Driving Dell Revenues",
    "author": "George Leopold",
    "date": "2017-03-31 00:00:00",
    "text": "Dell Technologies, the computer hardware and storage giant, reported brisk fourth-quarter hardware sales fueled by its acquisition of storage leader EMC. For its full fiscal year, however, the company reported a sizeable operating loss tied to the EMC deal.The holding company (NYSE: DVMT) that owns Dell and EMC along with majority ownership of VMware, also claimed leadership in global server shipments along with the fiercely competitive all-flash storage array market. Meanwhile, it also reported strong demand for its hyper-converged infrastructure offerings.Dell Technologies reported Thursday (March 30) that quarterly sales ending on Feb. 3 jumped 58 percent to $20.1 billion, reflecting the integration of EMC's storage products. Overall, the EMC storage unit drove earnings, with storage revenue accounting for $4.8 billion in quarterly revenue.Elsewhere, VMware's (NYSE: VMW) fourth quarter revenues totaled $1.9 billion, with operating income of $565 million, the parent company said. Quarterly bookings for its NSX virtual networking stack reached a run rate of about $1 billion, with more than 2,400 NSX customers.Quarterly revenues from server and networking sales rose 12 percent year-on-year to $3.6 billion, lead by sales of its PowerEdge server that \"outgrew the market,\" the company claimed. Meanwhile, its cloud server business declined during the fourth quarter, a loss attributed to expected fluctuations in customer orders from one quarter to the next.The company also claimed record quarterly demand of all-flash arrays with demand exceeding $4 billion in the last quarter. \"We believe we are nearly the size of the three next competitors combined as we continue to capture the market shift to all-flash,\" David Goulden, president of Dell Technologies' Infrastructure Solutions Group, asserted during a conference call with analysts.The Dell unit has \"taken some of our traditionally hybrid products and actually enhanced the architecture quite substantially to take further advantage of all-flash [arrays] and therefore produce all-flash version,\" Goulden added.The company also said it expects to introduce flash storage combined with Non-Volatile Memory Express technology later this year.In the near term, the company sees soft demand at the high-end of the storage market while demand from medium-sized enterprises continues to grow. The bright spot appears to be all-flash storage in datacenters, where Goulden said Dell's market share is higher than for external storage.\"There's a lot of work going on to look at IT transformation and future architectures,\" he added, and potential customers are still weighing their options \"in terms of what their IT transformation strategy is….\"Among Dell Technologies' other business units, Pivotal Cloud Foundry's annual bookings jumped 130 percent to more than $270 million. The platform allows developers to deploy cloud-native applications on public or private clouds.Since closing the $60 billion acquisition of EMC Corp. last September, Dell Technologies said it has paid down about $7 billion in debt associated with the acquisition while repurchasing $824 million in stock.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_servers-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}