{
    "title": "IBM Goes ‘Retro’ For Cloud Data Migration",
    "author": "George Leopold",
    "date": "2017-09-18 00:00:00",
    "text": "The rise of streaming analytics, and with it ever-greater volumes of big data in motion, is prompting new ways to \"transport\" data that is increasing ending up in the cloud.With an eye on remote users with limited network access, IBM this week literally rolled out a portable data storage device designed to securely migrate as much as 120 Tb of encrypted data to the company's cloud platform. The storage device on wheels uses 256-bit encryption to secure data during transport and ingestion along with RAID drive failure tolerance for archiving data.IBM pitches the data migration scheme as allowing customers to copy data to the device and ship it to IBM where data is offloaded to object storage and made accessible across the IBM cloud. The \"mass migration\" of up to 120 Tb of data takes as little as a week, with United Parcel Service (NYSE: UPS) next-day delivery included, IBM said Monday (Sept. 18).The data transport systems works like this: a customer submits a \"mass data migration\" request; in response, IBM then ships a pre-configured device that is connected to a company network and the encrypted data pool is unlocked. The encrypted data is then stored and returned to IBM, which transfers the data to its cloud object storage platform. The last step involves permanently erasing the device using what the company describes as U.S. Defense Department \"wipe requirements.\"The company (NYSE: IBM) acknowledges that shipping data via UPS may be a bit \"retro,\" but insists its mass migration approach is a fast, straightforward and cheap way to move huge amounts of data to the cloud \"without disrupting daily operations.\" Further, it touts the data transport scheme as a way to free more on-premise storage or create a data archive or media repository.As unstructured data keeps piling up, IBM also is positioning the data migration framework as a way of getting a handle on the storage and management of large audio, video and image files. Once migrated to the IBM cloud, the company is pitching its associated database, analytics and Watson cognitive computing services.While networks have become a major bottleneck for moving data, IBM also is targeting the data transport service to remote users with little or no Internet access. Potential customers include operators of container ships, offshore oilrigs or farms. The service could help husband Internet connectivity for production needs rather than data transfers, it asserted.IBM said its data migration package is available now in the U.S. at a flat rate of $395 per device (multiple devices can be used simultaneously). The company said it expects to soon expand the service outside the U.S. Along with the 120 Tb data capacity, IBM claims the service provides 20 percent more storage than comparable systems.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/Screen-Shot-2017-09-18-at-2.25.33-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}