{
    "title": "Cray Moves to Acquire the Seagate ClusterStor Line",
    "text": "This week Cray announced that it is picking up Seagate's ClusterStor HPC array business for an undisclosed sum as part of a \"strategic deal and partnership.\"\"In short we're effectively transitioning the bulk of the ClusterStor product line to Cray,\" said CEO Peter Ungaro on the company's Q2 investor call yesterday.Cray will be taking over development, support, manufacturing and sales of the ClusterStor product line, including Cray's Sonexion scale out Lustre storage system, which is based on ClusterStor. The supercomputing company expects to add more than 100 Seagate employees, primarily in R&D, customer service and channel and reseller support.\"Cray will be a great home for the ClusterStor, employees, customers and partners,\" said Ken Claffey, vice president and general manager, Storage Systems Group at Seagate.Seagate acquired the ClusterStor assets for $374 million in 2014, when it purchased Xyratex. The Lustre arrays have their origins in a company called ClusterStor that was founded by Lustre inventor Peter Braam and whose assets Xyratex acquired in 2010.Cray has been working with Seagate since 2012, and is the biggest OEM for the ClusterStor line. Supporting Seagate's other ClusterStor resellers figures prominently in Cray's play here. The arrangement \"provides a new route to market for our storage solution and potentially other products down the road,\" said Ungaro.Brian C. Henry, executive vice president and chief financial officer for Cray, told investors that Cray was already a significant part of Seagate's ClusterStor revenues, so the added revenue that Cray would get from the transaction will come mostly from resellers. But the more substantial benefit to Cray's bottom line, according to Henry, is due to improved gross margins, split roughly 50-50 between Cray and third-party resellers.Cray, with new market vistas in mind, is intent on broadening its portfolio and reach. They've put their technology into a public cloud offering via a partnership with the Markley Group. And they’ve formed an impressive (according to IDC/Hyperion) security partnership with Deloitte. Now Cray is further investing into high-performance storage, generally held as the healthiest growth sector in the HPC market.\"The [HPC storage] market has a TAM [total addressable market] of about $1-2 billion in that range depending on how you want to slice and dice it, but the growth rates of that market are better than the overall supercomputing market. It's been growing in the 10 or 11, even 12 to 13 percent range recently, so it's growing a little bit faster than the overall supercomputing market, which is great for us and part of our excitement around this,\" said Ungaro.These trends are backed by findings from HPC market firm Hyperion. According to Hyperion's latest update, global HPC external storage revenues will grow 7.8 percent over the 2016-2021 timeframe (to $6.3 billion), while HPC server sales, by comparison, will grow a modest 5.8 percent to $14.8 billion.Cray didn't reveal the terms of the deal, noting that \"there are still many moving parts\" but Henry anticipates staffing costs will add about $20 million to 2017 operating expenses.The news of the acquisition comes at the same time as Cray is undergoing restructuring to as Ungaro puts it “better align the cost structure of our company to the current market conditions.” As a cost-cutting measure, Cray reduced its workforce by about 14 percent, laying off 190 people. Ungaro traced the decision to the market slowdown that has continued into 2017.\"That, combined with our estimates for the timing of a rebound and the need to continue to invest in several areas to enable future growth drove our decision to adjust our workforce,\" he said on the investor call, adding that the company’s competitive position and win rates remain strong.Cray expects the transaction to be be finalized late in the third quarter of 2017 and cites an overall net financial impact for Cray \"in the range of break-even\" for 2018.Even with major consolidation plays like the Dell-EMC union and now the folding of ClusterStor into Cray, there is still a lot of diversity in the high-end storage vendor space. You can bet that established and aspiring HPC storage providers alike will be looking to mine this market disruption as an opportunity. Although they might not all be so bold as DDN, which today launched an outreach program targeting “the many users left stranded in the wake of Seagate shutting down its ClusterStor product line.”EnterpriseTech Managing Editor Doug Black contributed to this report.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2017-07-28 00:00:00",
    "cats": [
        "Slider: Front Page",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/Cray-Sonexion-Seagate.png",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}