{
    "title": "VMware Eyes Storage Options for Kubernetes",
    "text": "VMware continues to move closer to Kubernetes-based containers for managing virtual machines and other cloud infrastructure, reflecting the growing consensus the cluster orchestrator represents a more agile form of virtualization.The server virtualization leader (NYSE: VMW) signaled its shift to Kubernetes last year with the launch of an initiative dubbed Project Pacific intended to upgrade its flagship vSphere server virtualization software using Kubernetes as its control plane. Reports have since emerged that VMware is contemplating use of emerging MinIO object storage to provision storage via Kubernetes micro-services.The web site Blocks & File recently unearthed a VMware briefing slide showing Kubernetes pods within its re-worked vSphere cloud native storage architecture linked to MinIO object storage. Among other capabilities, the combination would allow dynamic provisioning of block volumes via the open-source object storage framework.Among the advantages provided by the marrying of vSphere with Kubernetes could include “persistent data services” based on container orchestration. Another is improved operational consistency between virtual machines and containers, according to the briefing slide.MinIO touts its open-source object storage as overcoming traditional performance tradeoffs. Along with compatibility with de facto standard Amazon Web Service’s (NASDAQ: AMZN) S3 storage, the company also promotes its approach as scalable, failure tolerant and operationally consistent.Read the full story here at sister web site Datanami.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2020-01-06 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Kubernetes",
        "MimIO",
        "object storage",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/kubernetes/",
        "https://www.enterpriseai.news/tag/mimio/",
        "https://www.enterpriseai.news/tag/object-storage/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-28-at-9.34.16-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}