{
    "title": "Accelerating Virtual Storage With RAM And Flash",
    "text": "Virtual storage shifted to a higher gear this week with new software from PernixData aimed at accelerating virtual applications running on servers equipped with VMware's virtualization wares.PernixData announced an upgrade to its FVP platform that speeds virtual applications using main memory or flash memory in servers. Hence, the company claims FVP 2.0 is suited to deployment in most server environments.PernixData added that the souped-up version of FVP, which runs as kernel module inside of VMware's ESXi server virtualization hypervisor, also could be deployed in conjunction with file, block, or direct-attached storage, thereby easing integration with existing or future storage devices.The company claimed the new acceleration features make \"server side software a fundamental part of any virtual infrastructure by cost effectively scaling storage performance independent of capacity.\"The goal was to make software-based storage acceleration easier to deploy and scale in virtual datacenters, analysts said. Hence, server-side storage acceleration is increasingly seen as a key investment for companies operating datacenters.“Storage is at an amazing inflection point where performance is being extricated from capacity to optimize application behavior and cost effectively scale IOPS (input/output operations per second), without disrupting years of investment in shared storage infrastructure,” Satyam Vaghani, CTO and co-founder of PernixData, said in a statement.The company maintains it has made \"decoupled storage architectures the de facto standard in virtual data centers.” The decoupling of storage performance from storage capacity results in a ten-fold speed increase for virtualized applications, what it called unlimited I/O operations per second (which obviously is not the case and which refers to the ability to scale up I/O by scaling out storage on the ESXi clusters), and a 90 percent reduction in storage costs, the company claimed.The FVP software works by virtualizing RAM and flash memory across servers to create a \"clustered pool of high-speed resources that accelerate reads and writes to shared storage,\" the company said.Other features of FVP 2.0 include: PernixData said its new FVP features are available in a limited release. A request form for access to a beta version of the FVP software is here.It will be interesting to see how FVP stacks up against VMware's own Virtual SAN (vSAN) software, which similarly creates a storage pool across disk and flash devices in an ESXi cluster to accelerate the performance of that storage and obviate the need for an actual storage area network.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-04-23 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "ESXi",
        "Flash",
        "FVP",
        "PernixData",
        "RAM",
        "VMware",
        "vSAN",
        "vSphere"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/esxi/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/fvp/",
        "https://www.enterpriseai.news/tag/pernixdata/",
        "https://www.enterpriseai.news/tag/ram/",
        "https://www.enterpriseai.news/tag/vmware/",
        "https://www.enterpriseai.news/tag/vsan/",
        "https://www.enterpriseai.news/tag/vsphere/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/12/hp-storage-logo-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}