{
    "title": "100 Million IOPS: Brocade’s New Gen 6 Fibre Channel Switch",
    "author": "Doug Black",
    "date": "2016-03-01 00:00:00",
    "text": "Fibre Channel market leader Brocade today announced the G620 Switch, which the company says is the industry’s first Gen 6 fixed port Fibre Channel SAN switch designed to support the explosion in in storage networks.Nearly 100 percent of the world’s banks, airlines and retailers use Fibre Channel, and companies in those and other sectors conduct 30 billion transactions through Fibre Channel each day. With the growth in storage and the permanent demand for faster networks, Brocade and other Fibre Channel companies are under relentless pressure to enhance network performance.Brocade said the G620’s Gen 6 ASIC technology delivers up to 566 million frames switched per second and up to 100 million IOPS, while port-to-port latency is minimized to 700 nanoseconds. The switch includes four Q-Flex ports, which can support 128 Gbps or can be split out into four 32 Gbps links. The switch scales from 24 to 64 ports, for aggregate throughput of 2 Tbps in a one-rack unit chassis, the industry’s highest port density, according to Brocade.Truls Myklebust, Brocade's director of product management, storage networking, told EnterpriseTech that development of the new switch was driven primarily by three factors: customers deploying more virtual machines on servers as they “wring out as much performance as they can out of their infrastructures”; the increasing amount of IO going through networks as storage capacity grows; and the rapid emergence of flash storage, “which presents a completely different IO profile to the applications.”“You need lower latency, faster response times and a higher level of performance overall,”Myklebust said. “Customers want to make sure the network doesn’t become the new bottleneck, they want to take full advantage of the performance that these new flash arrays provide.”The G620’s Gen 6 Fabric Vision technology includes IO Insight, automated diagnostics and management capabilities that monitors IO statistics, including device latency and IOPS metrics, for early detection of storage performance degradations. Brocade said IO Insight “non- intrusively” gathers IO statistics, which can be used within an intuitive, policy-based monitoring and alerting suite to configure thresholds and alarms. In-band device latency and IOPS monitoring detects degraded storage performance, allowing administrators to proactively optimize performance and availability. The switch’s exchange-based Dynamic Path Selection optimizes fabric-wide performance and load balancing by automatically routing data to the most efficient, available path in the fabric.Brocade said the G620 is available now through Brocade and its channel partners and will be available through Brocade’s OEM partners in the second quarter of 2016.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/03/brocade_g620_highlight_2.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/03/brocade-mycklebust-300x169.jpg"
    ]
}