{
    "title": "DataCore SANsymphony Boosts Flash, Ends ‘Storage Islands’",
    "author": "George Leopold",
    "date": "2014-04-30 00:00:00",
    "text": "Software-defined storage vendor DataCore Software rolled out the latest version of its SANsymphony virtual storage area network, which seeks to boost utilization of pricey flash storage technology while pulling together virtual and physical storage services.DataCore said that version 10 of its virtual SAN software addresses the need to boost utilization of flash storage by directly attaching flash and disk storage to application hosts and clustered servers in a virtual SAN.In an interview, DataCore CEO and co-founder George Teixeira said the latest version of its virtual SAN software reflects a trend toward moving workloads closer to applications and storage closer to workloads. The added value resides in DataCore's software stack, which also optimizes flash utilization while preventing virtual and physical services from becoming \"isolated storage islands.\"\"The software should be able to move across all these environments,\" Teixeira added. That's particularly important as enterprise customers adopt a spectrum of storage options that include flash, storage networks along with private and public clouds.With that in mind, DataCore said the latest version of its SAN software incorporates an automation feature called \"auto-tiering\" that allows different flash memory and storage devices to operate across different vendor platforms. The feature can handle up to 15 tiers and is designed to automate the process of identifying the appropriate storage platform within an enterprise, the company claimed.The automation software also selects the appropriate level of storage depending on the use case. For example, the storage of medical records would require greater security while less sensitive data could be stored at various physical locations using I/O mirroring over metro-area distances.Teixeira added that flexibility is the key factor driving the shift to software-defined networks. Unlike hardware, which tends to be replaced every several years, \"software lives on,\" the DataCore CEO noted, and must be able to run on a variety of environments.The company said version 10 of its virtual SAN software scales performance up to 50 million IOPS and 32 petabytes of capacity across a 32-server cluster.DataCore said typical multi-node licenses for version 10 of its SANsymphony software range between $10,000 and $25,000. New virtual SAN pricing starts at $4,000 per server. The virtual SAN price includes the auto-tiering feature along with adaptive read/write caching form DRAM, storage pooling, metro-wide synchronous mirroring and thin provisioning, among other features.The company added that the new virtual SAN software supports operating systems hosted on VMware ESX and Microsoft Hyper-V virtual environments. SANsymphony Version 10 can also be deployed in a virtual machine or running in native mode on Windows Server 2012 using physical X86 servers.The company said general availability of version 10 is scheduled for May 30, 2014.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/sap-hana-logo-2-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}