{
    "title": "Container Storage Goes Native",
    "author": "George Leopold",
    "date": "2019-07-24 00:00:00",
    "text": "Persistent storage emerged as an early requirement for shifting application containers to full production. Industry standards groups have since taken up the cause by launching so-called “cloud-native” storage projects around key components like the Kubernetes cluster orchestrator.Among those efforts is Rook, an open-source (Apache 2.0) storage effort launched recently by the Cloud Native Computing Foundation (CNCF). Rook is billed as a production-ready storage orchestrator designed to extend Kubernetes while targeting block, file and object storage for platforms like Apache Cassandra.In a phrase, Rook is described as a framework for “storage resource normalization,” according to Jared Watts, a Rook senior maintainer with Upbound, a Kubernetes vendor targeting multi-cloud platforms.Rook emerged in response to the realization that storage must be tailored to cloud-native environments as application containers and other micro-services shift to production. As container technology gained traction over the last several years, it quickly became apparent that persistent storage was a barrier to wider adoption of containers in production.CNCF launched Rook as a standard cloud-native storage technology that would allow users to exploit the full potential of container architectures. A stable 1.0 version was released in May.Hence, the storage orchestrator is designed to automate a range of tasks, including storage deployment, configuring, provisioning, scaling and disaster recovery. Running on top of Kubernetes, Rook’s automation tools are intended to manage containers delivering cloud-native applications.Along with the Cassandra database management system, organizers said Rook can orchestrate a variety of storage platforms, including Ceph, CockroachDB and EdgeFS, allowing all to run consistently on Kubernetes. Version 1.0 includes support for the Nautilus, the latest version of Ceph. Other upgrades included EdgeFS adding storage protocol support with OpenStack Swift.Rook proponents note that the cloud-native storage orchestrator allows users to hyper-scale or -converge their storage clusters. It also provisions block, file and object storage among multiple storage providers.CNCF said Rook has been deployed in production “across multiple industries. As an example of how emerging storage technologies are entering the mainstream, CNCF noted that Rook was used to support a season premiere of HBO’s widely popular Game of Thrones.Further enhancements to the Rook framework are expected to include dynamic provisioning of new storage resources via integration with Crossplane, an open-source controller for multi-cloud deployments.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/07/Rook_storage_CNCF-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}