{
    "title": "Micron, Intel Prepare to Launch XPoint Memory",
    "author": "George Leopold",
    "date": "2016-08-15 00:00:00",
    "text": "Micron Technology Inc. used last week's Flash Memory Summit to roll out its new line of 3-D XPoint memory technology jointly developed with Intel Corp. while demonstrating the technology in solid-state drives.Micron (NASDAQ: MU) claimed its Quantx line delivers PCI Express (PCIe) SSD performance with read latencies at less than 10 microseconds and writes at less than 20 microseconds. That, the chipmaker asserted, is 10 times better than NAND flash-based SSDs. Meanwhile, SSDs running on eight PCIe channels reached 1.9 million IOPS, the company reported.Micron is targeting the nonvolatile memory technology at cloud, data analytics, online transaction processing, Internet of Things (IoT) and mobile applications, including \"low queue depth workloads.\" It also claimed in a blog post performance improvements in \"traversing large graph trees.\"The chipmaker expects to introduce new memory products based on 3-D XPoint (pronounced \"cross point\") technology over the next 12 months. The rollout \"will require an ecosystem to bring it forward and drive adoption,\" noted Micron's Michael Abraham. \"This includes designing end products, enabling and building controllers and selecting end-product go-to-market partners.\"Meanwhile, Intel (NASDAQ: INTC) said last month its Optane SSDs based on 3-D XPoint memory technology also would hit the market by the end of 2016. In April, Intel demonstrated Optane SSDs operating at 2 Gb/sec speeds. Along with speed improvements, the partners are hoping to convince potential enterprise customers that XPoint memory platforms are more durable than current NAND flash technology as well as providing as much as a ten-fold increase in storage density for persistent data compared to DRAM.While neither company has released specific pricing information, Intel has hinted that its XPoint products could be offered at prices comparable to current flash memory products. The Optane line of SSDs will reportedly use Intel's own memory controller.Micron said it is currently working with unnamed storage vendors to integrate its XPoint approach into their products. It expects to announce storage partners over the next six to nine months, Abraham said.The partners are betting that the ability to deliver faster persistent storage closer to computing power will generate new system architectures and applications in areas such as IoT.3D XPoint memory technology unveiled by the partners last July is based on new materials and a three-dimensional \"cross point\" architecture said to deliver a 1,000-fold increase in non-volatile memory speeds. Intel and Micron developed stackable \"memory grids\" to maximize cell density. The \"cross point architecture\" provides access to each memory cell, eliminating the need for transistors.The architecture creates a \"three-dimensional checkerboard\" in which memory cells are positioned at the intersection of word and bit lines. That high-density configuration allows memory cells to be addressed individually. Hence, data can be written and read in small chunks, speeding up the read/write process, the companies said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/07/Screen-Shot-2015-07-28-at-1.49.46-PM-393x320.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}