{
    "title": "Pivot3 Adds Dynamic Provisioning With NextGen Deal",
    "text": "The convergence of the hyper-convergers continues with infrastructure specialist Pivot3's deal to acquire flash array startup NexGen Storage Inc.Privately held NexGen, Louisville, Colo., was spun out a year ago from SanDisk Corp. Terms of the deal were not disclosed. The boards of both companies approved the acquisition, which is expected to close next month.Pivot3, Austin, Texas, said Wednesday (Jan. 27) the acquisition would add momentum to its hyper-converged infrastructure approach by adding NextGen's all-flash and hybrid storage capabilities. It cited the startup's \"dynamic quality-of-service\" (dynamic QoS) feature rolled out in November as a means of provisioning and scaling IT resources.\"IT no longer has to overprovision for peak workloads, but instead can use just-in-time dynamic provisioning of resources and scale,\" Pivot3 noted in a statement announcing the NextGen acquisition.Added Pivot3 CEO Ron Nash: \"Everyone talks about the need for agility in terms of business needs, but in hyper-convergence, workload utilization and performance have been gating factors to expansion beyond the usual initial use cases.\"NextGen had pitched its dynamic QoS as a \"differentiator\" that helps govern performance targets, I/O prioritization and data placement. Pivot3 said the acquisition would allow it to support new uses cases emerging from trends like the Internet of Things while allowing users to prioritize applications and categorize data.Pivot3 added that its \"dynamic hyper-convergence\" approach built on hyper-converged infrastructure along with hybrid and all-flash storage offered in both appliance and blade forms would help usher in the first generation of software-defined datacenters.The deal combines NexGen's flash arrays and dynamic QoS provisioning approach with Pivot3's proprietary \"scalar erasure coding\" scheme that is said to yield more than 90 percent usable storage. The combination will be used to target storage for HPC applications, Pivot3 added.NexGen announced extensions to its N5 flash arrays late last year. They are based on multiple tiers of flash storage, including RAM, low-latency PCIe flash and higher capacity solid-state drives. Those components were blended in dynamic storage QoS to help avoid latency spikes and resource contention issues that NexGen contends are inherent in all-flash arrays. The startup described dynamic QoS as its \"secret sauce.\"Founded in 2003, Pivot3 announced a $45 million funding round last year. The cash infusion was used to expand its operations while investing in storage and virtualization technologies. While the NexGen deal beefs up its storage portfolio as HPC technologies enter the mainstream, the company also said it was looking to extend it virtual desktop capabilities along with related capabilities like virtual security servers.The deal also illustrates how the hyper-converged infrastructure is heating up. Larger players like Hewlett-Packard Enterprise (NYSE: HPE) have zeroed in with well-timed acquisitions as a means of competing with Pivot3 and other hyper-converged infrastructure upstarts. They include Gridstore, Maxta, Nutanix, Scale Computing, Simplivity.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-01-27 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "acquisition",
        "dynamic QoS",
        "Flash",
        "hybrid storage",
        "hyper converged IT",
        "Pivot3 NextGen"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/acquisition/",
        "https://www.enterpriseai.news/tag/dynamic-qos/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/hybrid-storage/",
        "https://www.enterpriseai.news/tag/hyper-converged-it/",
        "https://www.enterpriseai.news/tag/pivot3-nextgen/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}