{
    "title": "Flash Array Maker Pure Storage Rakes In Venture Cash",
    "author": "George Leopold",
    "date": "2014-04-24 00:00:00",
    "text": "If market valuation is a reliable indicator, then Pure Storage appears to be pure gold to its growing list of investors.Pure Storage, the all-flash enterprise storage array startup, has closed a $225 million late-funding round. The new investments bring Pure Storage's total funding to $470 million. The cash infusion will be used to expand its international business through additional investments in engineering and strengthening channel partnerships, the startup said.The Series F funding round was led by T. Rowe Price Associates, Tiger Global, and new investor Wellington Management.Pure Storage CEO, Scott Dietzen, said the company's \"pre-money\" valuation has now exceeded $3 billion.The storage company's secret sauce centers on its all-flash storage arrays, which the company claims are cheaper than disk storage. \"In 2014, no one should be buying mechanical disk to run databases or virtual machines,\" Dietzen asserted in announcing the funding.Moreover, the company maintains that the all-flash technology is the next big thing for enterprise storage. Pure Storage claims its flavor of the technology delivers a ten-fold performance acceleration and power savings.Flash memory makers have long touted low-power devices as a way to make inroads in the storage market. Pure Storage is leveraging flash technology to accelerate random I/O-intensive applications like server and desktop virtualization, database management, and cloud computing.Pure Storage's current strategy is to expand deployment of its FlashArray in datacenters utilizing existing power and space constraints. The storage company's products are reportedly in private beta testing with select customers. These products are expected to be launched later this year.Institutional investors and venture capital firms with ties in Silicon Valley are betting Pure Storage's flash memory application places it on the cusp of the next generation of storage technology. A previous funding round in 2012 raised $40 million.Pure Storage was founded in 2009 by John Colgrove and John Hayes. Colgrove currently serves as CTO; Hayes is chief architect.Competition in the flash storage market is heating up as flash technology matures. Among Pure Storage's key competitors are Nimbus Data and Violin Memory, which both sell all-flash arrays, and NetApp, which sells data management along with storage products based on flash and disk or a mix of the two.Pure Storage is also locking horns with established storage and cloud computing vendors like EMC. Over the last several years, EMC has grabbed the largest share of the global storage market. Market analyst Frost & Sullivan estimated that the total revenue for primary storage technologies hit $9.2 billion in 2012.For now, Pure Storage remains the darling of the solid-state storage market. It recently claimed 700 percent annual growth in 2013 and the deployment of more than ten FlashArray systems at multiple customer sites. Meanwhile, its customer base grew 650 percent year-on-year in 2013.The company also announced in March that is has expanded oveaseas with European offices in Germany, the Netherlands, and the United Kingdom along with Hong Kong, Japan, Singapore, and South Korea.Other investors include Greylock Partners, Redpoint Ventures, and Sutter Hill Ventures.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/lightning-flash-370x261.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}