{
    "title": "DDN to Acquire Nexenta, SDS Aimed at ‘Holy Trinity’ of AI-5G-IoT",
    "author": "Doug Black",
    "date": "2019-05-06 00:00:00",
    "text": "In the scramble for the emerging 5G-“compute everywhere” world to come (see Nvidia-Mellanox, Xilinx-Solarflare), high performance storage heavyweight DataDirect Networks (DDN) has added to its recent acquisition of virtualized all-flash  storage management vendor Tintri with this morning’s announced acquisition of  software-defined storage (SDS) company Nexenta.Terms of the deal were not disclosed.While DDN originally targeted the traditional HPC world and maintains a strong presence in the Top500 list of the world’s most powerful supercomputers, over the past five years the company has increasingly sold into commercial markets. The Nexenta acquisition is another step in that direction, broadening the company’s market reach into the enterprise, AI/machine learning space. It’s also another indicator that enterprise data centers are taking on the characteristics of HPC systems that require high performance networking and, in DDN’s focus area, storage management fabrics (see “Exponential: Today and Tomorrow’s Expansive AI-Big Data-HPC Landscape” for a [mostly] good-natured discussion of the originator of this observation).“DDN has made its mark in demanding markets where high performance and capacity scalability are extremely important, such as HPC, life sciences, media & entertainment and more recently in the artificial intelligence and machine learning space,” Henry Baltazar, research VP, infrastructure, at 451 Research, told us. “The addition of Nexenta pushes DDN into the enterprise and midrange storage markets, and it also gives DDN a stronger and more complete storage portfolio, which will make it more competitive in emerging markets, such as cloud storage, persistent storage for containers, and the AI/ML space.”As of a year ago, Baltazar said, DDN had 50 customers using its gear in AI and ML for applications including natural language processing, image analysis, autonomous driving and quality control. The new division, to be called Nexenta by DDN, adds enterprise-class scale-up and scale-out software capabilities for, in DDN’s words, “hardware-, protocol-, stack/platform-, cloud- and app-agnostic deployments” along with Nexenta’s 3,000 enterprise, telco and service provider customers, 300 partners, 50 patents and nearly 2,000 petabytes of storage capacity.\"Overall, the infrastructure vendors are all looking to come to market with a more complete story,\" Baltazar said, \"which is why we are seeing storage, networking and other acquisitions taking place. Everybody wants to plug holes either with M&A or partnerships.\"In an interview last week, James Coomer, DDN VP of products, said the combination of the three companies’ technologies put DDN “in an excellent position to build a set of services, a set of products, a wider DataDirect Networks group of companies, to serve those AI, IoT and 5g markets.”“We’ve been focusing a lot on the AI markets,” he said, “Tintri brought us our first steps into the enterprise and they’re having an extremely strong enterprise product in that virtualized space…. With Nexenta, we add a third pillar…. Nexenta has purely software defined services and they provide the whole range of data services that are complementary to what DDN has – so they have enterprise class NAS, NFS, SMB, provide S3 and they have block services for their products, in a pretty software-defined way…. In the next couple years, we’ll start to see the emergence of 5G and on the tail of 5G is going to be the realization of the IoT market, and that all falls back into AI – because AI is going to be a vital component in realizing the value of IT in delivering those high value services for all those consumers out there.”While DDN is aimed at delivering high performance storage at companies “trying to address their most extreme data challenges in AI and HPC,” Coomer said, Nexenta SDS “gives us robust enterprise-class data services for telco and enterprise, so really, the overlap is very small and the complementarity is very large.”In turn, Coomer sees AI, IoT and 5G also complementing each other – with the need for solutions that support all three.“In order for IoT to be realized by all the myriad of companies that can provide IoT services,” he said, “they need real time streaming analytics… (and they have a) need for AI to be embedded into that ecosystem. So that sort of holy trinity of AI, IoT and 5G is really what we think we’ve got going for us moving forward: the AI heritage from DDN emerging out of our HPC heritage, and IoT and 5G is Nexenta’s stronghold and strong base.”In the same pre-announcement interview, Nexenta CEO Tarkan Maner cited Nexenta customers Ericsson, Nokia and other telcos.“We support with our software-defined storage capabilities very large-scale 5G deployments,” he said, “supporting network virtualized functionality through the infrastructures, delivering very large-scale IoT applications for telcos in multiple companies. Out of 700 operators worldwide, we are almost in 100 of them, moving them to 5G.“The last 12 months has been a big PoC year,” Maner said, “now this year in 2019, those are moving to big deployments – we are expecting hundreds of terabytes of deployments per telco, globally. So in each country, these telcos are replacing large-scale cloud, so to speak, partnering…with AWS, Google and all the other cloud service providers, creating huge opportunities in the market – and Nexenta opens up those opportunities. Obviously, we do not have large-scale AI/HPC capabilities, that’s where DDN comes in. So (the acquisition) creates a lot of cross-pollination and great opportunities for both companies.”Coomer and Maner said Nexenta will initially remain a stand-alone business, “but at the end of the day our goal is to create cross-pollination opportunities as we move forward, geographically, vertically, and from a solutions perspective,” Maner said.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/DDN-logo-0519-370x290.jpg"
    ]
}