{
    "title": "Emerging Advanced Scale Tech Trends Focus of Annual Tabor Conference",
    "author": "no author",
    "date": "2018-05-09 00:00:00",
    "text": "At Tabor Communications' annual Advanced Scale Forum (ASF) held this week in Austin, the focus was on enterprise adoption of HPC-class technologies and high performance data analytics (HPDA). It’s a confab that brings together end users (CIOs, IT planners, department heads) and vendors and encourages group discussion and debate to go along with presentations and panel discussions.As it turned out, much conversation centered on the management and cultural challenges of introducing and melding advanced scale technologies with traditional IT, including the significant differences in outlook and objectives between the two groups. We’ll report more fully on this “functional dissonance” in the coming days because it’s a critical issue for enterprises outstripping traditional IT as they come under pressure to adopt machine learning, deep learning, larger and more complex simulations and HPDA while generating and accessing enormous stores of data.At this year's ASF, the five technology themes were: AI/ML/DL, blockchain, cloud and hybrid IT, IoT and edge to core analytics and high performance computing.ASF, which began on Sunday, was kicked off by the managing editors of Tabor Communications three publications, Tiffany Trader of HPCwire, Alex Woodie of Datanami and Doug Black of EnterpriseTech presenting observations of the state of the advanced scale enterprise technology world.In her opening remarks, Trader took up the growing role of public cloud computing platforms and hybrid IT for enterprises working to address modern scaling challenges of the big data era.“Increasingly the market is shifting to multi-cloud deployments as enterprises seek to spread out workloads and avoid vendor lock in,” Trader said. “Cloud computing has risen on the advantage that you can try it out without an expensive up-front investment in infrastructure and talent. With cloud you have access to the most advanced hardware, the appearance of unlimited scale, and a growing menu of services.”She quoted studies by Gartner Inc. showing strong growth in cloud adoption with a forecast to start leveling out from 2018 onwards, a stabilizing effect due to the maturity of public cloud services. After year-to-year growth of 18.4 percent from 2016 to 2017 and 17.5 percent jump from 2017 to 2018, the public cloud industry will grow 16.2 percent from 2018-2019 and then 15.6 percent from 2019 to 2020. Gartner also predicts that by 2020, 90 percent of organizations will adopt hybrid infrastructure management capabilities, combining off- and on-premises compute resources.Trader also discussed the burgeoning phenomenon of AI and HPC in the  cloud as a potent combination, with cloud providers rapidly adopting advanced compute to meet growing AI market demand.“In the past 12-18 months, we've seen the big cloud providers making major investments in HPC and AI,” she said. “We’ve seen the time to adoption for the latest accelerators go from about four years to four months, and we see that all the major cloud providers are offering Nvidia’s top datacenter GPUs now, and we also see hyperscalers working with FPGAs and adding them to their public clouds.”The prevalence of hybrid IT also raises significant technology management issues, such as workload placement, application migration, data governance and compliance, data locality, and data movement, accompanied by complex calculation of ROI and TCO equations, Trader said.ASF sponsors included several leading cloud services and server/infrastructure providers, including AWS, Microsoft, Penguin Computing, Nimbix, Accenture, HPE, & Dell, who discussed hybrid IT strategies in detail.As for HPC, Trader noted that an increasing number of enterprise end-users have evolved their workloads into HPC-class performance, though they may not  “realize that, or call it that, or even care what it's called,” – what Intel Corp. calls “implicit HPC.”“But it is really the engine that makes all of this possible,” said Trader. “HPC is at the core of data intelligence for the business. The HPC analyst groups we interact with are all actively focused on the themes and technologies we've been discussing. You can think of this space as high productivity computing or high performance enterprise computing or advanced-scale computing, but all the other (technology) themes and technologies we’re talking about (at ASF) are not just using HPC-class technologies but innovating them – such as Google with TPU, its Tensor processing unit.”In his remarks, Woodie stated that “We're at a critical point in the evolution of technology. We've already entered a period of punctuated technological equilibrium that is driving disruption of business. But of course, one man's business disruption is another woman's business opportunity. The key is to find oneself on the right side of that equation.”At the heart of this change is AI, which Woodie said “has gone from an obscure science fiction topic into the subject of mainstream conversations” within the past two years – the main reason for which has been technological improvement leading to improved ease of use for machine learning.He said researchers at the University of Toronto kicked off the current deep learning craze in 2012 when their eight-layered, GPU-powered convolutional neural network, dubbed AlexNet, won the ImageNet competition by a large margin. AlexNet was trained on ImageNet, a database which then contained 1.2 million images across 1,000 categories (today it has 14 million images across 20,000 categories) – all carefully labeled by humans.This has led to what Nvidia CEO Jensen Huang has termed a \"Cambrian Explosion\" of deep learning approaches, said Woodie. “In addition to convolutional neural networks, which excel at finding patterns in images, we have recurrent neural networks, which are better at spotting patterns in words. We have generative adversarial networks (GANs) and reinforcement learning, and thousands of other species that are have been created by technologists to solve all manners of predictive challenges.”The deep learning explosion has kicked off a “gold rush” among IBM, Intel, Google, Facebook, and others to build faster and more specialized silicon to tackle even bigger and more complex neural network workloads in the future, he said, with the result that the business value of AI will reach over $3.9 trillion in 2022, according to Gartner, which declared that AI \"promises to be the most disruptive class of technologies during the next 10 years\" thanks to advances in computational power and the volume, velocity, and variety of data.Black began his comments by observing that CIO and IT planners surely must be overwhelmed by explosion of new, advanced technologies that constantly come onto the market, which has resulted in a gap between technologies that are available and technologies that have been adopted in the enterprise.“We see studies showing it’s still early days for the adoption of many of these technologies,” he said. “In AI, IoT, HPDA and blockchain, many organizations haven’t yet successfully completed a working implementation, others haven’t finished a proof of concept project, other companies haven’t begun their journeys at all.  Yet there’s tremendous competitive pressure to adopt new advanced scale technologies, CIOs everywhere know they must act, and we all know the advantages of being a first mover.”It is these new technologies that will most quickly drive the continued upward trajectory of compute power.“Moore’s Law for the X86 architecture is slowing down, but the notion of Moore’s Law as it applies to overall systems performance – boosted by GPUs, FPGAs, by the integration of CPUs and GPUs, by advanced fabrics and networks, by public cloud platforms – means that workload scale and throughput continue to advance rapidly,” Black said. “We’re seeing the emergence of a tripartite hybrid computing strategy – with compute resources at the edge, in the data center and on a public cloud platform – with sensors digitizing machines, processes and people, generating tremendous volumes of IoT data, which is analyzed at the edge, in the data center or in the cloud, in real time, in near time or in batch, as needed. “A frequent topic at ASF was integrated edge-core-cloud schemas, which begin with IoT sensored items and devices, along with local compute, out at the edge.“This is the culmination of long term developments in the technology industry,” said Black, “that by putting sensors on virtually anything, everything can be digitized and then analyzed. Combine that with machine learning and predictive analytics, and you’re able to monitor, track and analyze machinery, vehicles, aircraft, the movements of goods and people, some of it in real time.”He cited Gartner's famous prediction that more than 20 billion devices will be sensored and connected by 2020, up from 8.4 billion in 2017. The global IoT market is expected to grow to $450 billion by 2020, a CAGR of 29 percent.Black discussed several impressive IoT implementations at scale, such as analytics being conducted on sensor data from 5 million smart electrical meters in the New York metropolitan area by the Con Edison utility.Blockchain is another up and coming technology, “although one that’s not emerging as fast as IoT,” Black said, in part because it’s a newer technology.“Best known as the bitcoin record-keeping system behind bitcoin,  blockchain ledgers digitize the pass offs between individuals and companies, recording transactions along the way,” he said. “It’s an immutable string of data points connected into time-stamped blocks that cannot be modified or manipulated by anyone outside of the chain.”As of now, IDC estimates that corporate spending on blockchain software will reach $2.1 billion in 2018, up from $950 million last year. But Gartner also recently reported that industry uptake of blockchain has been slower than might be expected. Only 1 percent of companies surveyed said they had “any kind of blockchain adoption” in place, while only another 8 percent said they were conducting short-term testing of the technology.On the other hand, Black said, interesting blockchain development efforts are underway. For example, last year IBM launched its Blockchain Platform and announced the adoption by major food companies of a global strategy aimed at early detection of contaminated food,  which kills 400,000 people around the world each year.In the international travel industry, Accenture is working with the Canadian government and the World Economic Forum’s Security in Travel Project on a blockchain strategy to streamline security and passport checks for travelers at international borders, along with speeding up hotel and airline check-ins, by pre-loading, on a voluntary basis, travelers personal identification information.“Despite Gartner’s somewhat sobering blockchain report, our sense is that once the success of blockchain projects becomes more widely known, adoption will pick up,” Black said.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/ASF-crowd-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/ASF_Logo-1024x292.png"
    ]
}