{
    "title": "IBM, Fujifilm Researchers Boost Tape Capacity By 62X",
    "author": "George Leopold",
    "date": "2014-05-21 00:00:00",
    "text": "IBM researchers are claiming a new density record for tape storage technology based on joint research with manufacturer Fujifilm focused on barium ferrite (BaFe) tape particle technology.The IBM advance follows a similar high-density storage announcement from Sony.IBM Research engineers in Zurich, Switzerland, said they demonstrated a prototype version of a new tape based on BaFe technology that achieved an areal data density of 85.9 gigabits per square inch. At that density, a standard LTO cartridge could store up to 154 TB of uncompressed data. IBM claimed that represents a 62-fold improvement over current magnetic tape storage capabilities.IBM has been working with Fujifilm and other tape media manufacturers to evaluate tape based on BaFe particles that can be produced using less costly particulate coating technologies. The latest breakthrough also is being touted as a potential solution to big data storage requirements.\"Not only does the technology provide high capacity in a small form factor, it is also reliable for several decades, requires zero power when not in use, is secure in that cartridges cannot be erased at the push of the keystroke and available for the cloud – all at a cost of less than 2 cents per gigabyte and at a greatly reduced operating expense versus disk storage,” IBM Fellow Evangelos Eleftheriou claimed in a statement announcing the successful demonstration.IBM scientists added that they have developed enhanced write-field head technology, advanced servo control technologies, and new signal processing algorithms. The write technology is said to allow the use of much finer BaFe particles while the servo technology boosted track density. The algorithms allowed operation using a giant magneto-resistive reader that was 90 nanometers wide and reads tracks that are 180 nanometers wide.Researchers said they expect to continue scaling the magnetic tape technology to higher areal densities while exploring other storage media technologies.At the Edge 2014 conference in Las Vegas this week, Mark Lantz, manager of exploratory tape at IBM Research, said that IBM and Fujifilm were confident that they could push the density of the new tape to 100 gigabits per square inch. This will be accomplished by using sputtered media after squeezing the last of the performance from low-cost particulate media. Sputtering involves depositing atoms from a source material onto a substrate in a vacuum chamber.Lantz added that the capacity of disk drives is only growing at about 10 percent per year while data storage capacity is growing at closer to 50 percent per year, and that something would have to give. With tape media lasting up to 30 years compared to around five for an enterprise disk drive, and with tape having a total cost of ownership per unit of data that is about one-tenth that of disk arrays, Lantz said emphatically: \"Tape is here to stay.\"The IBM-Fujifilm advance follows an April announcement by Sony that it achieved an areal recording density equivalent to approximately 74 times the capacity of current mainstream coated magnetic tape storage media. Sony claimed the advance makes possible the recording of more than 185 TB of data per cartridge.Sony said it developed a new vacuum thin film technology able to form extremely fine crystal particles needed for next-generation tape storage media. The approach was used to create a nano-grained magnetic layer with fine magnetic particles and uniform crystalline orientation.Sony has used sputtered media along with the vacuum thin-film forming process to deposit strings of uniform nano-crystals in a layer measuring 5 micrometers thick. \"By optimizing sputter conditions and independently developing a soft magnetic under layer with a smooth interface, Sony has made it possible to minimize disparities in crystalline length and growth.\" Sony engineers used this to \"create a nano-grained magnetic layer composed of fine magnetic particles with an average size of 7.7 nanometers, the company said in a statement announcing the tape storage media advance.Precisely who remains standing in the tape storage media market remains to be seen, but IBM and Fujifilm are forecasting steady improvement in their tape technology over the decade. IBM is projecting that storage media resulting from its new tape technology could hit the market by 2024.Sony said it would continue toward commercial development of its next-generation tape storage media while pushing development of advanced thin layer deposition technologies based on the sputter method. The Japanese company said it aims to increase record densities even further.Still, the Japanese consumer electronics giant has been steadily exiting technology product lines as it seeks to pare down its core businesses.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/ibm-tape-drive-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}