{
    "title": "Bringing AI to Autonomous Centers of Data",
    "text": "Traditionally, IT’s role included reacting to problems in the data center. This resulted in frustration, headaches and wasted time. After an issue cropped up, staff searched through log files and interpreted graphs to find the cause. IT staff often contacted vendor support, spending hours on the phone through multi-tiered escalations. The result — time-consuming trial-and-error, expensive overprovisioning and missed opportunity.Limitations of Traditional IT Data Center Tools Traditional infrastructure monitoring and analysis tools do not help IT staff get ahead of problems. Because the tools simply report on local system metrics, they cannot learn from the behavior of other peer systems. And being confined to infrastructure silos, these tools only tell part of the story, whereas problems can occur anywhere in the stack. General-purpose analytics only provide surface-level insights, missing the deep domain expertise needed to understand all the operating and environmental parameters correlated across the infrastructure layers.Most importantly, traditional tools only provide information and cannot fix the problem. This means that staff must manually fix any problems that occur or make changes ahead of time to prevent problems. To break the fix-and-repair cycle that plagues IT departments, there needs to be intelligence with the foresight to predict problems before they occur and automatically recommend changes to enable the optimal environment, thus creating autonomous centers of data that span from core to cloud to edge, with seamless orchestration between them.New Tools Must Enable Autonomy As infrastructure becomes increasingly vital to an organization’s bottom line, IT requires solutions that can transform how infrastructure is managed and supported. Integrating AI with infrastructure can overcome these limitations and help to create autonomous centers of data, within which AI solutions predict problems and proactively improve the environment without human intervention.By simultaneous monitoring of all systems in an installed base, AI can detect abnormal behavior by recognizing underlying patterns and configurations. AI creates a foundation of data through deep system telemetry and global connectivity that uses each piece of information to learn more about the systems. When a new problem is detected, the tools recognize the issue and use pattern matching to find other systems that may have similar issues. Based on this information, the AI recommends the best operational system change to fix the problem and prevent recurrences. IT administrators can have recommendations automatically applied, without human intervention, which is the definition of autonomy at work.Removing the Burden of Infrastructure from ITWith an autonomous center of data, the infrastructure self-manages, self-heals and self-optimizes. Because the majority of problems are prevented and guesswork eliminated, IT rarely needs to reactively solve problems, which allows staff to work on projects that improve the employee and customer experience. By significantly reducing downtime caused by outages and performance bottlenecks, the autonomous center of data also results in increased productivity for all employees.Once an autonomous center of data is achieved, IT departments reach greater efficiency and confidence knowing their system is running in an optimal state. In this state,  IT departments can most efficiently use their resources to grow their business.Milan Shetti is Storage Division General Manager of Hewlett Packard Enterprise.",
    "date": "2018-07-05 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "data center",
        "data center management",
        "HPE"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/data-center/",
        "https://www.enterpriseai.news/tag/data-center-management/",
        "https://www.enterpriseai.news/tag/hpe/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/data-center-shutterstock-370x290.jpg"
    ]
}