{
    "title": "HP Goes Hybrid With 3PAR, Adds File Persona",
    "text": "For all the talk about all-flash arrays, there are still companies and customers who want hybrid arrays because they think machines that mix flash and disk storage offer the right mix of price and performance for specific jobs. This is an argument that will not be settled until the last disk drive head crashes into the last spinning platter.Perhaps when we are all very old, perhaps not.In the meantime, companies have to make the products that customers will buy and use, and to that end Hewlett-Packard is unveiling a new hybrid disk-flash array in the 3PAR family and its intent to make hybrid arrays up and down the line. The launch of the hybrid 3PAR StoreServ 7440c array comes only months after HP launched the StoreServ 7450, an all-flash array that HP's executives said delivered flash capacity at the price of disk. The all-flash StoreServ 7450 sat smack dab in the 3PAR line, with entry disk-based StoreServ 7200 and 7400 servers at the low end where datasets are small and so are budgets and the StoreServ 10400 and 10800, big wonking arrays that have many controllers and span multiple racks.With the refresh that HP is announcing today, HP is offering a new StoreServ 7440c system, with the \"c\" standing for \"cores\" and \"cache\" and also indicating that it is a hybrid array. And as you can see from the family description below, HP has updated its entry StoreServ disk arrays so they can have flash drives added. The StoreServ 7440c has the same physical controller as that used in the all-flash StoreServ 7450, and the difference is that it supports both flash and disk. This makes a hybrid product line for all but the top-end StoreServ machines.But HP is also adding a new piece of software to the StoreServ arrays, called File Persona, which allows for file and object protocols to be run on the arrays in addition to the block protocols that the 3PAR products already supported. This software takes more cores and cache in the controller to run, and hence the \"c\" designation.The 3PAR StoreServ controllers are based on \"Sandy Bridge\" Xeon E5 processors from Intel, with anywhere from six, eight, or ten cores per socket depending on the model, and they have custom ASICs created by HP that perform certain functions like RAID data protection and inline de-duplication. (HP does not yet have data compression available on the StoreServ family, but Vish Mulchand, director of product management and marketing for the HP Storage division, tells EnterpriseTech that it is on the roadmap.) One of the differentiators that HP has in the StoreServ line is that it can move metadata from disk to the controller memory very fast, and therefore it can have a much larger set of metadata describing the duplicate file locations than can other arrays that store all of their metadata in the controller memory. With this express indexing, as this feature is called, a StoreServ array can span up to 3.5 PB and still have deduplication work, rather than petering out at 70 TB or 80 TB, according to Mulchand.\"Here's what is interesting,\" says Mulchand. \"There are customers that start out with all-flash arrays and after six months the data is aging and they want to move it to a lower tier of storage. This is different from sub-LUN tiering, where you might be using 5 percent flash and 95 percent disk. This is maybe 50 percent flash and 50 percent spinning. So this gives you the ability to age data within the array.\"The StoreServ 7440c can deliver 900,000 I/O operations per second with 700 microsecond latencies, which is based on 100 percent random reads with 4 KB file sizes. The array can support up to 240 SSDs or up to 960 spinning disks and using 4 TB drives and a smattering of flash customers can get 3.5 PB of capacity across 38 disk enclosures. In an all-flash configuration, usable capacity is limited by the performance of the controllers since flash is orders of magnitude faster than disk and therefore tops out at 480 TB.The File Persona feature that has been added to the \"c\" variants of the StoreServ line has an interesting story. This feature is actually based on the Advanced File System (AdvFS) that Digital Equipment Corp created for its Tru64 Unix variant for its VAX and AlphaServer lines back in the dawn of the Unix Age. HP open sourced AdvFS back in the summer of 2008, and HP's techies have ported it to Linux and used some of its features to add file and object storage capabilities to the 3PAR arrays. Specifically, this file system layer supports the SMB file system commonly used with Windows and the NFS file system commonly used on Unix systems, and also offers object access through HTTP GET and PUT commands. File Persona costs $129 per usable GB on the arrays on which it runs.This file system add-on also enables a feature called StoreOnce Recovery Manager Central, which allows for snapshots of data to be instantly taken and passed off immediately to a StoreOnce backup appliance without interrupting the functioning of the StoreServ array. The first iteration of this snapshotting software will integrate with VMware's ESXi hypervisor; it will be available in January for a $2,500 licensing fee per controller.The base StoreServ 7440c array has a starting list price of $78,000 for a two-node array with four 400 GB SSDs and the 3PAR storage operating system. HP says it can get the cost of capacity down to $1.70 per GB, and that particular configuration on a StoreServ 7440c with 100 TB of SSD capacity, using 1.92 TB cMLC SSDs with a 4:1 data compaction from de-dupe, and with 100 TB of disk, using 1.2 TB SAS drives spinning at 10K RPM and assuming a 4:1 compaction.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-12-02 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "3PAR",
        "AdvFS",
        "disk",
        "File Persona",
        "Flash",
        "HP",
        "hybrid"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/3par/",
        "https://www.enterpriseai.news/tag/advfs/",
        "https://www.enterpriseai.news/tag/disk/",
        "https://www.enterpriseai.news/tag/file-persona/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/hp/",
        "https://www.enterpriseai.news/tag/hybrid/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/12/hp-3par-racks-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/12/hp-3par-family.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/12/hp-3par-storserve-table.jpg"
    ]
}