{
    "title": "In Stock Market Return, Dell Delivers Revenue Growth, Operating Loss",
    "author": "Doug Black",
    "date": "2019-02-28 00:00:00",
    "text": "In its return to publicly traded markets, Dell Technologies announced a mixed bag of final quarter and fiscal year financial results: fourth quarter (period ending February 1) revenue totaled $23.8 billion, up 9 percent YoY, with earnings of $331 million versus an operating loss of $69 million for the prior fourth quarter.For the fiscal year ended the first day of this month, Dell reported revenue of $90.6 billion, up 15 percent, with an operating loss of $191 million. Cash flow from operations was $7.0 billion.  For the year, the company said its net loss decreased 25 percent to $2.1 billion.The company ended the year with a cash and investments balance of $10.7 billion. In a press announcement, the company said that since the closing of its purchase of EMC in 2015, “Dell Technologies has paid down approximately $14.6 billion in gross debt, excluding Dell Financial Services related and subsidiary debt.”Summarizing the results, Dell Technologies CFO Tom Sweet emphasized the company’s revenue growth.“I am pleased with our strong fourth quarter and fiscal 2019 velocity and financial performance, including double-digit revenue growth for the year across all three business units and profitable share gains across our portfolio,” said Sweet. “In fiscal 2020 we’ll continue to run the business in a disciplined way. We will remain focused on generating long-term relative growth, share gain and cash flow while driving long-term value for shareholders and serving our customers’ full range of needs.”Dell said its Infrastructure Solutions Group delivered Q4 revenue of $9.9 billion, up 10 percent YoY driven in large part by $5.3 billion in servers and networking revenue, a 14 percent increase, and $4.6 billion in storage revenue, up 7 percent. Full year revenue for the group was $36.7 billion, up 19 percent, with servers and networking revenue of $20.0 billion, up 28 percent, and storage revenue of $16.7 billion, up 9 percent. Operating income was $1.3 billion for the fourth quarter, up 21 percent, and $4.2 billion for the full year, up 35 percent year over year.Client Solutions Group revenue for the fiscal fourth quarter was $10.9 billion, up 4 percent. Commercial revenue grew 9 percent to $7.8 billion, and Consumer revenue was down 6 percent to $3.1 billion. Client Solutions Group revenue for the full year was $43.2 billion, up 10 percent, with operating income of $555 million for the fourth quarter.VMware revenue was $2.6 billion for the quarter, up 17 percent, and $9.1 billion for the full year, up 14 percent. Operating income for the quarter was $872 million, or 33 percent of VMware revenue, and $3.0 billion for the full year, or 33 percent of VMware revenue.Fourth quarter revenue from other businesses, including Pivotal, Secureworks, RSA Security, Virtustream and Boomi, was $593 million, up 5 percent year over year. Revenue from other businesses for the full year was $2.3 billion, up 6 percent.“Fiscal 2019 was a year of great progress and momentum. We advanced our leading portfolio through a focus on innovation, added new customers through both direct and channel growth, and delivered solutions from the edge to the core to the cloud,” said Jeff Clarke, vice chairman, Products & Operations, Dell Technologies. “As data growth continues to explode alongside technology trends like 5G, AI and machine learning, we’ll continue to drive a wave of innovations to unlock the power of our customers’ data capital.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/Dell-Technologies-logo-416x416-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/Dell-Q4-19-earnings-022818-1024x476.png"
    ]
}