{
    "title": "Startup Qumulo Bets Data Trumps Storage",
    "text": "A month after announcing a $40 million funding round, scale-out intelligent storage startup Qumulo Inc. has emerged from stealth mode with a \"data-aware\" network-attached storage offering dubbed Qumulo Core.The startup also revealed a batch of new customers ranging from video studios and an energy company to university research institutes.Qumulo Core is \"data aware\" by incorporating real-time analytics directly into network-attached storage. That trend is increasingly seen as a key differentiator for storage, compute and network vendors. As storage volumes grow, the data aware approach to network attached storage is intended to provide greater visibility into which data is most valuable to a particular enterprise and where it is being stored. Proponents also say the approach provides insights into which users or applications are accessing which files along with the triage process involved in deciding what should be archived, backed up or deleted.The core of Core storage the Qumulo Scalable File System, which the startup says it build from scratch using a \"flash-first\" hybrid approach that incorporates flash and \"dense\" spinning disk storage. As a software application running as a user application on a Linux operating system, Qumulo Core will be sold using a software-as-a-service delivery model, the startup said.A hybrid storage appliance provides 24 TB of raw hard-disk capacity and 1.6 TB of raw solid-state disk capacity. Qumulo Core can be scaled from four to more than 1000 nodes in a single cluster and single namespace, Qumulo said.The integration of data analytics with network attached storage is intended to allow the scalable file system to storage, manage and curate data, making critical data accessible when needed.Qumulo touts its approach to intelligent storage as giving users the ability to manage and store billions of files as a way to improve storage efficiency and workflows. Qumulo Core is available now, the startup announced Monday (March 16) and is in production in commercial high-performance computing applications.Early customers include the University of Washington's Institute for Health Metrics and Evaluation, University of Utah's Scientific Computing and Imaging Institute, Sinclair Oil along with visual effects and design studios.Seattle-based Qumulo said it has been working with customers to come up with a network attached storage solution manage, store and curate digital assets.The startup announced a second funding round last month that included Silicon Valley heavyweight Kleiner Perkins Caulfield & Byers. The storage specialist has so far raised $67 million and recently added Sujal Patel, founder of Isilon Systems, to its board.The enterprise storage specialist was founded in 2012 by a group of Isilon veterans. It has also attracted storage experts from Amazon Web Services (AWS), Google and Microsoft, the company said.Co-founder Peter Godman, a former director of software engineering at Isilon, is Qumulo's CEO. At Isilon, Godman oversaw several releases of its OneFS distributed file system.\"Storage matters, but data matters more,\" Godman argued in a blog post lifting the veil on the startup. \"The storage industry creates waste by making storage opaque. The unsung hero of data reduction is not storing data. Storage administration is giving way to data administration.\"Former AWS engineer Neal Fachan, another Qumulo co-founder, serves as vice president of engineering. Before joining AWS, where he designed database technologies, Fachan helped develop Isilon’s OneFS clustered file system.In emerging research areas that depend on high-end computing, users say they increasingly need larger shared capacity and multiple, parallel I/O paths. \"We need really high performance I/O to process datasets that are much too large to fit into memory,\" Nick Rathke of the University of Utah Scientific Computing and Imaging Institute, noted in a testimonial for the storage vendor. Real-time visibility into data is \"icing on the cake,\" Rathke added.Qumulo said its Core software and Q0626 hybrid storage appliances are available immediately. Entry pricing for a four-node 100 TB raw capacity hybrid storage cluster begins at $50,000.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-03-16 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "data aware",
        "intelligent storage",
        "network attached storage",
        "Qumulo"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/data-aware/",
        "https://www.enterpriseai.news/tag/intelligent-storage/",
        "https://www.enterpriseai.news/tag/network-attached-storage/",
        "https://www.enterpriseai.news/tag/qumulo/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/Screen-Shot-2015-02-04-at-12.36.44-PM-370x207.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}