{
    "title": "New Panasas High Performance Storage Straddles Commercial-Traditional HPC",
    "author": "Doug Black",
    "date": "2018-11-13 00:00:00",
    "text": "High performance storage vendor Panasas has launched a new version of its ActiveStor product line this morning featuring what the company said is the industry’s first plug-and-play, portable parallel file system that delivers up to 75 Gb/s per rack on industry standard hardware combined with “enterprise-grade reliability and manageability.”Whereas Panasas has been focused almost entirely on commercial HPC, with the upgraded performance of ActiveStor Ultra the company said it can expand its market reach into traditional HPC, straddling both sectors.“The HPC storage buyer today has a choice to make,” Jim Donovan, Panasas CMO told us in an announcement pre-brief, “they can get performance at any cost, but in doing so they really sacrifice manageability and ease of use… Or you can choose simplicity, so you get manageability and reliability but give up something on the performance side – that’s enterprise players, like EMC Isilon, and we’d put ourselves in that category currently. With ActiveStor Ultra, we will achieve the highest levels of performance along with the manageability. It’s fast and simple, and that combination is unique.”Donovan said ActiveStor Ultra is the most significant Panasas announcement in a decade. It includes PanFS 8, which runs on Linux and is a “completely reeingineered” portable network attached storage software implementation that supports an “appliance” deployment model running on industry standard commodity hardware.“Panasas has achieved a re-set with its ActiveStor Ultra platform which is designed to deliver the highest levels of HPC performance while offering the plug-and-play simplicity, reliability and low total-cost-of-ownership that customers have come to expect,” said Steve Conway, senior research VP at Hyperion Research. “Panasas reports that the new PanFS 8 portable parallel file system will be available at highly competitive price points. It could be a potential game-changer for the company and have a strong impact on the HPC storage industry in general.”ActiveStor Ultra is designed for extreme performance and extreme scalability configurations and supports flexible networking options, according to Panasas, including Ethernet, InfiniBand and Omni-Path. It is deployed as an integrated appliance consisting of hardware (hybrid storage nodes containing flash and SATA media), the PanFS 8 parallel filesystem and Panasas DirectFlow parallel data access protocol. Industry-standard NFS and SMB client protocols are also supported.ActiveStor Ultra is a portable file system, meaning it can work on any properly configured hardware. This, Donovan explained, contrasts with \"software-defined, which we take to mean you can take a license and run it on any old hardware. That's not the case for us. We'll deliver it as an appliance, and the portability side of it will allow us to move it to other hardware platforms as they become available, as well as the potential for OEM-type relationships with other hardware storage providers in the HPC space.\"Donovan said ActiveStor Ultra’s most significant architectural change is automated “intelligent data placement” within the PanFS 8 across three tiers of media: metadata on NVMe, small files on SSDs, and large files on HDDs, resulting in optimized performance for all data types, according to Panasas.“We’re now separating large files and small file onto storage devices that match the access charactersistics of that type of data , and we’re changing the algorithms that manage that,” Donovan said. “Hard drives are good at delivering bandwidth, you want to give them something large to work with, so we segregate out large files and put them into a Linux file system running on the hard drives in our new storage node. Small files are an IOPS-type workload, so we put them onto SATA SSD because that’s more than adequate for small file type workloads.“Metadata processing actually desires low latency, so we put an NVMe SSD into the same box and store the metadata there. But we’re also storing the metadata using a database because that software stack is optimized for small transcational operations much more than a traditional file structure is. …intelligent three tiered data placement within the storage node lets our system support mixed workloads and high performance as a result of these decisions.”Each ActiveStor Ultra has four storage nodes, and each node has six HDD drive slots and two SSD drive slots. Each node supports six to eight HDDs or zero to two SSDs. Each ActiveStor Ultra can deliver 6-7.5 GB/s per 4U enclosure, depending on the configuration. With a minimum configuration of three ActiveStor Ultra enclosures, the total bandwidth performance is expected to be between 18-22 GB/s. Performance and capacity scale linearly without limitations as more racks are added, according to Panasas.Panasas puts emphasis on automating tasks – route management, node integration, capacity balancing, failure recovery, scrubbing, tuning and retuning for workload changes – that otherwise would take several system admins to handle. According to Donovan, even the company’s largest deployment, more than 25 petabytes in a single namespace, is managed by a part-time worker.While task automation lowers TCO, it combined with workload optimization delivers, according to the company, the fastest “dock-to-data,” or ‘time-to-first-IO,” less than an hour, in the high performance storage sector, according to Panasas.“With the system optimally tuned for 80 percent of the workloads,” Donovan said. “users can easily add new workloads without tuning or retuning. Automatic distributed erasure coding-based data protection delivers extreme reliability and eliminates the need for manual intervention.”Privately held, Sunnyvale-based Panasas said ActiveStor Ultra will be available early in the second half of next year.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/Panasas-ActiveStor-Ultra-1118-1-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/Panasas-logo.png"
    ]
}