{
    "title": "Docker Founder Joins Blockchain Storage Startup",
    "author": "George Leopold",
    "date": "2018-03-12 00:00:00",
    "text": "Serial entrepreneur Ben Golub, co-founder and former CEO of application container pioneer Docker Inc., has landed at a blockchain-based cloud startup called Storj Labs.The Atlanta-based company launched in 2015 is attempting to ride the wave of decentralized infrastructure fueled by blockchain technology and associated digital ledgers to offer cheap, encrypted cloud storage. Storj Labs announced Monday (March 12) that Golub will serve as its executive chairman and interim CEO.The startup’s crowd-sourced approach to cloud storage challenges the prevailing hyperscale model of datacenter operators. Instead, it offers cryptocurrency to storage “farmers” who rent their unused hard drive capacity as a storage layer. Storj said it has so far assembled about 150,000 storage nodes holding more than 60 petabytes of data. Individuals and organizations renting storage capacity are paid in a startup’s “utility token” on the Ethereum blockchain.Over the last two years, Storj claims it has forged “the largest decentralized cloud storage network without ever owning a datacenter.”The addition of Golub, who is credited with making application containers a core infrastructure technology, gives Storj a measure of credibility in the evolving cloud storage sector where it claims a “first-mover advantage” in decentralized cloud storage. Before launching Docker, Golub was CEO of open source storage vendor Gluster, which was acquired by Red Hat (NYSE: RHT) in 2011.“We are making decentralized storage part of a broader decentralized stack for distributed applications by acting as a base layer storage infrastructure,” Golub explained in a blog post.The startup further hopes to differentiate itself from a growing number of well-heeled storage entrants, many focusing on data-intensive workloads, by offering “a new platform that will help customer[s] build and deploy decentralized apps with decentralized storage,” according to Shawn Wilkinson, founder and chief strategy officer at Storj.The object storage network is built around blockchain functionality used by Storj to rent unused drive capacity from “tens of thousands” of individuals and organizations compensated with the startup’s Ethereum-based tokens. So far, Storj claims more than 70,000 customers in the form of API registrations.Golub drew parallels between Docker’s startup phase and Storj’s open- source effort to use blockchain technology to build a decentralized storage layer. “At Docker, we used to talk about building a programming layer for the Internet… to build applications and services that could run and interoperate seamlessly across the millions of devices connected by the Internet,” he noted.While the decentralized approach appears at first glance to be a hodgepodge, the startup insists decentralized storage is more reliable than datacenter approaches. For example, it said individual files can be distributed over dozens of nodes to prevent loss.From a security standpoint, Golub added: “There is no central location to attack, only the user knows where each of their shards are stored and all the data is encrypted.”The startup also claims its distributed approach addresses network bottlenecks by using multiple nodes to deliver files “simultaneously in parallel from the edge.”All this is delivered via large and unused storage capacity rented from “farmers” in exchange for cryptocurrency.Storj completed a $30 million token sale in 2016 for its ERC-20 token that can be used on the storage network to purchase services. The more than 150,000 storage nodes assembled thus far cover 205 countries and territories, the startup said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/Screen-Shot-2018-03-12-at-1.55.43-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}