{
    "title": "Edge Caching: Key to Edge-to-Cloud Computing & Storage",
    "text": "Today, our enterprise workforce is on the go.  You're likely one of those people.  The worker who checks into the office from home, or from a wifi hotspot in your car and from offices anywhere in the world.  In fact, today the vast majority of a business’s data is produced outside the main office.  It’s often mission critical data, and having the ability to utilize, share and secure this data is essential.  It’s also important for companies to store it at the edge. And they are. Data at the edge is a mountain of information that takes time and money to safely store and manage – in the home office data center or in the cloud.Edge to cloud computing is one of the top IT trends for 2018. And there is a learning curve when it comes to organizations’ learning how to tackle unstructured edge data. This aspect of digital management has become an urgent call from companies of all sizes.Edge storage strategies are not always intuitive.  Corralling a company’s data at the edge is commonly done in a labor intensive, less-than -economical fashion. Here are some common edge storage mistakes made by enterprise organizations today:Too many people on the job. There is a great deal of effort expended in managing edge data and storage. One common scenario is the out-of-office laptop that requires its data to be transferred to the main data center, which in turn requires the employee to spend time on manual data transfer. Another is when an offsite server fails, real people need to get to that location and can spend days restoring the data from a backup to get the company’s data center up and running.Spending too much on the edge. With advances in AI and machine learning, edge storage is needed more than ever to support file services. However, the most common need is to provide remote offices and branch offices with a place to safely and securely land their data allowing the whole of the company to eventually access it.  This means spending significantly on a capability to store the data at the edge with a centralized management platform in the cloud.Taking a moment to consider the path away from the edge. Video surveillance storage is often stored in the cloud and not at the edge. The cloud seems attractive: it’s secure, it provides inherent redundancy and low cost. In practice, however, considerations need to be addressed. How quickly does the organization need to retrieve its video data? Can the system continue recording during an internet service interruption?  These use cases point to the need for edge storage.A hybrid solution that combines edge and cloud storage is the modern solution for the situations outlined above.The way to create cloud and edge synergy is edge caching – often in the form of edge gateway technology. It brings together files from legacy servers, it combines all of the data in the cloud of the enterprise’s choice, while providing the user with the same experience as a traditional network share. The addition of smart local caching makes everything feel as fast and as close as in your home office. These caching devices (software and hardware) enable the user to continue to edit frequently used files and create files during an internet service interruption.Storing data in the cloud, but making it as accessible as if it were stored locally, opens up a world of opportunity for the ROBO workforce.  Now collaboration opportunities exist that were not possible before. Dark data is not so dark any longer.  Instead it is housed in a searchable and shareable data space. Edge-to-cloud allows a user to see and manipulate data, from everywhere.  And that can have real impact on an organization’s performance and bottom line.Aron Brand, CTO at CTERA Networks.",
    "date": "2018-09-19 00:00:00",
    "cats": [
        "Cloud",
        "Edge/IOT",
        "Slider: Cloud",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "edge computing",
        "video data",
        "video data analysis"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/edge-computing/",
        "https://www.enterpriseai.news/tag/video-data/",
        "https://www.enterpriseai.news/tag/video-data-analysis/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/edge-computing-shutterstock_753122353-370x290.jpg"
    ]
}