{
    "title": "IBM Eyes Object Storage on Tape",
    "author": "George Leopold",
    "date": "2015-04-09 00:00:00",
    "text": "Despite a steady stream of storage technology advances, IBM scientists insist there is still plenty of life left in left in tape storage along with new cloud applications like object storage.IBM Research this week claimed a new storage density record of 123 billion bits of uncompressed data per square inch on inexpensive particulate magnetic tape. The areal recording density is said to be equivalent to a 220-terabyte tape cartridge, the researcher said.The tape storage milestone is the latest in a series recorded by IBM Research and industrial partner FujiFilm Corp. of Japan. They demonstrated the record tape storage density as part of a project with Swiss-based ETH Zurich, which uses IBM tape storage technology for central data backup.As solid-state storage devices and \"data aware\" cloud infrastructure begin to dominate the storage landscape, IBM maintains that the 50-year-or-so-old tape storage remains relevant, and not just for backing up data or archival storage. Researchers insist it also provided another storage option for big data and cloud computing applications.The partners claimed the areal density record represents a 88-fold improvement over industry standard LTO6 cartridges as well as a 22-fold improvement over IBM's current enterprise tape storage product.IBM said several new technologies contributed to the areal recording density milestone. Along with advanced servo control techniques that delivered a density of 181,000 tracks per inch, the researchers leveraged signal-processing algorithms for the data channel. That enabled reliable operation of a 90-nanometer-wide giant magneto-resistive reader, the researchers said. They also developed new write field head technology that leverages much finer barium ferrite BaFe) particles.IBM has been working with FujiFilm since 2002 on optimizing dual-coat magnetic tape based on BaFe particles. The result of the collaboration has been increasing precision in controlling the position of read-write heads. Hence, the number of tracks squeezed onto half-inch-wide tape has dramatically increased over the last decade.ETH Zurich, the Swiss research university and IBM partner, said it transfers about 60 terabytes of data daily to tape storage. Its tape library totals more than 5.5 petabytes of research data. Tape remains a viable storage media \"for large amounts of data for its transferability of data in Linear Tape File System applications and its low energy consumption,” Tilo Steiger of ETH Zurich said in a testimonial on behalf of IBM Research.Researchers insisted that low-cost tape storage—pennies per gigabyte—along with steadily increasing areal recording density means applications could expand beyond video archiving, file backup and disaster recovery to include cloud applications like object storage.To that end, IBM researchers are looking to integrate advanced tape storage with cloud object storage systems like OpenStack Swift. That research would seek to develop object storage on tape, potentially allowing users to migrate \"cold data\" to cheap cloud storage tiered for backup and archival uses.A prototype tiered storage system is being demonstrated by IBM at the upcoming National Association of Broadcasters conference.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).I am VERY interested in this media as a cold storage solution. How is this coming along? I grow my storage at 11 terabytes a day. I look in the future and I don’t like the checks that will have to be written.How is the data categorized at IBM, for hot to warm to cold data?As IBM solution architects, we built an private 100PB tape-based object cloudstore for a major U.S. bank. Their 30 year data retention requirement was solved using an object-based approach, and the key in controlling costs was building a tape NAS (hybrid storage system), rather than the traditional ‘all-disk’ approach. CAPEX and OPEX is dramatically lower using a tape-based tier for scale-out capacity.We’re presenting our ideas at IBM’s EDGE event in September; if you’d like to learn more, feel free to reach out.John Aiken\nRe-Store, Inc.\n858.356.5444\njohn@re-store.net",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/ibm-tape-drive-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g",
        "https://secure.gravatar.com/avatar/22ed807761a27f3afe3107a66c93d05d?s=60&r=g",
        "https://secure.gravatar.com/avatar/13be6ef1ad9c611433ec1665c4416a96?s=60&r=g"
    ]
}