{
    "title": "Flocker Gets a Flash Storage Manager",
    "text": "With persistent storage emerging as a key issue in application container deployments, a flash storage vendor has partnered with container data management software specialist ClusterHQ to build a storage management plug-in for the open source container platform.Kaminario, an all-flash storage vendor based in Needham, Mass., said this week it is partnering with ClusterHQ to roll out the storage manager for Flocker, the open source container data volume manager. The partners said their approach addresses a key challenge highlighted in a recent ClusterHQ market survey: persistent storage has in some cases overtaken security as the biggest hurdle to deploying application containers in production environments.The Flocker plug-in would allow users to run and manage Docker application containers on Kaminario's all-flash storage system dubbed K2. As containers transition from testing to production, suppliers such as Kaminario are offering ways to manage and scale production workloads using open source platforms. All-flash storage approaches are being touted as a way of handling dynamic workloads.Flocker is designed to take on the storage virtualization challenge posed by Docker. ClusterHQ has been positioning Flocker as a way for DevOps teams to containerize databases and state-ful micro-services by directly attaching storage to a container and then transferring containers and data together between servers.San Francisco-based ClusterHQ announced a partner network this time last year to deliver storage drivers for its Flocker container data management software rolled out in 2014. Its enterprise storage partners include ConvergeI/O, Hedvig Inc., Huawei, NetApp, Nexenta and Saratoga Speed.Storage drivers for Flocker would allow ClusterHQ's partners to offer their customers portable storage options needed to leverage containers for a range of applications, including databases, in enterprise production environments.ClusterHQ and Kaminario noted a recent user survey commissioned by Docker that found growing deployment of applications in containers, including 42 percent who said they have deployed databases in containers. The partners argued that accelerated application development and deployment scaling will require new storage management tools and emerging all-flash platforms that can support legacy as well as application containers and other micro-services.Founded in 2010 by former EMC and NetApp employees, Kaminario's all-flash storage arrays are positioned as a way of handling transaction, analytics and other diverse workloads. The partnership with ClusterHQ adds a storage virtualization component via the Flocker container data manager.The partnership with ClusterHQ addresses growing demands on enterprise IT departments and software-as-a-service vendors to accelerate the delivery of distributed applications. \"Containers are gaining in popularity among them as they are looking to manage their dynamic workload with a scale-out infrastructure in the open source container-based environment,\" Kaminario CTO Shachar Fienblit noted in a statement.According to the web site CrunchBase, Kaminario has so far raised more than $100 million in four venture rounds.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-08-30 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "ClusterHQ",
        "containers",
        "Docker",
        "Flocker",
        "Kaminario",
        "storage management"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/clusterhq/",
        "https://www.enterpriseai.news/tag/containers/",
        "https://www.enterpriseai.news/tag/docker/",
        "https://www.enterpriseai.news/tag/flocker/",
        "https://www.enterpriseai.news/tag/kaminario/",
        "https://www.enterpriseai.news/tag/storage-management/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-30-at-11.44.50-AM-365x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}