{
    "title": "Object Storage is Latest Front in Cloud Price Wars",
    "text": "Storage, not computing resources, has emerged as the latest battleground in the public cloud price wars, according to an industry index.Market tracker 451 Research said this week the cloud storage battle lines were drawn during the third quarter of 2016 when it detected a reduction in object storage prices offered by IBM SoftLayer. Rivals Amazon Web Services, Google (NASDAQ: GOOGL) and Microsoft NASDAQ: MSFT) responded in kind, prompting the market analyst to predict that prices for virtual machines—long the focus of cloud price wars—will continue to decline along with object storage. Relational databases \"are likely to be the next competitive front,\" 451 Research predicted.The leading public cloud providers are \"cutting object storage prices to avoid standing out as expensive,\" 451 Research analyst Jean Atelsek noted in releasing its cloud price index on Thursday (April 20). \"This is the first time there has been a big price war outside compute, and it reflects object storage’s move into the mainstream.\"The flip side, Atelsek added, is added complexity when comparing public cloud providers. Still, enterprises adopting multi-cloud strategies designed to avoid overreliance on a single vendor appear to be willing to weigh complex technical tradeoffs.The IBM (NYSE: IBM) public cloud offering along with rivals Google Cloud Platform and Microsoft Azure together are estimated to account for about 24 percent of the public cloud market, according to another cloud tracker, Synergy Research Group.All three are chasing market leader Amazon Web Services (NASDAQ: AMZN), which retains a 40 percent share of the market for public infrastructure and platform services market, Synergy reckons.Another recent cloud survey by Wikibon found that 59 percent of respondents stored more than half of their data in a private could while 28 percent trust the public cloud. Those trends are expected to reverse over the next several years as public cloud security increases.Storage technology advances along with market forces also have contributed to the cloud storage price declines. For example, prices for all-flash storage array are declining and new technologies offering better performance such as Intel Corp.'s 3-D Xpoint memory technology are being integrated into solid-state drives.Intel (NASDAQ: INTC) announced its first Optane SSDs based on 3-D Xpoint memory technology in mid-March. These and other flash advances specifically target datacenter storage.Partner VMware (NYSE: VMW) rolled out a virtual storage platform earlier this month that it claims is the first to incorporate Optane SSDs. Along with performance gains such improved \"sequential-write\" application performance, these all-flash approaches are now providing \"native security\" features such as encryption of data at rest.Cloud offerings also are now supporting emerging cloud native applications along with applications containers.While cutthroat competition in the public cloud market is now seen expanding to object storage, 451 Research also noted in its latest pricing index that profit margins remain healthy. That reflects the ongoing enterprise shift to hybrid clouds and improving storage security, industry observers add.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-04-20 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "AWS",
        "cloud pricing",
        "Google",
        "IBM SoftLayer",
        "Microsoft Azure",
        "object storage",
        "public cloud",
        "storage security",
        "virtual storage platforms",
        "VMs"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/cloud-pricing/",
        "https://www.enterpriseai.news/tag/google/",
        "https://www.enterpriseai.news/tag/ibm-softlayer/",
        "https://www.enterpriseai.news/tag/microsoft-azure/",
        "https://www.enterpriseai.news/tag/object-storage/",
        "https://www.enterpriseai.news/tag/public-cloud/",
        "https://www.enterpriseai.news/tag/storage-security/",
        "https://www.enterpriseai.news/tag/virtual-storage-platforms/",
        "https://www.enterpriseai.news/tag/vms/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/Screen-Shot-2017-04-20-at-11.41.43-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}