{
    "title": "Survey: HPC Storage Sector is Booming",
    "author": "George Leopold",
    "date": "2015-11-16 00:00:00",
    "text": "Nearly one-third of storage systems spanning storage area networks to cloud platforms reached 1 petabyte or greater capacity in 2015, according to a user census that also projects more than half of installed storage systems will top the 1-PB level by 2020.The storage user survey released by market watcher Intersect360 Research also said surging storage demand driven by big data projects and emerging storage technologies has resulted in \"unfettered growth of total storage\" over the least five years. By contrast, only 9.6 percent of users surveyed in 2010 reported storage capacity of 1 GB or greater.\"Growth in both new data sources and existing databases is significantly exceeding the ability of organizations to manage and leverage data for advancing R&D efforts and to make organizational decisions,\" the user survey concluded. The push for big data analytics \"is creating a new set of HPC demands and opportunities, in which storage, by definition, is a major component.\"The user survey also ranked leading HPC storage suppliers based on the number of installed systems. DataDirectNetworks leads with a 13.9 percent share of the storage market followed by IBM (NYSE: IBM) with 11.8 percent and NetApp (NASDAQ: NTAP) at 8.3 percent. Despite dominance by DDN and IBM, the market researcher said there remains \"much opportunity for growth for [emerging] vendors as well as other storage suppliers.\"Indeed, a crop of storage startups is targeting both enterprises and the HPC market with technologies like scale-out network-attached storage. Among them is Seattle-based Qumulo, which announced during this week SC15 conference this week that the University of Utah's Scientific Computing and Imaging Institute would use its Core intelligent storage platform to manage data used in visualization, scientific computing and imaging analysis projects.Intersect360 Research reckons there are more than 50 companies are currently vying for a share of the HPC storage market. The sector also is seeing the beginnings of consolidation, particularly with the blockbuster merger announced last month between Dell and EMC. That deal was driven in part by Dell's desire to sharpen its focus on large enterprises and the HPC.While the $67 billion merger reportedly still faces major hurdles such as a potential a $9 billion tax on the deal, the market researcher said a successful merger would have a significant impact of the HPC storage market in 2016.EMC's (NYSE: EMC) rivals would gain if the deal unravels, the analyst said: \"EMC has a revenue position that is greater than its share of survey responses would indicate, and Dell is one of the leaders in servers for HPC. If there is any confusion, lack of communication, or strategic uncertainly in the acquisition, other storage vendors could gain share from EMC in the near term.\"Meanwhile, cloud storage platforms have made slight gains in the overall storage market, accounting for an estimated 4.7 percent of total storage capacity in 2015. Amazon Web Services (NASDAQ:AMZN) remains the primary supplier, and the market watcher expects \"cloud usage to be one of our fastest growing segments, while also being the smallest.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-16-at-3.07.31-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}