{
    "title": "Consider a ‘Genetically Diverse’ Security Strategy",
    "text": "Worldwide, the HPC market is booming as the industry enters the era of exascale-size data sets, and supercomputing applications expand beyond the academic and scientific world into financial services, life sciences, manufacturing, oil and gas, aerospace, defense, and more. Analysts predict the HPC market will reach more than $44 billion by 2020.For many more industries, HPC – and supercomputing – are the future. And, while some industries, such as aerospace, have embraced the complexities of working with huge amounts of data to solve problems, organizations that have the data, but not the HPC savvy, are quickly falling behind.Data rules HPC applications and commands special attention in protection and security. The large volumes of data in HPC applications make it an ideal candidate for enterprise storage, protecting data for decades as HPC organizations track and analyze data sets for years after inception.Of the options for storing and protecting large-scale data, including public, private and hybrid cloud storage, hybrid cloud is probably the most efficient. It works well for small to mid-size HPC organizations, as well as organizations with small data sets and a large compute cycle.HPC-ready organizations examining cloud storage should consider:In the event of a hack, organizations need to analyze the situation as they would a data set, to access and search their data for signs of tampering and determine if the hackers modified or deleted data. Data deletion hurts the most. With petabytes of data on hand, lost data means significant resources and time lost.One way to mitigate risk to is employ genetic diversity in HPC data storage. The essence of genetic diversity comes from our grandmother’s wisdom: don’t keep all your eggs in one basket. It’s so simple, yet many organizations miss this important step.Organizations should implement a hybrid cloud storage model, dispersing data across a mix of on-premises, private and public cloud storage to create a seamless and secure solution, customized to each organization.For HPC, we recommend a three-part system, with one copy of data in the cloud, one on-site and one off-site. The combination of private cloud with the industry-accepted SHA-256 hashing algorithm, and disk and tape technologies ensures security and data preservation.The next step: data validation over time to ensure continuity. Robust storage systems can confirm that data five years old has not changed, so it can be analyzed properly.For those industries without HPC or proper data storage management, we recommend getting a move on. HPC is vital for growth, and great, positive impact awaits organizations that manage their data effectively.Matt Starr is the chief technology officer of deep storage technology vendor Spectra Logic. Follow him @StarrFiles.",
    "date": "2016-04-12 00:00:00",
    "cats": [
        "Security",
        "Slider: Security",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "cloud storage",
        "data security"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-storage/",
        "https://www.enterpriseai.news/tag/data-security/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/storage-370x246.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/Matthew-T.-Starr-Spectra-Logic-300.jpg"
    ]
}