{
    "title": "Qualcomm Invests in RISC-V Startup SiFive",
    "author": "George Leopold",
    "date": "2019-06-07 00:00:00",
    "text": "Investors are zeroing in on the open standard RISC-V instruction set architecture and the processor intellectual property being developed by a batch of high-flying chip startups.Last fall, Esperanto Technologies announced a $58 million funding round. The chip IP vendor is incorporating more than 1,000 RISC-V cores onto a single 7-nm chip. Data storage specialist Western Digital (NASDAQ: WDC) is an early investor in Esperanto, Mountain View, Calif.This week, another RISC-V startup, SiFive, announced a $65.4 million funding round that included new investor Qualcomm Ventures. SiFive, San Mateo, Calif., has so far raised more than $125 million, and is seen as a challenger to chip IP leader Arm.Observers note that wireless modem leader Qualcomm is among Arm’s biggest customers, making its investment in SiFive intriguing. Also participating in the Series D round were existing investors Chengwei Capital of Shanghai along with Sutter Hill Ventures and Spark Capital. Intel Capital and Western Digital also were early investors.Western Digital serves on the board of the RISC-V Foundation along with representatives of Google (NASDAQ: GOOGL), Nvidia (NASDAQ: NVDA) and the University of California at Berkeley.Founded in 2015, SiFive is developing RISC-V core IP with the goal of expanding access to custom silicon. The chip startup claims more than 100 design wins based on its system-on-chip (SoC) templates. The template allows customers to accelerate the fabrication of RISC-V processors and custom SoCs, moving from design to prototyping to the delivery of sample chips “within weeks,” the company claims.During the prototyping phase, customers can run application code on virtualized chips to tweak performance before chips are taped out, the company notes.The Silicon Valley startup has design facilities in: Beaverton, Ore., near Intel’s Hillsboro campus; Austin, Texas; Boston; Bangalore and Pune, India; Shanghai; the global chip manufacturing hub in Hsinchu, Taiwan; and Seoul, South Korea.Qualcomm’s participation in SiFive’s latest funding round attracted notice since the wireless chip maker is a long-time customer of Arm. “SiFive has established itself as a leader in the RISC-V space, making significant contributions to the broader semiconductor industry through its unique design methodology,” said Quinn Li, who heads Qualcomm Ventures.Qualcomm is a founding member of the RISC-V Foundation.Industry watchers note that SoC designs increasingly require a portfolio of IP cores to accelerate chip design. “You can't build an SoC with just the CPU,” Mike Demler, a semiconductor technology analyst with The Linley Group, noted in a tweet. “But it's just one small step toward building a comprehensive IP ecosystem. That is Arm’s biggest advantage.”Hence, SiFive positions itself as an Arm competitor able to deliver custom silicon “as device manufacturers rapidly adopt domain-specific application processor designs in response to the point of compute migrating to the [network] edge.” Those edge applications require extremely low power consumption.SiFive’s key differentiator is its claimed ability to compress the design, prototyping and chip sampling steps, enabling the delivery of custom silicon in a few weeks. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/generic-system-chip-processor-shutterstock-530410393-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}