{
    "title": "Dell Cranks Up EqualLogic Capacity and Performance",
    "author": "Timothy Prickett Morgan",
    "date": "2013-12-10 00:00:00",
    "text": "A month ago Dell went private, getting Wall Street off its back for the first time in many decades, and the DellWorld customer and partner event this week down in its hometown of Austin, Texas is a coming out party of sorts. The event will feature some product announcements, such as an upgraded EqualLogic storage line, and also a more broad discussion about Dell’s aspirations in the datacenter and how being a private company will allow it to be more flexible and responsive.Since company founder Michael Dell retook control of the company in early 2007, Dell has learned a number of things, and an important one is that it takes a certain amount of continuing investment in engineering to be a supplier in the modern IT era. Dell, like its rivals Hewlett-Packard and IBM, have made numerous acquisitions in recent years to shore up their storage, networking, and systems software businesses after letting upstarts get out ahead of them.It has been five years since Dell acquired EqualLogic to use it as the foundation of a revamped enterprise-class storage business, and Travis Vigil, executive director of the Dell Storage division, says that EqualLogic has found its place in the datacenter predominantly as back-end storage for highly virtualized server environments. Vigil says that in recent years, EqualLogic arrays have been a popular companion to servers that are virtualized using VMware’s ESXi hypervisor and that customers tend to deploy the hypervisor with Site Recovery Manager, the high availability software that is a key part of the vSphere management tools for ESXi. Not surprisingly, after lots of work by Microsoft to bring its hypervisor and related tools on par with the ESXi and vSphere combo, Dell is seeing Hyper-V on the rise among EqualLogic shops.Since acquiring EqualLogic, Dell has sold some 140,000 arrays worldwide to over 57,000 customers, and Vigil says the company is adding around 1,000 new customers to the fold every month. About 20 percent of the arrays end up at large enterprises – those with more than 5,000 employees – with another 35 percent going to midrange shops (with between 500 and 5,000 employees) and the remaining 45 ending up at smaller shops.Dell wants to keep the EqualLogic momentum going, and to that end it has substantially re-engineered the EqualLogic arrays. With the PS6210 series being launched this week at DellWorld, the controller at the heart of the arrays is being upgraded to a new XLP MIPS engine made by Broadcom. The controller is shifting from DDR2 memory used in the PS6110 series to DDR3, which has higher capacity and performance, and the cache memory on the controller is being boosted to 16 GB per array, a factor of four higher than in the PS6110 array.The EqualLogic controller software is being extended to support 64-bit processing, which is helping to goose performance, and has optimizations in it to align its performance to that of the 800 GB flash drives that Dell is using in the array, which are Lightning units from SanDisk.Add it all up, and the PS6210 has about three times the I/O operations per second of the PS6110 it replaces using a read benchmark that was shuffling 4 KB chunks of data. Using a hybrid setup that mixes disk drives and flash drives, the PS6210 can crank through about twice as many database transactions as the PS6110, and the newer array can handle 2.4 times the number of virtual desktops if the arrays are back-ending a VDI broker such as XenDesktop from Citrix Systems or View from VMware.If you gang up eight of the arrays and link the together, as Dell expects many enterprise customers to do, you can build a storage systems that can crank through 1.2 million aggregate IOPS. That was a 100 percent read benchmark using the all-flash version of the PS6210, and the average latency was 2 milliseconds for file reads.What Dell really wants to do, like every other array maker, is turn customers onto the use of flash to accelerate the performance of their applications. To this end, says Vigil, Dell has adopted mixed-use MLC flash, boosted the controller to push it hard, and chopped prices on the array enough that buying an all-flash version of the array has more performance and capacity at a lower price than configuring the same array with 15K RPM SAS disk drives.“This is the same flash-at-the-price-of-disk strategy that we used with our higher-end Compellent arrays,” explains Vigil. “And we think this will speed the adoption of SSDs in the EqualLogic market, too.”The EqualLogic Array Software 7.0 controller code that is being announced along with the new hardware includes a new policy-based access control security layer, which can span multiple arrays and lock down data access for particular administrators or applications. The FluidFS file services front end for the EqualLogic arrays is revved to V3, and among other things now supports SMB 2.1 and NFS v4 file services. The FluidFS software also provides de-duplication and compression services for the EqualLogic arrays, sniffing out duplicate data and removing it and finding old data to compress it. By doing so, enterprises can cut their storage capacity down by around 50 percent, according to Vigil. FluidFS is using some of the compression and de-dupe algorithms that Dell got thanks to its acquisition of Ocarina Networks back in the summer of 2010.Here are the six different models of the EqualLogic array lineup:The entry PS6200 arrays based on SAS drives are designed to cost under $50,000, including the controller software and three years of technical support bundled onto the machines. The PS6210XV, which as 24 SAS drives with 300 GB of capacity spinning at 15K RPM, for a total of 7.2 TB of raw capacity, costs $47,800. If you want more capacity and can tolerate lower speed on the drives, then the PS6210X with two dozen 600 GB SAS drives spinning at 10K RPM will double the capacity of the array; it costs $49,300. If you need more capacity than this, then the PS6210E, which uses 4 TB near-line SAS drives that spin at 7.2K RPM, will give you 96 TB of raw capacity for $72,000. If performance is the main thing, then the PS6210S array loaded up with those 800 GB flash drives is probably the one, which gives you 19.2 TB of capacity and around 150,000 IOPS for $170,000. If you can get by with 400 GB SanDisk drives, you can reach the top end 1.2 million IOPS for an eight array cluster with 76.8 TB of raw capacity for around $780,000.The new EqualLogic arrays will begin shipping this month, as will the updated controller and FluidFS software for them.If you can get by with 400 GB SanDisk drives, you can reach the top end 1.2 million IOPS for an eight array cluster with 76.8 TB of raw capacity for around $780,000. Looks like a typo. An extra zero perhaps.Nope. That is the price that Dell gave me for that configuration with all flash on eight arrays linked together.Are the price points still about the same, a year later? Everyone else is quite tight-lipped about pricing. Did the original pricing include Dell EqualLogic Software 7.0?",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/12/EqualLogic-PS6210-array-stack-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/12/dell-equallogic-table.jpg",
        "https://secure.gravatar.com/avatar/4769f95cccd4f08a2cb6ee5ab24155ba?s=60&r=g",
        "https://secure.gravatar.com/avatar/857d80f6af55cb0c9a17a7006dc3b8d4?s=60&r=g",
        "https://secure.gravatar.com/avatar/b58119bc514af8d653c7cf8d93a3c812?s=60&r=g"
    ]
}