{
    "title": "Dell Taps Nutanix For Converged Server-SAN Appliances",
    "author": "Timothy Prickett Morgan",
    "date": "2014-06-25 00:00:00",
    "text": "If Dell had not spent so much money taking itself private last year, it might be spending billions of dollars acquiring converged system upstart Nutanix. But instead – and very likely because Nutanix is not for sale and rather has its eye on going public sometime in the not-too-distant future – Dell has opted to partner with Nutanix to create server-storage hybrids based on its PowerEdge systems and the Nutanix Virtual Computing Platform.Nutanix is one of several companies, including VMware, SimpliVity, Scale Computing, Pivot3, and Maxta, who have all cooked up software that allows for the pooling of virtualized server slices and the storage pool that serves them across clusters of machines. The storage is local on the nodes in most of these systems, but looks and smells like shared SAN storage to the server virtualization hypervisors and usually has all of the advanced snapshotting and replication features that a physical SAN offers. The idea is to replace the costly SAN array and switches by using commodity servers and their relatively cheap storage, often with a mix of flash and disk for performance and capacity. These virtual SAN-server hybrids are not for all workloads, of course, but they do point out the growing trend towards defining advanced functions in software and running it on more generic hardware. The fact that VMware did not have vSAN software from the get-go is why these upstarts got established in the market in the first place, and now they will have to fight VMware, which has come on strong here in the past year with a radically improved vSAN for its virtualization stack.Nutanix, which was founded in 2009, got out there early and is growing by leaps and bounds based on the limited statistics that the privately held company reveals. The company uncloaked from stealth mode in the summer of 2011. CEO Dheeraj Pandey designed the initial versions of Oracle's Exadata database cluster appliances and was previously vice president of engineering at Aster Data. (Aster was acquired by Teradata three years ago because the company needed a hybrid row-column parallel database to support both SQL and MapReduce workloads.) Nutanix co-founder Mohit Aron was chief architect at Aster Data and was the leading designer of the Google File System, which underpinned the company's first MapReduce system. Ajeet Singh, the company's third co-founder, worked on Oracle's cloud before joining Aster Data as director of product management and then coming to Nutanix after the Teradata deal.The key component of the Virtual Computing Platform is something called the Nutanix Distributed File System and it turns the storage on a cluster of X86 servers running hypervisors into a distributed storage area network. To scale out the storage or the compute, all you do is add nodes to the cluster. NDFS can tier data on flash and disk storage, and in the NX appliances sold by Nutanix itself and based on Supermicro servers, the file system can place the hottest data on Fusion-io PCI-Express flash cards, on Intel flash drives, or Seagate disk drives. These appliances support VMware's ESXi, Red Hat's KVM, and Microsoft's Hyper-V hypervisors on X86-based systems, and these in turn support Windows and Linux workloads running in virtual machines.Sam Greenblatt, who is CTO for engineered solutions and technology at Dell, tells EnterpriseTech that the exact details of the future \"Web-scale\" converged applications, called the XC Series, are not being revealed yet, but that the company will have two variants. One will be based on its regular PowerEdge rack servers and the other will be based on its PowerEdge C6220 hyperscale systems.\"The real issue that we are trying to solve with the Nutanix software is the VM blender problem,\" explains Greenblatt, referring to the fact that when you take multiple workloads with their own predictable I/O patterns and condense many of them down together in virtual machines, you lose the predictability of the I/O and it becomes more randomized. That leads to longer seek times for data and poorer performance. NDFS has smarts to get around this problem. \"When we did a virtual SAN test from a major company, we saw a 20 percent degradation – almost like what we saw with early server virtualization. By putting Nutanix in, we have found it comes down to about 8 percent. And Nutanix uses their ability to move data east-west using their web-scale clustering, but what helps them out quite a bit is our Compellent storage and its ability to move and tier the data. By the way, Greenblatt would not identify whose virtual SAN it was comparing Nutanix to.These XC Series appliances from Dell will ship later this year and Greenblatt says the plan is to get them out the door sometime around September or October, but that this is subject to change. The company is working on reference architectures now to help Dell sales people figure out what is in these Nutanix-Dell appliances.Having just raised $101 million in January for its fourth round of venture funding, Nutanix doesn't necessarily need money. (That Series D funding round gave it a market valuation of around $1 billion, and the Dell deal probably pushed it up even further.) Nutanix does need allies as it tries to fight against other suppliers of server-storage hybrids, and Dell, which doesn't have its own equivalent to the Virtual Computing Platform software, needs to sell anything that customers want to push its iron. Dell will continue to work with VMware to push its vSphere-vSAN combination. It seems clear that Nutanix wants to expand its sales channels but Nutanix is not going to shift to Dell iron, or leave behind hardware and become just a software vendor.\"I cannot overemphasize the fact that we are not getting out of the hardware business,\" Pandey said in a blog discussing the announcement. \"Many consumer and enterprise companies now manage a portfolio of form factors for their software intellectual property. Nutanix is simply diversifying its portfolio of products as it marches towards a new goal of $500M annual revenue run rate. Like Oracle manages Exadata appliances and pure software. Like VMware will manage OEMs, pure software, and probably a hyper-converged appliance. Like Citrix manages NetScaler appliances, Cisco OEM, and pure software. Like how every appliance vendor worth their salt will have to diversify in this new day and age of SDDC.\"Dell and Nutanix have agreed to respect each other's respective channels and register their deals with each other so their sales forces don't raid each other's accounts.The Nutanix appliances were not the only such devices announced by Dell this week at its User Forum in Orlando, Florida. The company is working with commercial Hadoop distributor Cloudera and virtualization software maker ScaleMP to create what Greenblatt calls an \"in-memory data appliance.\" There will be two versions of this juiced-up Hadoop appliance. One is based on the PowerEdge R720XD server from Dell, which has an overclocked Xeon E5 processor from Intel, and is intended to be used in scale out clusters. The other is based on the high-end PowerEdge R920 system, which is a four-socket NUMA machine based on the Xeon E7 processor. The scale-out machines will be equipped with ScaleMP's vSMP hypervisor, which allows for multiple machines to be lashed together into a virtual shared memory box over Ethernet or InfiniBand networking rather than requiring an extended server chipset and proprietary interconnect. These two variants of the appliances will be loaded up with Cloudera Enterprise Data Hub Edition, which includes the commercialized version of the Apache Spark project from DataBricks to speed up queries against data stored in Hadoop. The appliance will also be tuned to run the Hive query tool that is commonly used with Hadoop's HDFS file system as well as the Shark query tool that is tuned for Apache Spark. Spark and Shark bring queries into main memory and can speed them up by orders of magnitude.Greenblatt says the first customer using the Cloudera in-memory appliance is a high frequency trader; he declined to identify them. Dell has tested the cluster running Cloudera and vSMP across 24 nodes in its labs, and has another genomics customer running its gene sequencing software that has pushed it up to 125 nodes. This appliance will be available in the second half of 2014.Nice article. Converged appliances are destined to become a hot sector. If you get the opportunity, its worth reviewing a company called Sphere 3D Corp. They recently purchased VDI appliance company V3 Systems and have just announced they will acquire Overland Storage. The goal is to combine the application, desktop and storage virtualization IP of the combined companies into a converged appliance. The V3 appliance also uses Fusion-io technology highlighted in your article, and interestingly Peter Bookman, the founder of V3 Systems, was also involved in the early development of Fusion-io technology. The application virtualization technology going into the appliance, called Glassware 2.0, is also interesting because of a unique approach to virtualization, that allows applications written for different platforms to run on the same appliance. In addition, Glassware uses a microvisor approach that allows applications to make direct hardware calls, allowing many application to be virtualized that would not normally perform well in a virtual environment.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/nutanix-logo-370x290.jpg",
        "https://secure.gravatar.com/avatar/5f4494f0c34f647f107a849a8f91728e?s=60&r=g"
    ]
}