{
    "title": "Oracle Intros New Logging and Recovery Appliance",
    "author": "Isaac Lopez",
    "date": "2013-09-24 00:00:00",
    "text": "Oracle is adding a new twist to the backup appliance, announced Andy Mendelsohn this week at their Oracle OpenWorld event. The new appliance, part of their “engineered system” hardware family bring aimed at delivering sub-second, near zero data loss protection.Called the Oracle Database Backup Logging Recovery and Appliance, the unit is a massively scalable piece of hardware that takes the sting out of backing up data – especially in the era of big data, where more sensors and more data points are being collected and stored indefinitely. The new appliance allows enterprises to handle thousands of databases deployed across the business with a single appliance.The new appliance streamlines the backup process by eliminating the periodic full system back-ups of all data in each database, instead only processing and storing changed data, reducing a lot of the overhead and tax on servers and networks that would happen using a traditional backup approach.The new system allows DBAs to be point in time specific when restoring a database, eliminating the lost time and resources in trying to apply logs in order to get the database to the point it needs to be to get back into production.On the face, the system is designed to eliminate the lion’s share of the hassle that goes on with the never-ending backup drudgery by shortening backup windows, and performing the end-to-end backup validation and de-duplication behind the scenes.Many enterprises that depend on critical application data for their ongoing operation go to great lengths to ensure continuous availability of their data, yet would be shocked to discover that the measures taken to protect that data are fraught with vulnerabilities that could cause delays in recovery, and even data loss,” said Carl Olofson, Research Vice President at IDC. “Transactional databases have become quite complicated, and taking care of backup and redo log files is not trivial. This offering from Oracle seeks to provide a foolproof method of ensuring the most complete data recoverability possible.”In addition to working on premise, the system is also designed to work with the Oracle cloud. No pricing has been released for the unit.",
    "pic_urls": []
}