{
    "title": "Oracle Takes Aim at Public Cloud Heavies, Claims 50% Cost Savings",
    "text": "In an overt attempt to overtake – or at least enter the arena with – the Big Three public cloud services providers, Oracle today unveiled new public cloud offerings that it says will transform how cloud services are bought and consumed.Oracle CEO Larry Ellison’s splashy webinar announcement today is straight out of the Business 101 Playbook: when you’re playing catch-up in a competitive and mature market, attack with low-cost. Ellison announced what he said is the lowest list prices for IaaS (Infrastructure as a Service), half the price of Amazon Web Services.\"We are completely transforming the way all companies buy and use cloud by providing flexibility and choice,\" said Ellison. \"Today, we combined the lowest prices with the highest performance and more automation to deliver a lower total cost of ownership for our customers.\"Oracle’s thesis: while the cost and simplicity of moving operations to the public cloud are widely appreciated, many organizations haven’t made the move “due to obstacles that have forced them to choose between flexibility and lower costs.”These include limited visibility and control over cloud spend and inability to fully leverage on-premises software investments in the cloud, “having been limited to IaaS services or sacrificing key database features at the PaaS (Platform as a Service) layer.”As of today, customers can bring their on-premises licenses to Oracle IaaS. With today’s announcement, they can reuse their existing software licenses for Oracle PaaS, including Oracle Database, Oracle Middleware, Oracle Analytics, and others.Ellison said the difference between the company’s two cloud offerings, Oracle IaaS and Oracle PaaS, is degree of automation. IaaS has a low degree of automation and offers a low commodity price. PaaS, on the other hand, is more automated and more fully provisioned, reducing database management labor costs, more costly than the infrastructure itself, Ellison said. Cost savings, he said, come from Oracle data compression and higher performance when running the database, which means less compute consumed.“Customers with existing on-premises licenses can leverage that investment to use Oracle Database Cloud at a fraction of the old PaaS price,” Oracle said. “Running Oracle Database on Oracle IaaS is faster and offers more features than Amazon, delivering the industry's lowest total cost of ownership. Additionally, customers can further reduce management and operational costs required for on-premises maintenance by taking advantage of this PaaS automation.”For payment structure, Ellison’s announced Universal Credits, which are designed to be a flexible buying and consumption model for cloud services.With Universal Credits, customers have one contract for unlimited access to all current and future Oracle PaaS and IaaS services, spanning Oracle Cloud and Oracle Cloud at Customer, which are public cloud capabilities placed behind the firewall of customers restricted from moving data off-prem.“Customers gain on-demand access to all services plus the benefit of the lower cost of pre-paid services,” Oracle stated. “Additionally, they have the flexibility to upgrade, expand or move services across datacenters based on their requirements. With Universal Credits, customers gain the ability to switch the PaaS or IaaS services they are using without having to notify Oracle. Customers also benefit from using new services with their existing set of cloud credits when made available.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-09-19 00:00:00",
    "cats": [
        "Slider: Cloud",
        "Slider: Front Page",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "IaaS",
        "Oracle Cloud"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/iaas/",
        "https://www.enterpriseai.news/tag/oracle-cloud/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/Larry-Ellison2-091917-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/Oracle-IaaS-vs-PaaS.png"
    ]
}