{
    "title": "Storage Vendors Target Docker Management",
    "author": "George Leopold",
    "date": "2015-08-26 00:00:00",
    "text": "A partner network announced this week will deliver storage drivers for ClusterHQ's Flocker container data management software rolled out a year ago. The partnership would allow the enterprise storage vendors to offer customers hardware or software-defined storage options based on Flocker to create container storage for Docker application containers.San Francisco-based ClusterHQ said its enterprise storage partners include ConvergeI/O, Hedvig Inc., Huawei, NetApp, Nexenta and Saratoga Speed.Flocker is designed to take on the storage virtualization challenge posed by Docker. ClusterHQ is positioning Flocker as a way for DevOps teams to containerize databases and state-ful microservices by directly attaching storage to a container and then transferring containers and data together between servers.\"Docker is great for stateless applications that do not write data to a file system,\" former ClusterHQ CEO Luke Marsden told EnterpriseTech last year. “But as soon as you put an application into a container and you mount a file system, that container gets stuck on that machine.\"Flocker has since been upgraded to work with other tools in the emerging container ecosystem like Docker Compose, the container orchestration framework Docker Swarm and Apache Mesos, the company said Wednesday (Aug. 26).ClusterHQ contends that data management and persistent storage are among the leading barriers to adoption of application containers in production. (A recent company-sponsored survey found that 94 percent of respondents are either using or have investigated the use of container technology over the last year, with Docker being the overwhelming choice. While nearly every industry survey finds that security remains the top barrier to production, data management, networking and storage are also seen as key barriers.)Hence, storage drivers for Flocker would allow its partners to offer their customers portable storage options needed to leverage containers for all of their applications, including databases, in enterprise production environments.\"Users want to be able to run their database and other stateful processes in containers. Tools that will enable this and manage it should find a welcome reception in the market,\" concluded a recent container technology survey sponsored by ClusterHQ.While the pace of application containers moving to production has been picking up pace, ClusterHQ's storage partners acknowledged that DevOps and IT teams are encountering challenges beyond security, including a lack of persistent storage for containers. \"Organizations need the ability to run stateful services and preserve customer and corporate data as containers migrate or expire,” Avinash Lakshman, CEO and founder of software-defined storage startup Hedvig, noted in a statement.Hedvig rolled out a distributed storage platform earlier this year designed to allow enterprises to run virtualized infrastructure as easily as a public cloud service in their datacenters. Combining that capability with Flocker would help \"eliminate storage bottlenecks with Docker\" by orchestrating storage in production, Lakshman said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-26-at-11.27.52-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}