{
    "title": "LinkedIn Spearheads Common Server Effort",
    "author": "George Leopold",
    "date": "2017-05-24 00:00:00",
    "text": "A standards effort driven by LinkedIn that seeks to \"redefine\" future datacenter infrastructure will initially focus on a common form factor for servers, according to the founding members.Along with LinkedIn, which was acquired by Microsoft NASDAQ: MSFT) last year, other founding members of the Open19 Foundation launched on Tuesday (May 23) are Flex, GE Digital (NYSE: GE) Hewlett Packard Enterprise (NYSE: HPE) and Vapor IO. Yuval Bachar, LinkedIn's chief engineer for architecture and strategy, heads the server initiative.Among the hardware contributions to the group is an industry specification that attempts to define \"cross-industry\" rack and cage standards for servers in enterprise datacenters. The goal is \"creating a flexible and economical datacenter and edge solution for operators of all sizes,\" the member said.The foundation is based on an earlier LinkedIn project aimed at creating a spec for accommodating a server, storage and networking. \"You have to fit into a 19-inch rack,\" Bachar noted, \"and that is common for every location, every continent, every [co-location datacenter], every specialty datacenter.\"The other requirement was a one-size-fits-all approach that addresses IT infrastructure ranging in footprint from \"micro-datacenters\" used as edge platforms all the way up the hyper-scale facilities, Bachar notedLinkedIn is contributing an industry specification that defines a platform with three common elements: a \"brick cage,\" power shelf and a network switch. Four form factors would be supported: brick, double wide brick, double high half-width brick and double high, double wide brick.\"Open19 is the rack standard we’ve needed for a decade,\" noted Cole Crawford, CEO and founder of Vapor IO. A common spec would, for instance, allow server vendors to \"snap together\" datacenters \"like Lego bricks,\" Crawford asserted. \"We can send a crew out to an edge environment, such as at the base of a cell tower, and stand up a new datacenter in minutes.\"The standards effort also seeks to reduce the cost of server racks and cabling, which Bachar said are often more expensive than networking gear.The move to common datacenter hardware comes as the server market slows and hyper-scalers such as LinkedIn continue to drive cloud-computing specs. A membership roster that also includes major industrial users such as GE could provide the necessary impetus to forge a common datacenter framework, observers note.The Open19 Foundation has parallels to the Open Compute Project formed by Facebook (NASDAQ: FB) in 2011 that targets hyper-scale cloud service providers. Along with addressing small and medium-sized datacenters, Bachar added that an open approach would allow adopters to integrate servers on the datacenter floor. LinkedIn has demonstrated the ability to load and connect up to 96 servers in a rack in less than 90 minutes, he said.The industry group said it is looking to expand it membership.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_servers-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}