{
    "title": "Gartner: As AI Goes Mainstream, So Do New Security Threats",
    "author": "George Leopold",
    "date": "2019-10-21 00:00:00",
    "text": "As if there weren’t enough security challenges, a forecast for the coming year warns the brave new world of AI and machine learning brings with it a whole new set of threats as microservices, the Internet of Things and multi-cloud deployments expand attack surfaces for hackers constantly probing for weaknesses.Market analyst Gartner’s list of key technology trends for 2020 includes a compelling list of emerging trends, ranging from “hyper-automation” to the “democratization of expertise.” Still, these emerging capabilities come with a price: As AI and machine learning add another layer of technological complexity, “Security generalists cannot address the wide spectrum of risks efficiently in the current risk landscape,” Gartner has warned.The connection of platforms, edge devices and users expecting instant access to data—structured and unstructured—has raised the stakes for security as AI and machine learning enter the enterprise mainstream. “Security and risk leaders should focus on three key areas — protecting AI-powered systems, leveraging AI to enhance security defense and anticipating nefarious use of AI by attackers,” the market analyst warned in its rankings of AI-centric emerging technologies.Despite those heightened security concerns, a range of new technologies appear headed to wider enterprise adoption, Gartner said. Along with hyper-automation—defined as the combination of machine learning, software and automation tools geared to performing specific tasks--Gartner foresees “multi-experience” platforms including virtual, augment and mixed reality entering the mainstream in 2020.Technical expertise in the form of machine learning and application development is expected to fuel business segments ranging from economic analysis to sales and marketing, Gartner said in a survey of promising technologies released this week. Citizen data scientists are among the prime examples, but others including the “evolution of citizen developers” leveraging no-code models are also expected to emerge in 2020.Those efforts are driven by the ability to download open-source code and frameworks from platforms like GitHub. The problem, veteran software developers note, is that ease-of-use comes with a price in terms of security, reliability and other considerations.Meanwhile, edge computing and evolving cloud services are pushing ever-greater computing and storage capabilities deeper into enterprises. “Edge computing will become a dominant factor across virtually all industries and use cases as the edge is empowered with increasingly more sophisticated and specialized computing resources and more data storage,” said Brian Burke, a Gartner research vice president. “Complex edge devices, including robots, drones, autonomous vehicles and operational systems will accelerate this shift.”The uptake in public cloud services is also expected to gain momentum as multi-cloud deployments give way to what Gartner dubs the “distributed cloud.” That architecture is expected to transform deployments as public cloud providers take greater “responsibility for the operation, governance, updates to and evolution of the services,” Gartner forecasts. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/Screen-Shot-2015-04-13-at-12.09.11-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}