{
    "title": "PernixData Decouples Performance, Management from Storage",
    "author": "Alison Diana",
    "date": "2015-09-15 00:00:00",
    "text": "PernixData aims to further simplify storage managers' jobs with today's release of FVP version 3.0, Freedom, and software platform Architect.The company's technology decouples storage performance and management functions from an organization's underlying storage hardware, allowing an enterprise to maximize application performance, attain predictable scale-out growth, and minimize storage costs, according to the San Jose, Calif.-based vendor.Rather than buying a bigger array or adding all flash storage, PernixData's solution separates storage from capacity, said Jeff Aaron, vice president of marketing at PernixData, in an interview. \"It is wrong to add disk/flash to the storage array to get performance,\" he said.FVP 3 now can deploy within vSphere 6.0 environments, meaning it currently supports all modern VMware hypervisors (5.x and 6.0), said Aaron. In addition, the latest edition is based on HTML 5 in order to provide an enhanced user experience, more tools, and a speedier, more flexible interface, he said.To further improve performance, FVP added PernixPlus, which collects relevant customer deployment data in order to identify potential problems before they arrive and abbreviate the time it takes to resolve issues, said Aaron. PernixData expects most will choose to use this capability, an approach increasingly common among developers, he noted.\"Today it's being used for support, to give a better experience to our customers,\" said Aaron. \"One thing we're interested in doing is offering a metadata trend information to them.\"For example, at some point PernixData could track and share data on what other architecture or manufacturing firms are doing; how many are using EMC storage, or how many IOPs they get, for example, he said. The developer could crowdsource analytics so customers could glean a better understanding of what others in their industry are doing, Aaron added.The developer also now offers a completely free version – FVP Freedom – with fewer features and other limitations that should appeal to small businesses or as a test run for enterprises considering FVP 3, said Aaron.\"It is a completely free version of the software. It's read only and it runs on RAM only – whereas the full version is RAM and flash, and read and write – and [Freedom] is community support only,\" he said. \"We're out there saying what the competition offers is commoditized so we're willing to offer it for free. It's really a way to raise awareness and seize the market and prove how robust our feature set is.\"Finally, PernixData unveiled Architect, the developer's first software platform designed to provide real-time analytics for all virtualized applications and storage devices, regardless of the underlying hardware. It works with or without FVP. The platform sits inside the hypervisor kernel and gathers large amounts of application and infrastructure data, then delivers recommendations about improving the virtualized datacenter, said Mark Peters, practice director and senior analyst at ESG, in a statement.Architect generates data based on dynamic virtual machine and infrastructure conditions, tying that in with third-party data, and real-time descriptive, predictive, and prescriptive analytics. This allows storage managers to configure optimal block sizes, for example, or correctly size storage arrays based on application requirements so storage is never under- or overused, the company said.Although it can be used without FVP, when coupled with FVP 3, enterprises get more visibility into VM and storage behavior and enhanced performance, according to PernixData.\"Storage tools give you zero visibility into what's happening on the application side. What we want to do is manage the VM and storage management tools together, which is why we're coming out with Architect [today],\" said Aaron. \"It really extends our notion of company storage. Architect decouples management from storage.\"Architect is scheduled to ship next quarter. Betas are available now.    Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/PernixData-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}