{
    "title": "DDN’s Bouzari on the Spread of Advanced Scale Computing into the Enterprise, and the Object-based ‘Connected Society’ of the Future",
    "text": "The entire HPC world – from traditional HPC research sites to advanced scale computing in the enterprise – is at a crossroads. Then again, has it ever not been?A company standing in the crossroads, one that is usually ready for whatever is onrushing, is DataDirect Networks, the scalable storage specialist founded in 1998. Back then, HPC was mostly contained within the world of the government labs and academia, where DDN is entrenched at two-thirds of the world’s biggest supercomputer sites. Now the company is at the forefront of the HPC breakout into the enterprise. Starting about five years ago, the primary source of DDN’s growth changed from the TOP500 to the Fortune 100, web cloud companies, the financial services industry and other enterprise markets.Alex Bouzari, DDN CEO, chairman and co-founder, is well positioned to expound on the state of HPC. He recently spoke with EnterpriseTech and HPCwire on the convergence of traditional HPC and advanced scale computing in the enterprise, their divergent priorities, and the opportunities for technology providers in the future, the scale of which he says will dwarf today’s drive to exascale.“We’re hearing it over and over again,” Bouzari said. “HPC has truly broadened from being an enabler for large scale computing and simulation for scientific discovery by the government labs and academia into something much broader. I really see it is becoming the engine that is driving connected societies and the global economy.”A range of enterprise markets and applications increasingly use HPC tools to accelerate time-to-insight to better process, manage and share their data, Bouzari said, which in turn results in significantly better competitiveness and profitability.“People in the enterprise weren’t so focused five years ago on delivering business value through IT,” said Bouzari, “it was making sure the data is protected and that users in the organization have access to the data. Now, increasingly, we’re seeing younger IT leaders in these organizations who view their jobs as not just to make sure data is safe and available, Amazon can do that, the job is to ensure that IT is bringing significant business value.”With ROI comes enterprise adoption of HPC at scale.“We have enterprise customers in the financial services sector, in life sciences, in genomics, in manufacturing, who have deployed systems that are as large the HPC Top 20, from a performance and scale standpoint. And it’s simply because it has become very easy for enterprise customers to justify the ROI of making these investments in technology, because the acceleration in analyzing and processing data, and the increased insights they get from their data, is translated into hundreds of millions of dollars in profits added to the bottom line. So the decisions are far, far easier.”On the consumer side, web cloud companies, internet service providers and telco’s have adopted HPC to streamline costs and enable social media, and are at the early stage of delivering personalized services to consumers.This ties into Bouzari’s vision for the digital, mobile world of the future, the “connected society.” Under the heading that “everything that rises must converge,” Bouzari says the relentless rise in technology’s ability to collect, process and share hundreds of trillions of stored objects that capture consumer behaviors will converge and connect people to each other and to companies.“The trend we’re seeing will require significant advances in technology,” he said. “It’s the ability to collect data points from consumer behaviors as well as changing data sets in a mobile manner, and then using them to deliver very accurate and real-time information,” he said.“Today we have a customer in the web cloud world using our products for mobile applications. Think of it as hundreds of millions of consumers making queries into mobile devices, DDN is the engine that drives all that worldwide. For these services to be beneficial to consumers, accuracy and real time response is very important, so every time you make a query they collect the information and store it so there’s an increasing level of accuracy every time that happens. It’s an object-based implementation and we now have more than a quarter trillion objects that are in this globally distributed DDN object based system used to deliver services to the consumer.”The old way of gauging HPC – more bandwidth more capacity, better latency, figuring out how to beat Moore’s Law – will be dwarfed by web cloud organizations’ utilization of HPC technology, Bouzari said.For industry veterans who shared the view that the HPC community is an incubator and proving ground for future technologies in the wider world, that day is arriving quickly. The work of traditional HPC industry remains vital, both for scientific discovery and for technological development, Bouzari said. But the market opportunity and technology challenges coming out of the enterprise world are outsized compared with the relatively small market of the HPC500.This is good news for HPC vendors seeking new markets, but it carries with it big challenges not posed by the traditional HPC market.“The labs and universities have rocket scientists and computer scientists to couple things together, and all they need is the system to deliver peak qualities. If it’s somewhat shaky, it’s OK.”But in the enterprise, shaky is unacceptable.“Enterprise customers are looking for the same performance and scale attributes that the labs and government agencies have been enjoying,” Bouzari said, “but in addition to that they are used to seeing reliability, resiliency and quality of service that is far more stringent than what traditional HPC has required. So as a result, products and services delivered to the enterprise have to be hardened, and you need to spend years and years and a significant amount of money in doing that for the product portfolio.”This reflects a larger difference in orientations between traditional and enterprise HPC, with implications for the sales process.“In traditional HPC, customers are very technical, very sophisticated,” Bouzari said, “so the dialogue is deep down into the bits and bytes of the technology, in terms of FLOPS, gigabytes per second, IOPS. HPC people want to know in great detail what is the software architecture like, what the block diagrams of the underlying hardware are like, how many pipes and what types of pipes are used. They also tend to be more interested in far more long-term product road maps. It’s not unusual for customers to ask for a five-year view, and not just cursory review, they really want to drill down into the details.”But in the enterprise, “it tends to be more of technical business dialogue, where they are aware of the building blocks of the tech and big technological trends, but they have no interest in getting into the bowels of the actual product. In the enterprise, it’s ‘Explain to me how your roadmap aligns with my business requirements.’ They tell us it’s our job to translate their business requirements into a system architecture that meets and exceeds those requirements. They tell us, ‘It’s not our job to figure it out for you.’ Whereas the government labs typically love to figure it out for you.”And whereas cost sensitivity in the labs is high, in the enterprise it’s not as acute – assuming a strong ROI case can be made.DDN’s product portfolio rests on three pillars that have been the focus of the company’s R&D efforts for the past eight years, one that supports an end-to-end life cycle data management strategy:Application and File System Acceleration: DDN’s Infinite Memory Engine (IME) extends the memory footprint by leveraging solid state and nonvolatile memory technologies. IME adds a data caching tier between processor and parallel file system, cutting latency and speeding applications by 1000X, Bouzari said.Persistent Storage Layer: DDN’s Storage Fusion Architecture, of which the SFA14K is the new entry, is DDN’s new hyper-converged hybrid storage platform that integrates nonvolatile memory and solid state with discs for high end data performance: nearly 14 PB of capacity, 60gb second bandwidth and 6 million IOPS in a 4U footprint.Object Storage Archive: Web Object Scaler (WOS) is DDN’s massively scalable object storage platform for live archiving and deep archiving, second in size to Amazon Web Services, according to DDN. WOS supports web-scale storage clouds and real-time distribution of content across large-scale collaboration infrastructures.Bouzari said that while the three DDN pillars are constantly evolving and leveraging new technologies, the framework will remain in place.“The building blocks need to come together and in the right way,” he said, with “connectors” that tie the three pieces together and enable intelligent migration from the nonvolatile memory layer to the persistent storage layer and then into archive.“Advances in silicon, whether it’s processors, fabric or simply new nonvolatile memory technologies, are helping provide faster and faster capabilities, but they need to be architected in ways that they can be utilized and deployed effectively.”While end-to-end data management is suited to the architectural and performance requirements of the enterprise, Bouzari said it’s also gaining acceptance in traditional HPC.“It’s no longer just wanting the highest number of FLOPS at the lowest cost, or the highest bandwidth, or the highest capacity at the lowest cost,” Bouzari said. “Yes, those things remain important but they also need the ability to better manage their environments, the ability to tie big Lustre file system pieces into GPFS pieces, the need to go back and forth between persistent storage and the archive. There are bottlenecks in the jobs they’re running so they need to leverage nonvolatile memory, and they need all these pieces to come together.”The beating heart of technological innovation: advances in silicon.“The game is changing from ‘more of the same’,” Bouzari said, “to how to make this extremely powerful silicon, which is coming to the fabric, processors and nonvolatile memory, to provide better usability and better capabilities to the users. So it’s becoming a software game, with a lot of thought going into the proper design and architectures of the customer environments, rather than just brute forcing it by going from 10,000 to 20,000 to 50,000 cores and so forth. Things have changed and they’re continuing to change at an accelerated pace.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2015-11-13 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Alex Bouzari",
        "DDN",
        "enterprise",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/alex-bouzari/",
        "https://www.enterpriseai.news/tag/ddn/",
        "https://www.enterpriseai.news/tag/enterprise/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/converged.png"
    ]
}