{
    "title": "Nvidia Aligns with Colo Partners in AI Democratization Push",
    "text": "AI is all the rage and so is AI democratization. Having developed an AI stack only science-level technologists could love, vendors are now courting customers with integrated hardware that would otherwise require a computer scientist and enormous data center investment, and with software that automates data science tasks.In the thick of AI democratization is GPU leader and AI evangelist Nvidia, which has aligned with several server, storage, networking and software vendors to build integrated and pre-qualified offerings intended to jumpstart AI journeys among non-FAANG and bottom 99 percent organizations that lack science-level techies and/or the infrastructure needed for machine and deep learning at scale.Along these lines, Nvidia has announced the DGX-Ready Data Center program aimed at enabling customers “to deploy AI with ease” in an op-ex model via a network of nine colocation partners.In a blog post, Tony Paikeday, director of product marketing for Nvidia’s DGX product family, said DGX-Ready is aimed at compute-intensive businesses for which “a fundamental challenge exists: they don’t have modern data center facilities that can support accelerated computing operations.”“Through colocation, these customers can avoid getting mired in the challenges of facilities planning and instead focus on gaining insights from and innovating with their data,” he said.Nvidia’s DGX-1 and DGX-2 are positioned as AI supercomputers; DGX-1 servers contain eight Tesla V100 GPUs and deliver a petaflops of mixed-precision throughput, with 256 GB of system memory. DGX-2 systems provide more than two petaflops of deep learning computing powered by 16 Tesla V100 Tensor Core GPUs interconnected with NVSwitch technology. In addition, the DGX software stack is designed for GPU-accelerated training, including the RAPIDS framework, adoption of which is simplified by the container model supported by the Nvidia NGC container repository of applications, according to the company.Using the infrastructure of qualified partner data centers, businesses in the U.S. and Canada can deploy Nvidia’s DGX-1 and DGX-2 servers and recently announced DGX reference architecture solutions from DDN, IBM Storage, NetApp and Pure Storage.“Customers will continue to order DGX servers and/or DGX POD/Reference Architectures through Nvidia’s Partner Network (NPNs), and can utilize the DGX-Ready Data Center program to engage with our colocation partners,” Paikeday told HPCwire in an email exchange.At launch, there are nine North American data center operators: Aligned Energy, Colovore, Core Scientific, CyrusOne, Digital Reality, EdgeConneX, Flexential, Scale Matrix, and Switch. Nvidia says it is planning to roll out the program globally later this year and may also expand its North American network of partners.With the launch of DGX-Ready, Nvidia is creating another avenue to sell its top-line Tesla parts and DGX systems, which target the HPC and AI marketplaces. The chipmaker is coming off a disappointing fourth quarter, where data center revenue in particular came up short. “A number of deals in the company’s forecast did not close in the last month of the quarter as customers shifted to a more cautious approach,” noted a statement from the company. “Despite these near-term headwinds, Nvidia has a large and expanding addressable market opportunity in AI and high performance computing, and the company believes its competitive position is intact.”With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2019-02-01 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Datacenter",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "AI",
        "colocation services",
        "data center",
        "DDN",
        "IBM Storage",
        "NetApp",
        "NVIDIA"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/colocation-services/",
        "https://www.enterpriseai.news/tag/data-center/",
        "https://www.enterpriseai.news/tag/ddn/",
        "https://www.enterpriseai.news/tag/ibm-storage/",
        "https://www.enterpriseai.news/tag/netapp/",
        "https://www.enterpriseai.news/tag/nvidia/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/Jensen-Huang-GTC18-DGX-2-server-370x290.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}