{
    "title": "Hybrid Storage Seen as Safer Bet For Virtual Workloads",
    "author": "George Leopold",
    "date": "2015-12-09 00:00:00",
    "text": "Akin to their cloud deployments, enterprises are hedging their bets on storage by adopting a mix of storage options for virtualized infrastructure in datacenters. Hence, a new vendor survey concludes, flash-based hybrid storage is making inroads in the datacenters.A study on the state of storage in virtualized datacenters found that 61 percent of respondents—nearly all with some workloads running on virtual machines—said they are deploying hybrid storage arrays. While more than two-thirds said flash storage improved existing application response times, most have deployed a mix of traditional spinning disk and all-flash arrays. Only 3 percent of the companies surveyed said they have gone all-in for flash storage.Tegile Systems Inc., Newark, Calif., an all-flash and hybrid storage array vendor, commissioned the virtualization study conducted by ActualTech Media.As virtual machines support more key systems like SQL servers used for data analytics, the study projects a shift over time to all-flash storage arrays. In the meantime, \"hybrid is the undisputed standard\" and \"storage companies [with] unified offerings in both spaces are best prepared to meet\" demand in virtualized datacenters, the study concluded.The survey's author contends that storage needs are reflected in the kinds of applications running in datacenters. Databases lead the way, with Microsoft SQL servers accounting for two-thirds of virtualized applications. File sharing followed at 53 percent. For now, data analytics brings up the rear with only 15 percent of respondents running analytics applications on virtual machines.The survey notes the improvements in hypervisors that can spin up massive virtual machines will allow more applications to be virtualized. \"As storage and the hypervisor become more closely linked to one another, there will be capability differences between different systems based on hypervisor enhancements,\" the study found.For now, VMware's vSphere remains the overwhelming choice, accounting for a hefty 69 percent of those companies surveyed. Hyper-V trailed with 34 percent of respondents using the Microsoft alternative. The emerging KVM hypervisor was cited by only 8 percent of survey respondents.Asked to describe their on-premise storage environment, 47 percent said they are running both disk and flash while 41 percent have stuck with all-disk storage in the datacenter. A majority said they operate standalone hybrid storage arrays, indicating that a hybrid approach provides \"an excellent balance when it comes to managing storage costs in terms of both capacity and performance,\" the study asserts.With hybrid cloud deployments are also preferred as a way to retain on-premise control of sensitive workloads and applications, the study nevertheless found that cloud storage is gaining \"good traction.\" Thirty percent of respondents said they are using some form of cloud storage.Survey sponsor Tegile Systems stressed the need for flexible storage. \"It’s critical that a storage system today supports both block and file storage protocols and accommodate different types of storage mediums, whether it’s all flash, a mixture of flash and disk, or a mixture of high-performance flash and high-density flash,\" Tegile CTO Rajesh Nair noted in a statement.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/storage-370x246.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}