{
    "title": "DDN in Product Line Refresh, Multi-level Security for Lustre",
    "author": "Doug Black",
    "date": "2016-11-08 00:00:00",
    "text": "Ahead of next week’s SC16 conference, high end storage vendor DataDirect Networks today announced a raft of product line updates, including a new burst buffer appliance and updates to its block and file storage appliances, along with what DDN says is the fastest multi-level security solution for Lustre aimed at HPC-level performance in markets with increased security requirements, such as financial services, genomics and government organizations.The product line refresh, begun in September, includes updates to the DDN14K-based storage products (DDN SFA14KX, SFA14KXE, GS14KX and ES14KX), an updated operating system with new capabilities, a new burst buffer appliance (IME240). DDN said the enhanced performance, scale and density of its products advances data center modernization with flash technologies, improved platform performance and expanded use of open platforms.“Intersect360 Research is forecasting worldwide spending on storage for HPC applications to surpass $5 billion in 2016, continuing to grow faster than the market rate to over $6.5 billion in 2020, as organizations continue to invest in technologies to optimize for data-hungry workloads,” said Addison Snell, CEO of Intersect360 Research. “With its investments in object storage and ‘burst buffer’ technologies, DDN is staying on top of the forward-looking technologies that will shape the next several years.”The DDN14K-based products provide SAS SSD, NVMe, InfiniBand, Intel Omni-Path and Intel’s latest Intel “Broadwell” Xeon processor, which is available across DDN14KX-based appliances. DDN said the SFA14KX delivers leading hybrid block storage array performance (60GB/s, 6 Million IOPs in 4U with scalability to more than 9PB of capacity in a single rack), while the SFA14KXE, GS14KX and ES14KX converged solutions provide DDN In-Storage Processing to embed applications or parallel file systems within the storage array for reductions in latency and data center footprint.DDN has expanded its IME open-platform burst buffer product line by adding the new IME240 appliance, a 2U server with 24 drives that utilizes NVMe interface technology for up to 20 GB/second. DDN now also offers IME as software-only, which DDN said makes it the industry’s first burst buffer not tied to a specific server or storage vendor’s products.With the market move toward more openness, DDN said, the company’s intent is to give more architectural flexibility and choice with both appliance and software-only options. Appliances provide preconfigured solutions with end-to-end 24x7 support, while software-defined architectures give customers configuration flexibility and control.In addition, DDN released SFA Operating System 3.1, which the company said brings together capabilities released across various products this year while supporting Broadwell processors, which the company said enhances DDN’s In-Storage Processing, removing latency and bottlenecks.DDN’s multi-level security solution (MLS) for Lustre, the open-source, parallel file system that supports high performance computing simulation environments, is aimed at providing the performance, scale and openness needed in HPC and Big Data enterprises. MLS is intended for health, life sciences, government, research labs, financial and other data-intensive organizations relying on personalized data.“Big Data and HPC users are under constant pressure to improve time to results while ensuring data security and privacy,” said Steve Conway, research vice president, high performance computing, IDC. “An added challenge is maintaining these standards in environments where data sharing and collaboration are happening. DDN’s MLS Lustre Solution is designed to deliver highly secure file systems that minimize overhead and efficiently scale workloads in today's data-intensive data centers.”Combining community work in open source, DDN said MLS delivers Lustre isolation suitable for a wide variety of security requirements that is simpler to administer and less costly than maintaining a siloed infrastructure for sensitive data.“We have taken a flexible and adaptive approach to multi-level security that combines recent community advances with DDN-developed Lustre features to deliver full Lustre isolation, while minimizing the performance impact of the system overhead associated with implementing security,” said Robert Triendl, senior vice president, global sales, marketing and field services, DDN. “This approach lets us customize configurations that meet our customers’ security requirements without them having to sacrifice workflow efficiency.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/DDN_405x228-370x228.jpg"
    ]
}