{
    "title": "Violin Scales Back Windows Flash Array – For Now",
    "author": "Timothy Prickett Morgan",
    "date": "2014-04-22 00:00:00",
    "text": "Violin Memory was the first of the new breed of flash array companies to go public and the company is trying to stay ahead of the pack by more tightly integrating its storage with various software stacks. The company, which has a new management team, is also picking its fights better and has decided to scale back a bit on its Windows Flash Array, which was developed in conjunction with Microsoft.The Windows Flash Array as delivered will nonetheless have capabilities that other array supplies cannot get into the field until they do similar partnerships with Microsoft.Back in October, when Violin Memory was previewing the Windows Flash Array, the idea was to run Microsoft's Windows Server 2012 R2 operating system right on the flash arrays themselves, which have redundant Xeon-based server blades as their storage controllers. Specifically, the Windows Flash Array is based on a Violin 6000 series array, which has two dual-socket Xeon E5-2600 v2 processors and 128 GB of main memory on each of the blades. This memory was to be used to run a chunk of Violin's Memory Operating System and to hold metadata for the flash arrays themselves as well as running Windows Server and its applications. The other bits of the Memory Operating System run on field programmable gate arrays (FPGAs), which does error and fault management and garbage collection for the flash storage as well as boosting calculations needed by the storage operating system to manage wear leveling across the flash, perform data striping, and other routines.The plan was not only to run Windows Server 2012 R2 proper on the arrays, but to allow for up to eight arrays to be lashed together into a very high performance server cluster. Initial benchmark tests done last fall showed that by running the applications natively on the blade nodes in the flash arrays the proximity of the data to the CPUs allowed for an eight-node setup to do something on the order of 3X to 4X the work for the same core count as a regular cluster, or alternatively, getting the same work done with one third to one quarter of the number of cores. At 256 cores for a top-end Windows Flash Array cluster, this was a reasonably large scale for enterprise customers.But after examining the amount of processing oomph required as well as the application certification process, explains Eric Herzog, chief marketing officer and senior vice president of business development, Violin decided to dial back its ambitious plans to create a server cluster from its arrays.\"Given the cost points and given the power that is on these blade servers, this is realistic about what you can do,\" explains Hertzog. \"We do not have a plan to execute against what you were told in the past. After doing some work with Microsoft, we found that given the technical issues, trying to execute on that and having a shippable product in this quarter or the next quarter was not technically feasible. We have a particular cost point we have to hit, obviously, and we would have had to put the beefiest blade servers around to execute on that vision.\"So the Windows Flash Array as delivered has skinnier blade nodes than was originally planned and they are running Windows Storage Server 2012 R2, which converts an X86 box into a storage array and which only runs a subset of the Windows code. Now, the Windows Flash Array looks and smells like a storage array to applications that are running on their own servers out across the network. There's nothing wrong with this, of course, and Violin is showing some impressive performance gains based on using the machine as an accelerated Windows-based storage server instead of as an application cluster.The Windows Flash Array as delivered has two blade server nodes, each of which are running Windows Storage Server 2012 R2 in an active-active high availability cluster. In the event that one node fails, the other one can take over without any downtime serving up data to applications. And just to be clear, you cannot load up a Hyper-V hypervisor or SQL Server or Exchange Server or SharePoint Server on these flash arrays as was the plan last fall. But all of those workloads and more running on external application servers can get accelerated.Each of the nodes is equipped with a 10 Gb/sec Ethernet card that is capable of supporting Remote Direct Memory Access (RDMA) over converge Ethernet, or RoCE for short, which means among other things being able to run Fibre Channel traffic over IP networks. But what is important here is that with RDMA support, which is native on InfiniBand and comes through RoCE on top of Ethernet, the Windows Flash Arrays can keep track of what data is the hottest and load it directly into the main memory of application server nodes out on the network – provided they support RDMA or RoCE, of course, which is necessary for the new SMB Direct feature of Windows Server. The SMB Direct feature is what is doing the data placement between the array (or a cluster of arrays that looks logically like a single array) and the servers running applications. The machines as shipped today support 10 Gb/sec Ethernet and Violin says that the combination of Ethernet plus RDMA plus SMB Direct is much less expensive than Fibre Channel links and packs more performance, too. Hertzog tells EnterpriseTech to expect 56 Gb/sec InfiniBand links between application servers and the Windows Flash Arrays will come in the next four to six months. The company has not done testing on scaling up to eight nodes in a flash array cluster but Hertzog says that this will be done at some point in the future as customer demands dictate.With four 64 TB arrays, that still works out to 256 TB of total capacity across a cluster of Windows Flash Array drives, which is eight times larger than the typical capacity that Violin sells today. Loaded up with 64 TB of flash capacity, a Violin 6264 array costs between $256,000 and $300,000 on the street, says Hertzog, with a typical configuration running $275,000.Here's the main point that Violin wants to get across. With Storage Server 2012 R2 running on the all-flash arrays, the performance gains are pretty impressive even if the workloads are not running inside of the array and therefore even closer to the flash memory. Take a gander at these benchmark tests that Microsoft did with Violin:On these particular tests, Microsoft is running the SQLIO workload that the software giant has used to stress-test SQL Server and the systems running it for many years now. The results above compare a regular, plain-vanilla Violin 6264 All-Flash Array with 64 TB of capacity with the same machine configured with Windows Storage Server as a Windows Flash Array. InfiniBand links running at 56 Gb/sec were used to hook the hosts to the array. The performance gains are substantial and in many cases will justify the acquisition of the Violin arrays just based on either getting work done faster or being able to do more work in a given time. The typical return on investment is well under a year's time, says Hertzog, at production customers. By the way, Violin had a dozen beta customers putting the Windows Flash Array through the paces.Among many of its goals, Violin wants to be able to be the back-end of virtual desktop infrastructure (VDI) setups and the strong partnership with Microsoft is aimed at doing this workload particularly well. Violin says it can host 5,000 persistent desktops delivering 300 I/O operations per second to each desktop (about what you get from a good disk drive inside your local machine) and the goal is to be able to host 10,000 desktops. Presumably that is with an eight-node cluster of Windows Flash Arrays feeding into the VDI broker.The main thing for Windows shops is that the Windows Flash Array is absolutely familiar. All of the data de-duplication, live migration, thin provisioning, compression, mirroring, replication, and snapshotting features of Windows Storage Server 2012 R2 are enabled on the flash array and the clustering of storage nodes looks and smells like a normal NAS-style scale-out file server. System Center 2012 R2 management tools and the PowerShell scripting language can be used on the device to control it as well.One last thing: Violin has been restructuring itself in recent months and Hertzog says that Violin is in the process of selling off its PCI-Express flash card business. About 35 of its 385 employees work for that division and will be making the move when Violin closes a deal sometime in the second or third quarter. Violin is not naming names but has several potential buyers. After this divestiture is done, Violin will have around 350 employees with 105 of them being in the engineering department.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/violin-memory-graphic-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/violin-memory-setup.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/violin-memory-performance.jpg"
    ]
}