{
    "title": "Violin Launches New Software as IPO Approaches",
    "author": "Alex Woodie",
    "date": "2013-09-20 00:00:00",
    "text": "Violin Memory, a developer of Flash memory-based storage systems, last week unveiled new software that aims to make it easier for organizations to move their legacy data to a tiered storage environment that utilizes a mix of traditional disk and its appliance. Meanwhile, the company is gearing up for an IPO later this month.Violin developed its reputation for building storage hardware, including storage cards, appliances, and arrays, that are based on NAND Flash memory technology. The company sells its offerings, which it developed with a partnership with Toshiba, through a range of reseller and OEM partnerships, including with HP, IBM, Dell, Cisco, Ingram Micro, Sirius Computer Solutions, and Bell Microsystems.The Silicon Valley company is now branching out a little further into the software realm with the recent launch of its Maestro suite. According to Violin, Maestro allows a customer to utilize both “legacy” storage devices and its Violin Memory Arrays, and make them behave like one big happy data family.“With Violin Maestro, data can be tiered in real time across memory and disk storage to accelerate applications at the speed of memory,” Violin CEO Don Basile says in a press release.Maestro uses Bayesian profiling algorithms to “learn” the I/O profile of an application, according to Violin. This allows the software to pre-fetch data into the memory tier before the application asks for it. The company says this approach allows it to serve 90 percent of data requests from memory.In other news, Violin is finally getting ready to make its debut on the New York Stock Exchange. In a regulatory filing made last week, the company said it plans to sell about 18 million shares at a cost of about $8 to $10 per share.That values the company at about $818 million--or about $1.2 billion less than in its first IPO filing in 2012, according to a recent Bloomberg story.Violin has been losing money lately. In the most recent quarter, it recorded a net loss of $30.6 million on $26.5 million in revenue. It’s being hit hard by HP’s decision to resell Violin’s devices. HP accounted for 65 percent of the company’s revenue in fiscal 2012, but now accounts for just 10 percent.Alex Woodie has written about IT as a technology journalist for more than a decade. He brings extensive experience from the IBM midrange marketplace, including topics such as servers, ERP applications, programming, databases, security, high availability, storage, business intelligence, cloud, and mobile enablement. He resides in the San Diego area.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/violin_memory_storage-370x280.jpg",
        "https://secure.gravatar.com/avatar/b0307dd70ffe024a023722c06b737966?s=80&r=g"
    ]
}