{
    "title": "SanDisk Touts ‘Big Data’ Flash Storage",
    "text": "SanDisk said it is targeting big data workloads with an all-flash storage scheme touted as overcoming a key price barrier for an all-flash storage array.The flash storage specialist also is targeting its InifiFlash storage system released on Tuesday (March 3) to accelerate hyper-scale Hadoop and other data analytics deployments along with cloud computing.InfiniFlash is configured with up to 64 hot-swappable cards, each providing up to 8 TB of flash capacity. Combined, the cards provide 512 TB of raw flash storage in a three-rack enclosure. SanDisk said the configuration connects with up to eight off-the-shelf servers.Sustained IOPS are rated at 780K, SanDisk added.An InfiniFlash operating system software is also available to provide flash optimized scale out and management, providing large capacity block and object storage interfaces.All InfiniFlash components are available now, the company said this week.The claimed 50-fold performance increase is said to come with as much as an 80 percent reduction in power consumption compared with traditional hard-disk drive arrays. The company also claims the power consumption reductions outdo other all-flash arrays.Hence, the storage specialist claims a major boost in storage performance while breaking the $2 per gigabyte barrier for all-flash system storage—before compression or de-duplication. \"We are changing the industry dynamics in favor of dramatically broader flash adoption in new hyper-scale and enterprise workloads,\" asserted Sumit Sadana, SanDisk's executive vice president and chief strategy officer.SanDisk joins a growing list of storage vendors that include Dell, Violin Memory and SanDisk flash spinoff NexGen Storage that are rolling out all-flash and hybrid flash arrays intended as affordable primary storage options. While most are responding to the steady transition to hyper-scale enterprise datacenters, SanDisk appears to be one of the first storage vendors attempting to create a new flash product category dubbed \"Big Data Flash.\"SanDisk is positioning its all-flash platform as an alternative to tiered storage in datacenters, saying InfiniFlash is intended to keep pace with data growth while eliminating the need to classify applications or adjust access speeds among applications and workloads.Along with big data analytics, InfiniFlash is being targeted at high-definition content repositories and media streaming capabilities.SanDisk, Milpitas, Calif., also cited company-sponsored research by market researcher IDC that estimates the combined market for all-flash storage arrays and hybrid flash arrays grew to more than $11.3 billion in 2014. The overall flash storage market is expected to achieve double-digit growth over the next five years, IDC predicts.Hence, SanDisk and others are unveiling \"3rd Platform\" computing elements like all-flash arrays to help manage exploding data growth, the market analyst said.SanDisk also announced this week it was appointing Ravi Swaminathan as vice president and general manager to oversee its transition from storage component to storage systems and software provider as it shifts its overall focus to helping enterprises scale their big data deployments.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-03-04 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "All-flash storage",
        "Big Data flash",
        "SanDisk"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/big-data-flash/",
        "https://www.enterpriseai.news/tag/sandisk/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-04-at-12.29.49-PM-370x226.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}