{
    "title": "Red Hat Buys Storage Specialist",
    "author": "George Leopold",
    "date": "2017-08-01 00:00:00",
    "text": "Open source leader Red Hat continued its buying spree with the acquisition of a data compression software specialist focused on cloud storage.Red Hat said this week its acquisition of Permabit Technology Corp. would add data deduplication and compression capabilities to its mainstay enterprise Linux platform along with its hybrid could offerings. Red Hat (NYSE: RHT) said it would acquire all technology and assets of privately held Permabit, based in Cambridge, Mass. Other terms of the transaction such as the sales price were not disclosed.Red Hat said the acquisition would help it deliver more efficient storage associated with cloud computing and Linux application containers as hyper-converged infrastructure is rolled out to blend storage and computing on individual servers. Along with data compression, Permabit specializes in thin provisioning of storage resources.Those new capabilities will be folded into several Red Hat hybrid cloud and storage offerings, including its OpenStack, OpenShift Container and storage platforms, the company said Monday (July 31). The new data deduplication and compression tools would afford users of Red Hat Enterprise Linux \"a more efficient storage footprint,\" noted Jim Totton, Red Hat's vice president and general manager.The deal also addresses enterprise requirements for persistent storage as Linux containers enter the mainstream as a means of delivering distributed applications and other emerging micro-services.Red Hat said it plans to release Permabit's technology as a \"fully open platform to drive storage efficiency\" as an alternative to disparate tools and poorly supporting operating systems.The Permabit acquisition is the latest in a series by Red Hat, which earlier this year acquired another DevOps specialist focused on cloud-native development tools for container-based applications. The deal for Codenvy announced in May gives Red Hat a foothold in cloud-native integrated development environment known as Eclipse Che. The San Francisco-based startup was folded into Red Hat's hosted OpenShift.io development environment for building hybrid cloud services.The deal for Codenvy was the latest in a string of acquisitions by Red Hat designed to beef up its DevOps capabilities as well as its OpenShift platform. In October 2015, the company acquired IT automation specialist Ansible Inc., reportedly paying more than $100 million.With a growing list of cloud-native development tools added to its arsenal, Red Hat is now moving to help its enterprise Linux and OpenShift users clean up and shrink their stored data via Permabit's data compression technology.Separately, Red Hat also announced the release of the latest version of its enterprise Linux platform. RHEL version 7.4 emphasizes Linux container security and a workflow automation feature based on Ansible's tools designed to ease management across large production deployments, the company said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}