{
    "title": "VMware Sharpens Focus on Hybrid Cloud",
    "author": "George Leopold",
    "date": "2018-04-17 00:00:00",
    "text": "VMware this week takes the wraps off the latest versions of its server virtualization and software-defined storage platforms with an emphasis on hybrid cloud deployments, broader application support and—in the case of its vSphere platform—a three-fold reduction in memory usage and resulting performance gains via the introduction of a persistent memory feature.The latest versions of VMware’s (NYSE: VMW) flagship virtualization products emerge as the company faces pressures from a host of new infrastructure frameworks ranging application containers and other micro-services to serverless computing. Released Tuesday (April 17), VMware executives emphasized the upgrades are focused on the enterprise shift to hybrid clouds and providing the “digital foundation” for that transition.The latest version of vSphere also emphasized application security and includes a “universal app platform” for supporting emerging AI, machine language, cloud-native, in-memory, Internet of Things and other workloads.The explosion of applications and workloads is placing greater demands IT staffs hustling to manage services, noted Rajiv Ramaswami, VMware’s products and technology chief. While a growing number of enterprises are turning to agile and portable micro-services to handle more cloud-native applications, VMware is adding support for these application delivery schemes while boosting the performance of its virtual machine infrastructure.Along with a performance boost stemming from the ability to use different memory types, the company stressed that the addition of persistent memoryin vSphere 6.7 would deliver “DRAM-like performance with flash-like prices,” added Himanshu Singh, VMware's group manager for cloud platform product marketing.Hence, vSphere 6.7 leverages recent gains in non-volatile memory performance and lower costs to boost the performance for existing and new enterprise applications.The latest iteration of vSphere also includes “built-in” security features designed to shield infrastructure, application and data while tightening restrictions on access to help lock out intruders.Separately, Aqua Security said during this week’s RSA security conference in San Francisco it is collaborating with VMware to protect applications deployed across virtual machines and application containers. The collaboration combines VMware’s AppDefensesuite and Aqua Security’s container security platform, added the security vendor, which is based on Boston and Israel.Meanwhile, the latest version of vSAN responds to growing enterprise adoption of hyper-converged and software-defined networking infrastructure, company officials said. Hence, vSAN 6.7 targets hybrid cloud deployments with the goal of extending hyperconverged infrastructure to emerging enterprise applications. VMware added that the storage platform is especially geared to big data and NoSQL queries.“Databases are now the number one workload,” Singh said.Along with Hadoop, MongoDB (NASDAQ: MDB), Oracle (NYSE: ORCL) and other databases, vSAN also supports cloud-native workloads orchestrated by Kubernetes. The new version also includes data encryption.Along with a long list of private cloud infrastructure vendors that include Cisco Systems (NASDAQ: CSCO), Dell EMC and Hewlett Packard Enterprise (NYSE: HPE), VMware virtualization platforms also run on Amazon Web Services (NASDAQ: AMZN) and IBM’s (NYSE: IBM) public cloud.VMware vSphere 6.7 and VMware vSAN 6.7 are scheduled for release in early May.--Editor's note: This story has been updated to correctly identify the VMware manager, Himanshu Singh. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/shutterstock_hybrid_cloud-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}