{
    "title": "DDN, Nvidia Blueprint Unified AI Appliance with DGX-1s",
    "text": "Continuing the roll-out of the A3I (Accelerated, Any-Scale AI) storage strategy kicked off in June, DDN today announced a new set of solutions that combine the A3I platform with Nvidia DGX-1 AI servers in a validated, pre-configured solution available from a number of channel partners.In a first for the company, DDN is launching a reference architecture that combines DGX-1 8-way V100 GPU boxes with DDN's Lustre-based parallel file storage systems in a rack-level solution, designed to provide an entire AI environment out of the box.Available today through a number of resellers are three reference architectures, starting as small as a single DGX-1 with a single storage box and scaling up to what Nvidia is calling a DGX-1 Pod with 9 DGX-1s plus the recommended storage systems. The storage options are the same ones that DDN announced when it rolled out A3I back in June: AI200 and the AI7990.The all-flash AI200 appliance delivers 20GB/s of filesystem throughput, over 1 million IOPS and 360 terabytes of dual ported NVMe flash in a 2U enclosure. It can scale horizontally as a single namespace, and can integrate with hard disk tiers to help economically manage growing data volumes.DDN claims that with AI200, Caffe applications running on a DGX-1 server demonstrate 2.4X increased image throughput and complete twice as fast (compared to \"other storage products\"). Company testing also showed 2X shorter runtimes for TensorFlow training applications and a doubling of image throughput. The parallel architecture is said to maintain linear performance for applications that leverage distributed computing on multiple DGX-1 servers, such as Horovod.For customers that need to prioritize capacity, DDN also offers a larger hybrid storage system, the AI7990, which integrates flash and spinning disk, touting up to 600 terabytes of SSD in a 4U form factor. The AI7990 storage platform offers up to 20GB/s of filesystem throughput and over 1 million IOPS as a single namespace.Both storage systems will connect to the DGX-1 server with EDR InfiniBand or 100 Gbps Ethernet.Kurt Kuckein, senior director for DDN marketing, interviewed by HPCwire ahead of the launch, said the major goal with these reference architectures is to make AI as easy as possible.\"What we are hearing from our customers, and this is echoed by Nvidia, is that many of the customers don't fundamentally know where to start when it comes to deployment infrastructure. They may have an AI initiative, they may have hired a couple of very expensive scientists, but when it comes to the infrastructure piece, they are struggling to figure out the right servers, the OS, the environment and storage system to support it,\" he said. \"Alternately we also have quite a few customers who have had some initial success putting together their own servers with perhaps Nvidia GPUs and some kind of storage system on the back-end maybe leveraging existing enterprise storage or building their own Ceph-like storage system and now that they are successful, they're trying to scale their project and they just can't do it. They're spending more time engineering a solution and rearchitectuing a solution to be able to meet their scaling needs than they are finding the algorithm or growing their business that way. And so the design of this solution is really to slot easily into the datacenter and be scalable over time so that as projects are successful our systems can scale just along with the needs of the customers.\"DDN's play with Nvidia is a little different than some of the Nvidia+X partnerships we've seen in the past year, notably from Pure and NetApp.\"Most of the competition is generally leveraging NFS and we are leveraging a parallel file system that's really designed to deliver the high throughput and low latency requirements that a GPU-intensive environment has,\" said Kuckein. \"And what you get into especially at scale is problems where the GPUs are not being fully saturated and so with NFS generally you are going to have peaks and valleys during read operation because of the nature of the NFS protocol versus a parallel file system, which is going to keep the GPUs fully saturated because we are maximizing the internal architecture of the DGX-1. We are taking advantage of the design of the DGX-1 which is designed around an RDMA network and we are connecting to that network rather than leveraging a more traditional enterprise-oriented network.\"DDN also states that its A3I products have been rigorously tested and integrated around a set of widely-used deep learning frameworks, including TensorFlow, Horovod, Torch, PyTorch, Nvidia TensorRT, Caffe, Caffe2, CNTK, MXNET and Theano.A real-world example of deep learning in action comes from a DDN customer, autonomous retail specialists Standard Cognition. They have a store with multiple cameras that use AI software to identify the items shoppers have selected for purchase, such that the shopper can just grab something off the shelf and walk out with automatic detection of payment. Standard Cognition does all processing locally, in the interest of real time performance and customer privacy.A number of other use cases are expected across the enterprise, from retail to oil and gas to healthcare. A popular deployment example is the hub-and-spoke model, where customers have a remote field need for data acquisition as well as inference so they need to do things in real-time in the field but then they send that data from the field back to an aggregated central system, which makes optimizations for the device in the field. This hub and spoke model could use the smaller form factor AI200 for real-time analysis within the local retail outlet itself and then the larger capacity AI7990 in their centralized system to further refine their model based on aggregated data collected from multiple locations.It's interesting that DDN, while it has a 20-year history of deploying successful solutions with OEM vendors like HPE and Dell, has never worked with a server maker and channel partners to develop a reference architecture like this, and it's really a sign of the times when end users with AI workloads require HPC with an “easy button.”The approach got a nod from Steve Conway, senior research vice president, Hyperion Research, who said, \"the powerful trend toward AI and other high-performance data analytics workloads is driving the need for storage and compute systems that deliver simplified scale and extremely fast data rates.\" He further added, \"DDN A3I with Nvidia DGX-1 is an impressive effort to meet the demanding workload requirements of data scientists across AI and deep learning environments.\"The DDN A3I with Nvidia DGX-1 solutions are available today through U.S. value-added resellers Microway, Meadowgate Technologies and Groupware Technology. Other authorized partners include Penguin Computing, World Wide Technology, and ePlus, in the U.S., and GDEP Solutions, XENON and E4 Computer Engineering, in select international regions. All channel partners are certified to deliver and support the rack-level solution.Article originally appeared in HPCwire.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "author": [
        "Tiffany Trader",
        "https://www.enterpriseai.news/author/tiffany/"
    ],
    "date": "2018-10-04 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "DDN",
        "DGX-1",
        "GPU",
        "high performance storage",
        "NVIDIA"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ddn/",
        "https://www.enterpriseai.news/tag/dgx-1/",
        "https://www.enterpriseai.news/tag/gpu/",
        "https://www.enterpriseai.news/tag/high-performance-storage/",
        "https://www.enterpriseai.news/tag/nvidia/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/DDN-A3I-with-Nvidia-DGX-1-racks-1018-370x290.png",
        "https://www.hpcwire.com/wp-content/uploads/2018/10/DDN-A3I-with-DGX-1-1100x.png",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}