{
    "title": "How Open Software-Defined Storage Unchains the Enterprise",
    "author": "no author",
    "date": "2019-03-06 00:00:00",
    "text": "By decoupling storage controller software from hardware, software-defined storage (SDS) has the potential to unleash a number of possibilities, including massive storage scalability to handle massive amounts of data. Companies can also gain greater flexibility as they can upgrade or downgrade storage as necessary--a benefit that can result in significant cost savings especially as storage utilization has been trending downward in the datacenter.Even in today’s “software-defined everything” environment, many companies have yet to move on from their traditional storage architectures and processes. However, there are many reasons why they should consider migrating to SDS.ScalabilityToday, organizations routinely deal with petabytes, even exabytes, of data. Consider the organization that has several different x86 servers, each with its own storage capacity and software. With SDS, storage administrators can scale capacity up and down at a highly granular level depending on workload needs, keeping costs in check and budget purchase and maintenance expenditures in a gradual manner, not one dictated by the technical requirements of any self-contained solution.AgilityAs organizations strive for increased development agility – moving away from traditional waterfall methods and towards DevOps – their existing systems and workflow processes may begin to look increasingly like dinosaurs. Speed is the name of today’s game. Developers want the ability to quickly provision storage resources they need when they need them and in the right quantities, preferably via automation, without having to trouble a storage administrator. In short, they want the agility to develop and deliver applications at a faster pace than ever before.SDS can open up new possibilities for both developers and storage administrators. For example, SDS is a foundational element of container-based storage--persistent storage that runs alongside applications developed in a container. Developers working on these applications can simply provision their own storage during the development phase without having to request it from an administrator. Such independence can accelerate development time, provide container-based applications with critical storage capacities, and enable data administrators to focus on other mission-critical tasks or participate more in the development process.Flexibility Enterprises rely on vendors for patches and upgrades. As such, they can find themselves investing larger amounts of time and money to enable their hardware to work well with the rest of their infrastructure.SDS can also help defend against vendor lock-in. Companies are no longer wedded to a particular piece of hardware; the storage software can work across different types of infrastructures – bare metal, virtual, cloud and any type of traditional hardware. It is platform-agnostic and operates by distributing workloads across the entirety of an organization’s infrastructure, effectively integrating disparate storage deployments to build a new type of storage infrastructure.Software-defined storage based on open source technology also has the advantage of the open source community, which is delivering innovations aimed at enabling SDS to remain flexible. A commitment to freedom of choice is a key tenet of that community. As efforts like OpenSDS exemplify, that commitment is alive and well.Development and storage needs are changing. Things are much different today than they were 10 years ago or will be 10 years hence. Forward-thinking organizations should consider investing in SDS to assure themselves a more agile, efficient, flexible, and cost-effective storage infrastructure that can adapt to the world of containers and the cloud.Irshad Raihan is a storage product director at Red Hat.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/data-storage-shutterstock-1085748272-370x290.jpg"
    ]
}