{
    "title": "NSF Partners With VMware on IoT, Launches Computing Efforts",
    "text": "The National Science Foundation has launched a partnership with VMware to advance edge computing infrastructure required for the Internet of Things (IoT).Separately this week, NSF unveiled a $30 million investment in computing and information sciences targeting advances in areas such as AI systems, quantum computing and biomedical imaging.The partnership with VMware (NYSE: VMW) seeks proposals from university researchers under a program called “Edge Computing Data Infrastructure.” The effort focuses on the enormous volumes of data expected to be generated by IoT devices and services.“A key shift is from edge devices consuming data produced in the cloud to edge devices being a voluminous producer of data,” the agency noted. “This shift reopens a broad variety of system-level research questions concerning data placement, movement, processing and sharing.”Hence, the $6 million edge computing initiative seeks new architectures for moving computing and storage resources closer to mobile and IoT devices at the network edge. Infrastructure components range from IoT network gateways and traditional central office switches to “cloudlets” (also known as a cloud “datacenter in a box”) and micro-datacenters, the partners said.NSF said it expects to award two grants each totaling about $3 million over three years. Program solicitation details are here. The deadline for proposals is May 22, 2018.Also this week, NSF announced an advanced computing initiative that will fund three research teams pursuing “large-scale, far-reaching and potentially transformative research in computer and information science and engineering.” The $10 million grants extending over five years target AI decision-making, quantum computing bio-imaging technologies,Investigators at the University of California at Berkeley will build “AI decision systems” based on open-source platforms, tools and algorithms under a program dubbed “Real-time, Intelligent, Secure, and Explainable” decisions.A quantum computing project led by the University of Chicago will tackle the current gap between theoretical algorithms and practical quantum computing architectures under a project called “Enabling Practical-scale Quantum Computing.” Researchers will develop new algorithms along with software and hardware designs tailored to quantum machines capable of between 100 and 1,000 quantum bits, or qubits.By comparison, researchers reported last November that quantum simulators had finally crossed the 50-qubit threshold.“This project will increase the efficiency of practical quantum computation and aid in transitioning quantum computing out of the laboratory and into practical use,” NSF said Tuesday (Feb. 27).Researchers from Georgia Institute of Technology, Massachusetts Institute of Technology (MIT), Princeton University and University of California at Santa Barbara will contribute to the quantum computing effort.Rice University will lead an initiative to develop a computational imaging system for medical applications that “unravels” scattered light that becomes entangled as it passes through the body. Contributing to the project, “Computational Photo-Scatterography: Unraveling Scattered Photons for Bio-Imaging,” are Carnegie Mellon University, Cornell University, Harvard University and MIT.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-03-02 00:00:00",
    "cats": [
        "Academia",
        "AI/ML/DL",
        "Data Analytics",
        "Datacenter",
        "Healthcare",
        "Life Sciences",
        "Sectors",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Networks",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/sectors/academia-sectors/",
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/sectors/healthcare-sectors/",
        "https://www.enterpriseai.news/category/sectors/life-sciences-sectors/",
        "https://www.enterpriseai.news/category/sectors/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "AI",
        "bio-imaging",
        "edge computing",
        "iot",
        "medical imaging",
        "nsf",
        "quantum computing",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/bio-imaging/",
        "https://www.enterpriseai.news/tag/edge-computing/",
        "https://www.enterpriseai.news/tag/iot/",
        "https://www.enterpriseai.news/tag/medical-imaging/",
        "https://www.enterpriseai.news/tag/nsf/",
        "https://www.enterpriseai.news/tag/quantum-computing/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/Screen-Shot-2018-03-02-at-11.51.30-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}