{
    "title": "OpenZFS Project To Coordinate Open Source Development",
    "text": "The Zettabyte File System, or ZFS for short, developed by the former Sun Microsystems and initially delivered in 2005 with the Solaris 10 version of Unix is arguably one of the best innovations to come out of that company, now part of Oracle, aside from the Network File System, the Solaris operating system, and the UltraSparc-II chip. ZFS represented some true innovation in file systems in terms of ease of use and scalability, and it is a key component of Oracle's storage business today.ZFS was open sourced along with Solaris 10 eight years ago, and relatively quickly ports were under way to bring it to Linux, FreeBSD Unix, and Mac OS X. In the wake of Oracle's acquisition of Sun in early 2010, open source development for Solaris, ZFS, and other systems programs that Sun had opened up all but ceased. Oracle has no interest in outside development of any software it controls and is similarly not keen on releasing its source code to other developers.But once the code genie is out, you can't put it back into the bottle so easily. So a number of companies with interest in OpenSolaris and ZFS have tried to carry on with the open source work even as Oracle does its own development for the \"real\" Solaris and ZFS behind its corporate firewall.Last week, the several companies that have products based on ZFS teamed up to create the OpenZFS project, a place where ZFS developers working outside of Oracle can get together to talk about changes to the code in their projects and eventually reduce the code differences between their various implementations. The project members include Matt Ahrens, who co-founded the ZFS effort inside of Sun back in 2001 and who works at Delphix, a provider of data management tools based on ZFS, and Brian Behlendorf, a computer scientist at Lawrence Livermore National Laboratory who works on file systems for supercomputer clusters. (LLNL uses both the Lustre file system and ZFS, and in fact, you can embed ZFS inside of Lustre to get some really interesting functionality.)Company sponsors of the effort include Nexenta and Spectra Logic, which have bundled ZFS into their respective storage arrays, and Joyent, a public cloud operator that has built its own Solaris and ZFS implementation, based on the open source code released by Sun, as the backend for that cloud. GMO Internet, Helios, HybridCluster, IXSystems, OmniTI, Pogo Linux, RackTop, SageCloud, and Wheel Systems are all involved in open source ZFS development and putting it inside their products and have lined up behind OpenZFS.The plan is for all of the OpenZFS luminaries to get together somewhere in the San Francisco bay area in late November to have a beer bash and hackathon and figure out how to improve the ZFS file system development that is going on outside of Oracle. It would be interesting to see a plan to work all of the different implementations back to a single OpenZFS code base, and that could at some point happen. But that is not an explicit goal of the project. Yet.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2013-09-20 00:00:00",
    "cats": [
        "Editor's Picks: Software",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-software/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "File Systems",
        "Open Source"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/file-systems/",
        "https://www.enterpriseai.news/tag/open-source/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/zfs-logo-300x231.jpg"
    ]
}