{
    "title": "Intel Launches Cascade Lake Xeons — Up to 56 Cores",
    "author": "Tiffany Trader",
    "date": "2019-04-04 00:00:00",
    "text": "At Intel's Data-Centric Innovation Day in San Francisco (April 2), the company unveiled its second-generation Xeon Scalable (Cascade Lake) family and debuted its Optane persistent memory module, along with other products (more below). Notable for high-end computing watchers was the launch of Cascade Lake-AP (Advanced Performance), now known as the Xeon Platinum 9200 processor, designed for high-performance computing, advanced analytics, artificial intelligence and high-density infrastructures. All told, Intel is introducing more than 50 new standard Cascade Lake SKUs in addition to dozens of custom SKUs.Intel had previously disclosed that Cascade Lake-AP would have up to 48 cores, but this week revealed a product with up to 56 cores in a multi-chip module (two dies, one package) capable of delivering ~3 double-precision teraflops per processor, the most flops-performant Intel chip since the discontinued Knights Landing. With 12 channels of memory (six per die), the 9200 also offers the highest DDR4 native memory bandwidth support of any Intel Xeon processor platform.There are four SKUs in the 9200 family–based on 14nm technology like the rest of the Cascade Lake microarchitecture– 32, 48 and 56 core options with TDPs ranging from 250 watts to 400 watts.The first announced customer for the Xeon Platinum 9200 is the North German Supercomputing Alliance (HLRN), which supports scientific computing needs for seven of Germany’s 15 states. Work on a new Atos Bull system–HLRN-4, located at University of Göttingen–began in 2018 with existing Intel Xeons (Intel Skylake Gold 6148 CPUs). Slated for completion by the end of the year, the full system will have nearly a quarter million compute cores, providing on the order of 16 petaflops of performance, a six-fold increase over the previous HLRN system.“We are a very demanding client,” said Ramin Yahyapour, professor of computer science at University of Göttingen and managing director of GWDG, a joint compute center of Max Plank society and University of Göttingen. “A lot of our research is getting more compute and data intensive. We are not looking for peak theoretical performance but for real system performance, and the Intel Xeon Scalable Advanced Performance is giving us this kind of performance. In addition the CPU is quite good for artificial intelligence and machine learning.”The Xeon 9200 has shown early success on the SPECrate 2017 Floating Point benchmark, as demonstrated by Navin Shenoy, executive vice president and general manager, Intel’s Data Center Group, who keynoted today’s event.Running on a two-socket server with 56 cores per processor, Shenoy showed a new record of 522 fp_rate versus the previous record of 282 fp_rate. The time stamp you see on right hand side (see slide at right) shows you that the benchmark finished just a couple hours prior to the demonstration.“SPECrate is a traditional high performance computing benchmark,” said Shenoy. “It’s CPU-intensive, it takes advantage of the core count, and it takes advantage of the memory bandwidth.” Intel has submitted its results to the SPEC committee and is awaiting their review.At today’s launch gala, the company revealed a total of seven new data-centric products, what Intel CEO Bob Swan and other Intelites referenced as “the first truly data-centric portfolio of products.”In addition to the Cascade Lake introductions, Intel also announced the Intel Ethernet 800 series adapter which supports 25, 50 and 100 Gigabit transfer speeds; the latest Optane SSD with dual-port capability; the QLC NAND Ruler drive (the industry’s first EDSFF compliant drive, which packs a petabyte of storage into a very small ruler form factor); Optane Data Center Persistent Memory (Google and the Texas Advanced Computing Center are the first customers); the Xeon D 1600 chip for “power and space efficient network processing;” and the company’s first 10nm FPGA–the Intel Agilex series–offering “a leap forward in programmable acceleration.”Of the new Optane persistent memory module, Shenoy said, “I’m holding 512 GB of memory in my hand. This is 2-4X what you can get with DRAM. We expect system capacity in a server system to scale to 4.5 TB per socket or 36 TB in an 8-socket system [when combined with traditional DRAM]. That’s three times larger than what we were able to do with the first-generation of Xeon Scalable.”Intel’s Cascade Lake stack includes more than 50 standard SKUs complemented by dozens of custom offerings.“We are delivering 8-core Xeons all the way up to 56-core, the highest core count we’ve ever delivered on Xeon,” said Shenoy. “We are delivering support for 1- 2- 4- and 8-socket glueless support for Xeon.”New features built into the Cascade Lake family include integrated Deep Learning Boost (DL Boost) for AI deep learning inferencing acceleration and support for Intel Optane DC persistent memory (excluding Bronze, Silver and Platinum 9200 parts). Intel also said the new Xeons include CPU architecture enhancements to provide hardware security mitigations for side channel security attacks.With a combination of hardware and software improvements on DL Boost, Intel is reporting a 14x deep learning inference performance improvement from the Xeon Scalable first-generation in July 2017, and with Xeon Platinum it is seeing a further 2x speedup (which makes sense since it’s essentially two CPUs in one-package).Shenoy said the entire ecosystem is ready to ship now and that the second-generation Scalable Xeon will be “the fastest-ramping Xeon ever.”Here’s a rundown on the announced second-gen Scalable Xeon lineup (per company literature):This article first appeared on sister site, HPCwire.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/Intel-2nd-Gen-Scalable-Xeon-20190402-800x-675x380-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/Intel-Xeon-Family-9200-040219-664x.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/Intel-Xeon-Platinum-9200-SPECrate-2017-benchmark-1000x.jpg",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/Intel-Data-Centric-Event-7-New-Products-20190402_1200x.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}