{
    "title": "Juggling Security With Greater Data Access",
    "text": "Securing critical data while simultaneously making it more accessible is the challenge for enterprise IT departments, a new vendor survey finds.In a report released Wednesday (Jan. 10), big data integration specialist Syncsort said it examined what data protection and IT strategies companies are deploying to counter hackers, data breaches, service disruptions linked to natural disasters along with \"escalating storage and data accessibility needs.\"Nearly half the more than 5,600 respondents to the survey said they expect to pursue new security initiatives over the next two years as data threats increase and grow in sophistication. (Security efforts will likely expand with last week's disclosure of fundamental chip design flaws dubbed \"Meltdown\" and \"Spectre\".)In the meantime, security strategies include more aggressive patch management, virus and malware protection as well as improved intrusion detection and prevention.Despite growing threats and greater emphasis on threat detection, the survey found relatively lax security audits: While nearly two-thirds of those polled said they perform security audits, most do so only on an annual basis. Those percentages were slightly higher for IBM Power architecture users, Syncsort reported.Cloud migrations are among the factors driving security concerns, especially as more enterprise applications are shifted to hybrid clouds. Forty-three percent of those polled said cloud security was their top concern.Syncsort said 47 percent of respondents cited \"business continuity\" and \"high availability\" as top priorities.\"IT leaders are under immense pressure to provide an enterprise infrastructure that can sustain severe threats and secure vital information while enabling data accessibility and business intelligence,\" Terry Plath, Syncsort's vice president of global services, noted in a statement.All this is occurring as businesses struggle to come up with better ways to securely share data. More than half (53 percent) of those surveyed said they are supporting multiple databases to share data and boost business intelligence. Most are broadening access through scripting or file sharing.As companies upgrade outdated systems or seek to boost data platform performance, nearly half of respondents said they have withstood system migration failures. Sixty-eight percent said their IT systems were down for as much as 48 hours during their last platform migration.As a result, big data integration software vendors such as Syncsort argue that data-driven enterprises must bolster their disaster recovery plans. \"Only half of businesses are meeting their recovery time objective, and, despite known risks, 85 percent of respondents had no recovery plan or were less than 100 percent confident in their plan,\" the report warned.Another Syncsort survey released in December found uncovered growing concerns about data quality and regulatory compliance as companies brace for new European Union data privacy rules that take effect in May. Syncsort reported that 40 percent of survey respondents—mostly in the financial and insurance sectors—said unreliable data is continuing problem, contributing to the steady shift to data lakes as a way to improve data quality.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2018-01-10 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Security",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "big data integration",
        "data access",
        "data security",
        "disaster recovery",
        "resilience",
        "Syncsort",
        "system migration"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/big-data-integration/",
        "https://www.enterpriseai.news/tag/data-access/",
        "https://www.enterpriseai.news/tag/data-security/",
        "https://www.enterpriseai.news/tag/disaster-recovery/",
        "https://www.enterpriseai.news/tag/resilience/",
        "https://www.enterpriseai.news/tag/syncsort/",
        "https://www.enterpriseai.news/tag/system-migration/"
    ],
    "pic_urls": [
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}