{
    "title": "In Advanced Computing and HPC, Dell EMC Sets Sights on the Broader Market Middle",
    "text": "If the leading advanced computing/HPC server vendors were in the batting lineup of a baseball team, Dell EMC would be going for lots of singles and doubles – and some home runs, too – trying to hit for a high batting average. The cleanup hitter would be HPE, swinging for the fences with recent acquiree and supercomputing powerhouse Cray. The tradeoff in Dell EMC’s strategy: win more deals in the broader middle market knowing that HPE and Cray will grab bigger headlines and boast more mega-deal marquee spots at the top of the HPC Top500 list.We recently sat down with Dell EMC’s Thierry Pellegrino, VP Business Strategy & HPC Solutions Server and Infrastructure Systems, to discuss his company’s positioning in the consolidating advanced computing industry. Central to his vision of competing against co-market leader (see below) HPE, whose acquisition of Cray was preceded by its 2016 purchase of SGI), is his view that the mid-market is expanding as AI and other high-demand workloads become more widely adopted; this in turn requires vendors to deliver servers, software and services tailored for customers lacking in HPC-class computer science skills. Ergo: the company is building an HPC product portfolio for the middle quintiles of the high end systems industry.“Look, our strategy is clear,” Pellegrino told us. “We're not trying to get a majority share of the entries in Top 500. We're not trying to win every single exascale computer out there.…”The focus, he said, is on higher volume, smaller scale systems. “There's a lot to be done in kind of the middle of the pyramid. The top of the pyramid, we can and will play there, but we don't want to dedicate our energy to being the leader in that space. And then, you know, HPC becomes more and more mainstream in a certain way. So a big part of what we want to do as we follow our three tenets – which is advancing, optimizing and democratizing HPC – is to make HPC available to smaller size customers where the type of workloads they want to run doesn't run on a single server, doesn't run on two servers, they need some level of parallelism, and they don't want to go and design or understand how to build a cluster, but they'd like to have access to that technology. We want to be that partner that can simplify it for them and make it available.”Still, Pellegrino said, when a supercomputing opportunity presents itself that Dell EMC feels is a good fit, the company will compete. He cited two elite systems wins: “Frontera,” installed at the Texas Advanced Computing Center at the University of Texas in Austin in 2018, a Dell C6420 system utilizing Intel Xeon Platinum processors with throughput of 23.5 petaflops, ranked fifth on the Top500 list; and, currently claimed by Dell EMC to be the most powerful industrial supercomputer, “HPC5” at Italian utility giant Eni, comprised of 1,820 Dell EMC PowerEdge C4140 servers with Intel Gold 6252 24-core processors and four Nvidia V1000 GPUs, with peak power of 70 petaflops, announced last October.“Our customers want to know they can come to a partner that can deploy large scale, whether it be processor-based or GPU-based, or different types of processors,” Pellegrino said.Even as HPE mounts an increasingly formidable challenge with Cray and SGI under its hood, Pellegrino contended that industry consolidation has had the unintended consequence of raising Dell EMC’s profile, by process of elimination.“Let's talk about HPE buying two of our competitors,” he said. “So on the on the one hand, it's building up HPE to being a bigger company in the HPC space. It's great for them. On the other hand, look at the landscape. It used to be Cray, SGI, Dell, EMC, Lenovo. So we've seen a consolidation, and it has an interesting side effect. A lot of customers are looking for either alternative technologies or choice in their environment.“So for customers that want to have at least two sources for their systems, we've become really an interesting partner to call to the party. And we see that more and more. So even though it might be counterintuitive – to see HPE acquire SGI and Cray as maybe a competitive environment that's going to hurt Dell EMC – it's actually helped us gain even more relevance in discussions where we're called to come in to be the that second source or sometimes being that first source.”Assessing the results of Dell EMC’s middlebrow HPC strategy depends on whose market share analyses you subscribe to.As of its most recent HPC market update, covering the first half of 2019, released during the SC19 supercomputing conference in November, industry analyst firm Hyperion Research reported that in the $6.7 billion HPC server sector, HPE has 35 percent market share – not including Cray’s 2.3 percent share – while Dell EMC is at 21 percent.Meanwhile, Intersect 360 Research reported at SC19 that for 2018, HPE and Dell EMC were virtually tied for HPC server market share, and the firm’s president, Addison Snell, said that when HPC server and storage market shares are combined, Dell EMC leads HPE, 29.8 percent vs. 25.6 percent.Whatever the case may be, a central element of Dell EMC’s democratization strategy are “Ready Solutions,” jointly engineered with business partners and designed to deliver tested high performance configurations for specific use cases, such as HPC, AI, data analytics, software-defined infrastructure, along with vertical focus areas within those categories. The idea is to offer design choices that accelerate deployments and scaling.The goal, Pellegrino said, is “to simplify the discussion with our customers, whether they're in manufacturing or they're in life sciences, or in any kind of AI type of workload they're trying to solve.”While some customers have the skills and experience to build their own clusters, Pellegrino said, for the “big majority” of Dell EMC customers “starting with a clean sheet is a daunting moment.” He cited several new solutions, reference architectures and technology upgrades for HPC storage and AI, announced in November.On the HPC storage side, Dell EMC announced turnkey solutions for ThinkParQ’s BeeGFS and ArcaStream’s PixStor software-defined parallel file system, designed for I/O-intensive workloads and scalable from small clusters to enterprise-class systems on premises or in the cloud, according to the company.Dell EMC also launched a an AI Ready Solutions for the Domino Data Science Platform, designed to help data scientists develop models faster while providing a data science lifecycle platform. The company also released Dell EMC reference architectures for DataRobot, Grid Dynamics, H20.ai, Iguazio and Kubeflow on Red Hat OpenShift.“Look, it's great to be in a world where technology is advancing at such a pace, but it's becoming very complicated,” Pellegrino said. “Between the processors, the memory types, the storage types, the accelerator types, the level of cooling and power delivery that you need to think of, the deployment, the cost of deployment tools, the different stacks, whether you're doing traditional HPC, data analytics or (AI) inferencing or training, or even if in in an enterprise class environments – how do you integrate all this with a cloud environment, with something that is vastly distributed? We have to answer all those questions. And little by little, we're building up all those building blocks that help our customers really do everything they want to.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2020-01-22 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/dell-emc-products-datastorage-460x165-source-Dell-0120-370x165.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Thierry-Pellegrino-Dell-EMC-2019.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Dell-EMC-logo.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/Intersect360-HPC-Server-market-share-11-19.png"
    ]
}