{
    "title": "Chip Makers Collaborate on NVMe Fabrics",
    "author": "George Leopold",
    "date": "2018-03-19 00:00:00",
    "text": "A trio of chip makers will collaborate on a reference architecture for speeding deployment of NVM Express over storage network fabrics.Cavium Technologies, which specializes in processors for cloud datacenters, announced the NVMe-over-fabrics collaboration with chip makers Marvell and Microsemi Corp. at the opening of this week’s Open Compute Project (OCP) Summit in San Jose. The partners said they would demonstrate the framework running on x86 and ARM64 architectures.Cavium also this week announced a server partnership with Hewlett Packard Enterprise to add a next-generation network connection to a line of HPE servers.Cavium (NASDAQ: CAVM) said Monday (March 19) it would contribute its ThunderX2 processor along with 100-Gb Ethernet network adapters and programmable switches. Meanwhile, Marvell (NASDAQ: MRVL) will chip in with NVMe solid-state drive controllers while Microsemi contributes PCIe switches and flash memory cards. The partners said their hardware platform would also use software packages from Cavium and Microsemi designed to boost performance by offloading computing resources from the data pipeline, thereby leveraging NVMe controller memory buffer technology.The configuration will demonstrate concurrent 100 Gbps NVMe-over-fabric connectivity running on x86 servers to flash arrays, including Facebook’s (NASDAQ: FB) Lightning, the company’s NVMe JBOF, or “just a bunch of flash” platform. The partners said the OCP demonstration would showcase how hardware vendors could boost storage performance and reduce latency “by offloading the compute resources from the data path....”Added Christopher Moezzi, marketing chief for Cavium’s Ethernet Server Adapter Group: “NVMe technology is rapidly changing the way cloud and enterprise datacenters connect to shared storage but building [NVMe-over-fiber] solutions require industry-wide technology integrations.”Driven by NVMe, the partners said low-latency networking is required in order to scale out data-handling fabrics of interconnected switches.San Jose-based Cavium’s ThunderX2 is a second-generation, 64-bit ARMv8-A server processor the chip maker is aiming at datacenter, cloud, storage and HPC applications. The ARM64 processor along with its network connector and programmable Ethernet switches are generally available.Separately, Cavium announced a partnership with HPE (NYSE: HPQ) to develop hyperscale designs based on the OCP specifications to boost enterprise IT operations. The Cavium networking components would be used in HPE’s Cloudline servers. The collaboration also would help drive OCP’s latest network connector standard, the partners said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/Screen-Shot-2017-11-16-at-5.36.30-PM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}