{
    "title": "HPE Guarantees 100% Uptime with Primera Storage",
    "author": "no author",
    "date": "2019-06-19 00:00:00",
    "text": "Enterprises will no longer need to compromise between agility and reliability when it comes to their high-end storage environments according to Hewlett Packard Enterprise, which today unveiled Primera, a new high-end storage array that’s essentially self-managing and uses AI techniques to deliver 100% reliability guaranteed.HPE  has no shortage of tier-one, enterprise-class storage options, with Nimble, 3PAR, and XP7 product lines. The new Primera offering borrows some technology from those existing product, including the InfoSight AI capabilities developed by Nimble and the underlying distributed storage architecture of 3PAR.When it becomes available for order in August, Primera will become the company’s number one enterprise-class storage option going forward, HPE executives said today at HPE Discover, the company’s annual user conference, which is taking place this week in Las Vegas, Nevada.Primera will be best utilized on enterprise workloads that are both mission critical and unpredictable. Currently, enterprises must sacrifice simplicity for their storage network if they want the reliability that critical applications require.“But what if you could get both?” asks Sandeep Singh, HPE’s vice president of storage marketing. Companies are looking to accelerate “pretty much everything,” Singh says. “The challenge is as they do this the IT is tied down with complexity…but the business and developers are demanding agility across the board.Digital transformation is driving higher levels of complexity into the storage environments of enterprises, HPE says. While traditional business applications have always demand enterprise-class storage with high uptime guarantees, they haven’t been overly complex.That relative level of stability is changing as these critical business applications are broken up into services, served via containers, and hosted on constantly changing compostable infrastructures. Emerging big data use cases, such as machine learning, are also giving enterprises unpredictable workloads.These are targets for Primera, says Milan Shetti, senior vice president and general manager of storage and big data at HPE. “We want to organize the complex and unpredictable workloads of the world using intelligence,” Shetti says. “That’s the core philosophy of what we’re trying to do.”The key organizational element underlying Primera is InfoSight, the machine learning-powered service developed by Nimble, which HPE acquired back in 2017. HPE says InfoSight has analyzed quadrillions of data points over the past decade as it learned what sorts of activities and events in the network, storage, servers, virtual machines, and application layers can impact the availability of the storage array. Along the way, it has helped customers avoid 1.5 million hours of downtime in their storage arrays.InfoSight, which is backed by 25 data scientists at HPE who utilizes common big data components, like Spark, Hadoop, and Juptyer, is the core element that HPE is counting on to enable Primera to be mostly self-managing. When InfoSight detects a potential problem, HPE will take action that addresses the situation and hopefully resolves it, which HPE says makes Primera a core component of its “Intelligent Data Platform.”HPE says more than 90% of the problems that arise with storage arrays originate above the storage layer — specifically, in the network, server, and virtualization layers. That’s one of the reasons why HPE is so confident that customers will avoid downtime with Primera that it’s attaching a 100% availability guarantee to the product.Other storage systems may offer six nines, but that’s not 100%, says Philip Davis, president of hybrid IT and chief sales officer for HPE. “Not 99.9%, not six 9s. 100% availability on Primara,” he says. “That’s pretty available.”It’s amazing how many outages you see because the fiber optic cable has too much of a bend in it and started introducing too much noise, Davis says. “Silly things like that. We’ve greatly simplified that. There’s only six cables now in total. Plug in six cables, literally click a button, and you go from rack to applications running in less than 20 minutes. So a very different user experience.”If customers do experience an outage with Primera, they will receive an outage credit that’s worth up to 20% of the value that can be utilized for future upgrades and purchases, HPE says. To be eligible, they must have Infosight and be signed up for HPE Proactive Care or higher.When it’s available, customers will be able to deploy Primera either on-premise or as a cloud service through the HPE GreenLake.This article first appeared on sister site Datanami.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/HPE-Storage_Primera_FrontTop_Bezel-300x248.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/HPE-Storage_Primera_FrontTop_Bezel-300x248-300x248.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/Primera_architecture-295x300.png"
    ]
}