{
    "title": "DDN Eyes Enterprise with Storage Strategy",
    "author": "George Leopold",
    "date": "2015-06-30 00:00:00",
    "text": "Scalable storage specialist DataDirect Networks (DDN) is launching an aggressive technology roadmap built around software-defined storage, data analytics and other cloud-based services such as active archiving as enterprises cope with growing amounts unstructured data.DDN (Santa Clara, Calif.) led off its technology roadmap with the release Tuesday (June 30) of version 2.0 of its Web Object Scaler (WOS) object storage platform that targets private and public cloud storage build outs. The upgraded object storage platform will be available in August, the company said.The WOS update will be followed during the second half of 2015 by the release of a hyper-converged \"Wolfcreek\" platform that will serve as a \"building block\" for future DDN storage offerings. Wolfpack is billed as capable of over 60 Gb/sec. throughput and more than 5 million IOPS in a 4U rack space. Like other storage vendors, DDN is stressing hyper-converged infrastructure as datacenters run out of space.Also in the second half of this year, DDN said it would roll out its \"Infinite Memory Engine\" (IME) that leverages I/O accelerations software to deliver a claimed 1,000-fold increase in I/O performance. IME also is being positioned as among the first flash-based, \"application aware\" I/O accelerators delivering 4 million IOPS per system, the company said.Like many successful HPC vendors, DDN has increasingly turned its attention to the burgeoning enterprise market. “There are only so many government agencies and universities and it becomes a matter of simply stealing market share rather than opportunities for growth,” said Alex Bouzari, DDN's chairman and co-founder, said in an interview.Hence, more than half of DDN's revenue now comes from outside the HPC market \"because the enterprise sector is growing so rapidly,\" he added.Bouzari stressed that the enterprise market for DDN would eventually dwarf the HPC market in which it is already a dominant player (see HPC Wire, DDN, IBM Lead Large HPC Storage Supplier Pack). “It’s basically all of the vertical enterprises markets which are exhibiting HPC kinds of requirements; for the most part the Global 1000.”Both HPC and large enterprise segments crave performance, but with distinct differences: \"HPC customers say, 'Give me the highest bandwidth possible and I will sacrifice reliability.' Enterprise customers would never compromise on resiliency and redundancy – that’s their business,” said BouzariDDN has relied heavily on distribution channels for product fulfillment, even though its direct sales team is the major force creating demand. The nature of its channel is changing, Bouzari stressed, particularly the enterprise market: “It used to be that 80 percent of our revenue was through the channel and 80 percent of that went through very big resellers such as IBM, HP and Dell. Now the channel is still 80 percent of our but only a very small portion goes through the big guys. Most of it is going through mid-size and small resellers.\"With those market realities in mind, DDN said this week it would expand its software-defined storage offerings. For example, WOS object story represents the first DDN storage software for use on non-DDN hardware. SFX flash caching software followed. Similarly, IME will be offered as a software-only option.These and other recent announcements illustrate how software-defined infrastructure is making headway in the enterprise datacenter.DDN's enterprise push targets a range of industries and HPC customers from financial services and energy to cloud services providers and telecommunications carriers. Along with IME and WOS, DDN's storage portfolio includes \"Scaler\" file systems appliances and its Storage Fusion Architecture that combines storage, processing and embedded applications.DDN is betting that the software-defined datacenter will require across-the-board data management, including persistent disk and tape storage along with distributed data storage in the cloud. Lance Broell, product marketing manager for WOS products at DDN, said a key use case will be active archiving in private enterprise clouds.Broell cited other WOS use cases besides public and private cloud storage, including content distribution, file synch and share along with video streaming.The WOS upgrade includes up to 96 8-Tb SATA drives in a 5U rack. That, DDN claims, is twice the density of storage competitors like Hewlett-Packard and Dell that currently offer about 50 drives in roughly the same configuration. WOS storage capacity tops out at 8 billion objects, the company said.The object storage upgrade also adds support for OpenStack/Swift APIs designed to enable OpenStack environments to leverage WOS using the native Swift API. The move was prompted in part by the enterprise requirements to be compatible with Amazon Web Services’ Simple Storage Service (S3) object storage. Broell said an embedded interface option provides both S3 and Swift interfaced embedded into WOS appliances. Hence, any S3 or Swift instance can access a WOS node in a storage cluster. In an attempt to squeeze more efficiency out of storage infrastructure, DDN also implemented a two-stage hierarchical erasure coding approach that reduces overhead by, for example, eliminating the need to rebuild network drives. It also boosted network security by adopting secure sockets layer certification. That's important, Broell noted, because data traffic is most vulnerable as it moves across wide-area networks.Networks are also increasingly becoming bottlenecks for object storage. Hence, DDN claims WOS reduces latency by as much as 90 percent as video streaming, content distribution and large file transfers become standard requirements in both the HPC and enterprise markets.--John Russell contributed to this report.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Screen-Shot-2015-06-30-at-11.58.13-AM.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Screen-Shot-2015-06-30-at-11.39.47-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}