{
    "title": "Rumors Swirl of Dell-VMware ‘Reverse-Merger’",
    "author": "Doug Black",
    "date": "2018-01-30 00:00:00",
    "text": "Just days after reports surfaced of a major management overhaul at Dell EMC, this week new reports emerged that Dell Technologies – the umbrella organization that encompasses a raft of tech companies either developed or acquired by Dell, including VMware – may be acquired in a “reverse merger” by…. VMware.Neither Dell nor VMware are commenting publicly on a report from CNBC about the merger, but observers speculate that the commotion at Dell could be the result of a combination of factors: a decline in recent years in Dell PC sales, which had been the company’s core business; an enterprise IT trend away from server-stuffed on-premises data centers and toward use of public cloud services; a shift by giant public cloud services buyers away from out-of-the-box servers made by companies like Dell EMC and HPE in favor of cheaper, stripped-down custom servers from Asia; and a loss in storage market share by Dell EMC – EMC having been acquired by Dell in 2015 for $67 billion in 2015, the largest deal in tech industry history, a deal that included acquisition of 80 percent interest in VMware. There’s also the matter of Dell’s reported $50 billion in debt, due in part to the EMC purchase.Now the possible VMware acquisition of Dell could replace the EMC deal as the biggest tech deal ever. And because VMware, a $60 billion company, is publicly traded, a reverse merger would enable Dell to become a public company without going through the IPO exercise.“This makes perfect sense from a purely financial point of view,” said Patrick Moorhead, president and principal analyst at industry watcher Moor Insights & Strategy. “VMWare value has skyrocketed over the past few years, Dell Technologies owns the majority of VMWare, and that increased value is cheaper than debt. Dell Technologies has the chance to pay down a ton of debt. While I questioned VMWare’s ability at first to be neutral, their actions spoke for themselves and the company remained neutral. I don’t see why that would change in the future.”While Dell has experienced slowdowns in some market segments (PC’s, storage), VMware has seen continued growth in revenue, although at a slower pace. Sales expanded in 2016 by 6.7 percent, but that followed a half dozen double-digit growth years in a row. Net income reached a record high, $1.2 billion in 2016, and 2017 is expected to exceed that amount. VMware software provides a virtualized set of hardware to the guest operating system, enabling companies to run large systems more efficiently. The company, founded 20 years ago, also has had to adapt to the growth in the public cloud market. Two years ago, VMware enabled its products to run on AWS, bowing to more organizations moving all or some of their IT infrastructure off premises.According to the CNBC account, the board of advisers at Dell will meet in February to consider the VMware reverse merger, as well as other options. Because Dell went private five years ago, its precise valuation is unknown. If Dell becomes a public company, company owners could sell their shares on the public market and realize their Dell investment in 2013.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/dell_tech2-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/Vmware_logo-300x100.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/Pat-Gelsinger-VMware-300x173.png"
    ]
}