{
    "title": "Foresight for a Dawning Decade: The Heady Reality of AI’s ‘Chapter 2’",
    "author": "Doug Black",
    "date": "2019-12-20 00:00:00",
    "text": "One decade passes away, another decade comes – and it makes people think. For starters, we think about what to call the decade coming to end: the “twenty-teens”, “twenty-tens”? Awkward to refer to, it's harder to classify. The 1920s were \"Roaring,\" but how do you label a decade as polarized as our politics: globalism and nationalism, free trade and trade wars, prosperity and income inequality, recession (to start) and long bull market, Obama and Trump, world peace (generally) and “permanent wars.”The present is too much with us to gain perspective on what, if anything in particular, this decade will come to mean – other than the mishmash of counter-trends it appears to have been. But we'll hazard a guess anyway, at least from an enterprise IT viewpoint:The 2010s were a time of profound ferment in which AI-related technologies were firmly launched toward a central role in our work and personal lives, a decade when the “holy trinity” of HPC, big data and data analytics coalesced to form the foundation of the unfolding AI era, set to bloom in the 2020s.In short, it was a decade of transition to AI fruition. AI will hit stops and starts, of course, and some AI aspirations will be consigned to their own AI winters. But a big AI trend happening now is identifying where and how AI can be practically applied and where it can’t. Delusions of AI grandeur are maturing into real-world machine learning use cases.Take self-driving cars. As one wag said at the AI World conference two months ago, autonomous vehicles “is one of those technologies that will always be 10 years away.” Good line, but we already have modified, limited AV technology in operation, and billions invested in a lot more to come. If we don’t arrive at vehicular autonomy any time soon we can expect it to increasingly take hold in defined, rules-based environments – the daily commute to a suburban office park (it's already happening, illegally), or on interstate highways (one can imagine cars parading in lockstep in the passing lanes, with drivers taking control as the car approaches the exit ramp). But AV’s capable of taking you across Montana on local roads in a snowstorm or handling the madcap, bumper car style of driving in Boston and New York, that will take longer.This dichotomy – AI dreams versus AI reality – is a frequent theme among the dozens of 2020 predictions we've received from readers in recent weeks. For example, Pat Ryan, EVP of enterprise architecture at SPR, a digital tech consultancy in Chicago, predicts that “2020 will be more about bringing AI/machine learning (ML) into production than on AI/ML itself in many organizations.“The shiny luster of AI and ML will start to wear off as more companies realize that AI/ML is not a silver bullet to their business problems and certainly not magic – it’s math,” Ryan said. “Organizations now also know the need for high-quality data as the foundation for AI/ML, so come 2020, we’ll see a heightened sense of appreciation and need for data governance, data analysts, data engineers and ML engineers. With that, companies will create a data pipeline that continuously curates data for an A/B testing-capable ML pipeline to drive successful AI/ML projects in 2020.”In a similar vein, Monte Zweben, CEO of Splice Machine, made these practical points focused on IT staff management and implementation strategies:Looking ahead, Zweben said, “ML gets operationalized – companies adopt best practices to operationalize machine learning and go-live in production for mission-critical processes. Teams – silos are broken and multi-disciplinary teams emerge with data engineers, application developers, data scientists and subject-matter experts. Process – companies kill the data lake process and start focusing on applications. Tools – new tools to track data science workflow become the standard (e.g., MLFLow) and new comprehensive data platforms kill the Lambda architecture.”Operationalizing AI, what IBM’s Ginni Rometty and others refer to as “chapter two,” encompasses the intense pressure on AI laggards to catch up with competitors that have working AI implementation strategies. This struggle, said CognitiveScale CTO Matt Sanchez, is seen in the high AI project fail rate.“The term ‘AI First’ will be heard more and more as CIOs and chief digital officers start to move AI from the innovation lab into mainstream investments,” Sanchez said. “More than 90 percent of companies have invested in AI technologies, but almost 80 percent of AI projects stall due to lack of skills, talent and inability to trust the AI black box. 2020 will be the year trust and transparency will become top-of-mind for many Fortune 500 CEOs and boards. Also look for investors, regulators and legislators start to prioritize AI effectiveness in their assessment of corporate strategies and operations. Up until now, AI has been seen as an innovation project, but in 2020, it will be seen as either an asset or a liability, depending on how organizations transition to operationalize AI in their businesses.”Critical to AI effectiveness is hiring data scientists, those IT unicorns with kitchen sink skill sets and Himalayan salaries. Technology innovation moves toward livelihoods that are highly paid and hard to staff, a void addressed by the growth in data science automation tools, by AI consultancies and the “upskilling” of data analysts already on staff, aka, citizen data scientists. Steve Hill, principal, global head of innovation, at KPMG US, noted that the data science shortage is exacerbated by the high amount of AI skills absorbed hyperscalers and other tech giants.“(They) help fuel this battle for talent, representing a disproportionately high number of AI hires,” Hill said. “Over a 12-month period, 31 percent of all AI job postings came from a small group of tech companies. We expect the competition for technical talent to continue to heat up in the new year.”This will result, he said, in a “sizeable shift toward AI-as-a-Service (AIaaS). To rapidly pursue AI, many companies are looking to third-party AIaaS vendors. While embracing third parties does not eliminate the need to build up internal capabilities, it opens up more options.”Though he cited a KMPG survey of large global companies of which about two-thirds of AI spending is allocated to internal build – and only a third is dedicated to buying services from vendors, “we are already seeing signs that this investment mix is starting to shift and, by 2022, we expect many companies to devote over half of their AI spend to third-party services with managed services, microservices and bot stores being important trends to watch in this space.”How to address the skills scarcity was also taken up by John LaRocca, managing director, Europe/NA operations at AI provider Fractal, who said, “The demand for AI solutions will continue to outpace the availability of AI talent, and businesses will adapt by enabling more applications to be developed by non-AI professionals, resulting in the socialization of the process. Non-AI practitioners, such as knowledge workers and analysts, who are not skilled AI practitioners (but have great domain expertise), will start to develop rudimentary applications aided by automated AI engines.“The onus will be on corporate training programs to retrain/upskill these new practitioners and on IT to enable them with automated AI environments that use AI itself (e.g., machine learning apps to help develops train models without having to write code),” LaRocca said. “This is not unlike the historical lifecycle of analytics, and it will similarly benefit everyone in the ecosystem - businesses will expand their capacity to develop and benefit from AI apps, AI experts will be working on truly leading-edge applications and tie newly upskilled non-AI practitioners who will contribute more and have more marketable skills.”Another fundamental complexity standing in the way of successful AI adoption: data management. Jeff Clarke, Dell Technologies COO and Vice Chairman, said that in an era of exploding data volumes, the need is “to keep IT simple.”“We’ve got a lot of data on our hands…big data, meta data, structured and unstructured data – data living in clouds, in devices at the edge, in core data centers…it’s everywhere. But organizations are struggling to ensure the right data is moving to the right place at the right time. They lack data visibility – the ability for IT teams to quickly access and analyze the right data – because there are too many systems and services woven throughout their IT infrastructure. As we kick off 2020, CIOs will make data visibility a top IT imperative because after all, data is what makes the flywheel of innovation spin.“We’ll see organizations accelerate their digital transformation by simplifying and automating their IT infrastructure and consolidating systems and services into holistic solutions that enable more control and clarity,” Clarke said. “Consistency in architectures, orchestration and service agreements will open new doors for data management – and that ultimately gives data the ability to be used as part of AI and machine learning to fuel IT automation.  And all of that enables better, faster business outcomes that the innovation of the next decade will thrive on.”Alongside data management are other advanced IT strategic needs directly related to enterprise AI, capably summarized by Bob Moul, CEO of machine data intelligence platform Circonus.Addressing these issues weighs increasingly on senior IT planners struggling with data transformation, AI implementation and adoption of hybrid IT edge-core-cloud – IT strategies that will heavily impact their companies and their careers. As entrepreneur and investor Muddu Sudhakar observed, “It’s pretty well acknowledged these days that the role of the CIO has escaped the bonds of ‘keeping the lights on’ or ‘running IT systems’ labels. CIOs are now tasked with guiding IT growth and success as the technology landscape soars. Increasingly, that success path leads through the customer experience.“A CIO must now aggregate people, processes and technology to serve up that defining, five-star customer experience,” Sudhakar said. “Highly visible, and under steady pressure to get it right, CIOs are increasingly turning to AI and machine learning. Deloitte further validates this in its 2018 Global CIO Survey. Tellingly, Gartner predicts that by 2023, customers will prefer to use speech interfaces to initiate 70 percent of self-service customer interactions, rising from 40 percent today. There’s little question that AI and ML will play a pivotal role in improving customer experience and how businesses are digitally transforming.”To all whose futures include these challenges, we wish you a restorative holiday week and a successful 2020.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/Screen-Shot-2015-04-13-at-12.09.11-PM-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/02/connected-cars-645x403.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SPR-logo.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Splice-Machine-logo.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Cognitive_scale_logo.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/KPMG-logo.jpeg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/fractal-logo-2.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/Dell-Technologies-logo-416x416.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/circonus-logo.png"
    ]
}