{
    "title": "Storage Options Emerge For Mobile Data",
    "author": "George Leopold",
    "date": "2016-11-15 00:00:00",
    "text": "A range of object and software-defined storage options are emerging to tackle soaring data volumes driven by mobile devices at the network edge along with the movement of data among multiple clouds.For starters, the Hitachi Data Systems unit of Hitachi Ltd. (TSE: 6501) rolled out a new object storage platform on Tuesday (Nov. 15) that is billed as delivering data analytics and content search capabilities. Elsewhere, enterprise storage specialist Formation Data Systems released a storage security capability on its software-defined storage platform that among other things stresses data mobility functions.Hitachi's object storage platform adds a \"content intelligence\" element designed to aggregate growing volumes of structured and unstructured data. The company is positioning the storage platform as a data hub for managing data and enforcing increasingly strict data government rules along with new search and analytics capabilities.The Hitachi unit said more than 1,700 customers have adopted the object storage platform that also includes cloud-file gateway and file sync and share functionality. Among those customers is the U.S. National Archives and Record Administration, which is using the storage platform to digitize its vast collection into open file formats. Hitachi is providing project management and application development support for the National Archives project.Along with aggregating multi-structured data across different data stores and locations, the object storage platform can be deployed on-premises via bare-metal or virtual infrastructure as well as on public or private clouds, the company said. The storage platform also can scale to cluster sizes of more than 10,000 instances.Along with volume, data mobility is a growing issue for enterprise storage. That, in turn, is driving new datacenter storage features designed to manage cloud replication and data management along with data mobility.Among those storage offerings is the latest from Formation Data Systems, Fremont, Calif., which is pitching secure hybrid cloud connectivity to its existing software-defined storage platform. Released last week, the security link is designed to leverage data mobility and disaster recovery features in Amazon Web Services (NASDAQ: AMZN) Simple Storage Services (S3).Along with bi-directional replication and mobility in AWS and its own cloud domain, Formation Systems said its new security tool includes 256-bit encryption for data at rest or in transit. The result, the company asserts, is secure off-site data replication, backup and archiving as software-defined storage makes inroads in the datacenter.Formation Data said its secure link to AWS S3 is available in November.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}