{
    "title": "Lenovo Debuts Server-Based Storage Appliance",
    "author": "George Leopold",
    "date": "2017-03-14 00:00:00",
    "text": "Seeking to stimulate flagging server sales, a software-defined storage appliance from Lenovo leverages its server platform combined with a storage virtualization software and storage area networking from partner DataCore Software.Lenovo (HKSE: 992) said this week its storage appliance designated DX8200D leverages storage virtualization to wring optimum capacity from existing SAN arrays. The pre-integrated storage appliance is intended to simplify deployment and reduce management costs associated with software-defined storage.The storage appliance is based on Lenovo's System x3650 M5 server. Data security, replication, de-duplication, compression and other enterprise storage requirements are provided through a central interface.A growing list of datacenter and cloud players have introduced storage appliances over the last several years as they seek to help customers manage data growth while breaking the seemingly endless cycle of expanding heterogeneous storage infrastructure. Cloud vendors such as Microsoft (NASDAQ: MSFT) have introduced Azure storage appliances for expanding storage capacity and protecting data while meeting growing requirements for automation and storage scaling.Others such as storage leader EMC (which merged with Dell in 2016) also were early entrants in the storage appliance market. EMC launched an elastic cloud storage appliance in 2014 targeting the hyper-scale cloud storage infrastructure market. The appliance emerged from a research project known as \"Project Nile.\"More recently, the object storage startup OpenIO rolled out an object storage appliance based on its open source software and an ARM-based chassis.Lenovo touts its server-based approach as isolating storage devices sometimes spread over different locations and then combining them into a \"common set of enterprise-wide [storage] services,\" the company said Wednesday (March 14). As with other storage appliances, the DX8200D pools storage resources and manages incompatibilities among manufacturers, models and generations of equipment.Storage appliance vendors claim significant savings from various approaches. Lenovo is no different, claiming its scheme cuts storage costs by as much as 75 percent while slashing storage-related downtime in datacenters.\"Traditional storage offerings [from legacy vendors] often-times require compromises in performance, availability, reliability and functionality,\" asserted Radhika Krishnan, general manager for software-defined datacenters and networking in Lenovo's Data Center Group. The company argues that approach limits the ability to scale while increasing costs for power and cooling.DataCore Software, Fort Lauderdale, Fla., is the latest Lenovo storage partner. About this time last year, Lenovo announced a \"global strategic partnership\" with Juniper Networks designed to leverage each other's x86-based servers and network switches to augment their converged infrastructure and software-defined offerings. Lenovo said last March its customers would now be able to purchase Juniper (NYSE: JNPR) switches through the server vendor's sales channel.These and related efforts seek to take advantage of the \"disaggregation\" of hardware and software in datacenters, observers note, then provide greater automation to reduce hand-holding required for diverse storage technologies.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}