{
    "title": "Google Splits Difference with Nearline Storage",
    "text": "Google Cloud Platform's new archival storage offering called Nearline appears to target the same \"cold storage\" market eyed when Amazon Web Services (AWS) launched a similar service called Glacier in 2012.Nearline is described as Google Cloud Storage \"suitable for workloads traditionally filled by offline storage, such as cold storage and disaster recovery, but without the access penalties typically associated with offline storage solutions.\"The primary difference between the Google and AWS services, observers say, is that Nearline provides access times for old data comparable to online storage but at about the same cost as offline storage: about a penny or so per gigabyte per month.Google said its approach is optimized for high availability and low latency so it can deliver old data in about three seconds. By contrast, offline access to stored data can take several hours.Nearline storage \"provides the convenience of online storage at the price of offline storage,\" Google claimed in a recent white paper.\"Within the growing cloud computing market, cold storage services such as Nearline and Glacier will narrow the cost gap between pricier public (online) cloud services and cheaper private (offline) storage solutions,\" industry watcher Leo Sun of Motley Fool predicted in a recent assessment of the Google-AWS storage competition.Cold storage refers to simply archiving data that may be needed someday, or data that companies are legally obligated to retain.Google touts its Nearline approach as providing the convenience and availability of online storage with the affordability of offline storage. At least part of its secret sauce is that the APIs and tools currently used by businesses to manage online storage would not change using Nearline.\"No engineering effort needs to be spent learning new tools and processes,\" Google noted in the white paper. \"No code needs to be rewritten to use different APIs.\"As part of its Nearline storage service, Google also has created \"continental\" and \"regional\" storage bucket options that would allow users to control where data is stored. Continental storage options include the U.S., Europe and Asia. More granular regional storage allows customers to store data in a particular Google Compute Engine region.However, regional storage buckets won't be available until Nearline emerges from its \"beta\" phase, Google said. So far, Google hasn't said when it expects Nearline to become generally available with regional storage. In the meantime, it has released storage pricing information.These emerging storage options are expected to grow along with the enterprise shift toward hybrid cloud infrastructure in which older data can be placed in \"cold storage\" as a way of freeing up other enterprise storage resources.Moreover, Google is betting there's a market among cloud-based developers for fast online storage that costs about as much as offline. Hence, it touts Nearline as \"suitable for data that won’t be accessed frequently, but where there is value in having that data immediately available.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-03-23 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Archival Storage",
        "AWS",
        "cold storage",
        "Google",
        "Google Cloud Storage",
        "Nearline"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/archival-storage/",
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/cold-storage/",
        "https://www.enterpriseai.news/tag/google/",
        "https://www.enterpriseai.news/tag/google-cloud-storage/",
        "https://www.enterpriseai.news/tag/nearline/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-23-at-6.04.29-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}