{
    "title": "Machine Learning Day Highlights ISC’s AI Lineup",
    "text": "ISC, the major European conference for advanced scale computing to be held next week at the Messe Frankfurt conference center, will feature an extensive lineup of presentations, birds-of-a-feather discussions and panels on all things AI. A highlight of AI at ISC: Machine Learning Day, on Wednesday, June 19.Here’s a rundown on the dates, times and locations of sessions you may be interested in:Deep Learning at Scale – 9am-6pm, Matterhorn 2\nLed by three staff members of Lawrence Berkeley National Laboratory and Cray Inc.’s lead AI architect, this session will examine complex deep neural network models for solving increasingly challenging problems that involve larger datasets using HPC-class systems. The tutorial will look at core concepts, scientific applications and scaling techniques.GPU Bootcamp - A Collaborative Hands-on GPU Tutorial – 9am-6pm, Analog 2\nThis session is a tutorial for scientists and researchers on accelerating codes on GPUs, including an overview of GPU libraries, programming models and platforms, and GPU programming using OpenACC. The session will feature speakers from Nvidia and Jülich Supercomputing Centre.High Performance Distributed Deep Learning: A Beginner's Guide – 2pm-6pm, Effekt\nDeep learning frameworks like TensorFlow, PyTorch, Caffe and others are meant to ease deployment of deep neural networks. This tutorial is designed to provide an overview of trends in deep neural network design and hardware architectures. It will be led by a researchers from Ohio State University.Machine Learning and Emerging Technologies – 8:30-10am, Analog 1, 2\nThis is a series of three technical sessions covering quantum annealing processors, parallelized training of neural machine translation models and GPU performance prediction.Emerging File System Technologies and Use Cases for AI and HPC – 10:30-11:30am, Kontrast\nThis birds-of-a-feather discussion will look at best practices for flash-based storage and file-system technologies within HPC systems for data analytics, machine learning and AI. The session will feature speakers from the San Diego Supercomputer Center and WekaIO.Integration of HPC & AI – 11:30-12:30pm, Kontrast\nThis BoF session will focus on AI combined with HPC by researchers and industry to scale complex algorithms across thousands of nodes. The presenters will look at overcoming data scientists’ common unfamiliarity with the requirements of HPC environments, and will feature speakers from the Leibniz Supercomputing Centre, CERN openlab and Intel.Multi-Level Memory & Storage for HPC, Data Analytics & AI – 1:45-2:45pm, Kontrast\nThis BoF session will examine storage-class memory and workloads that mix HPC simulations with big data processing and AI. Session leaders include speakers from the Intel Datacenter Group, the Edinburgh Parallel Computing Centre and Lawrence Livermore National Laboratory.Industrial Day: Synergies of AI/ML and HPC in Industry – 1:45-3:15pm, Panorama 1\nIndustrial Day at ISC will feature three sessions on autonomous vehicles (AV) covering massively parallel testing of driving systems, AV development platforms for engineering and testing, a case study on deep learning for fluid flow prediction; a fourth session will look at data-driven discovery, the “fourth paradigm” of science, including examples in geospatial, materials science and turbulence modeling. Session leaders will include speakers from Spicetech GmbH, Friedrich-Alexander-University Erlangen-Nuremberg, CERFACS Toulouse, Uber Cloud and the U.S. National Center for Supercomputing Applications.Scalable Deep Learning for Industrial and Research Applications – 2:45-3:45pm, Kontrast\nThis BoF will focus on deep learning model development, deployment, infrastructure and hardware for businesses and research projects, technical challenges of implementing DL-based solutions and adding DL to data center operations and applications workflows. The session will be led by speakers from Dell EMC, the University of Pisa and SURFara.Industrial Day: AI goes Mainstream - Who cares about HPC? – 3:45-4:45pm, Panorama 1\nThis session will examine how HPC and AI work in combination for industrial workloads, whether HPC and AI can grow together and how HPC may change as AI becomes increasingly mainstream. This panel will be led by Andreas Wierse of SICOS BW GmbH.Artificial Intelligence and Performance – 3:45-4:45pm, Kontrast\nThis BoF will look at neural network-based machine learning and its expansion from vision, perception and natural language processing into complex scientific fields. The panel also will discuss optimizing end-to-end performance as AI applications outgrow single-node systems. The session will be led by speakers from the Intel Datacenter Group and Technische Universität Darmstadt.Machine Learning Day – 8:30-10am, Panorama 3\nMachine Learning Day at ISC will begin with a keynote from William Tang of Princeton University on deep learning and its use in fusion energy research, followed by another keynote at 9:15 from Azalia Mirhoseini of Google Brain, who will examine new techniques advancing machine learning training.Machine Learning Day: 11am-12:30pm, Panorama 3\nML Day continues with three life sciences presentations on deep learning bottlenecks on large-scale brain images, DL in computer-assisted medical interventions, and NLP and bioinformatics – “the language of life.” There will be a fourth presentation on Nvidia’s RAPIDS open source software libraries and conducting data science on GPUs. These sessions will be led by speakers from Fernuniversität Hagen, the German Cancer Research Center at the University of Heidelberg, Technische Universität München and Nvidia.Machine Learning Day: 1:45-3:15pm, Panorama 3\nThis portion of ML Day offers a case study on building large-scale ML systems for autonomous driving, optimizing and benchmarking large-scale deep learning and accelerating DL via adaptive deep reuse. The sessions will feature speakers from Fraunhofer ITWM, ETH Zurich and North Carolina State University.Machine Learning Day: 4-5pm, Panorama 3\nML Day concludes with two sessions, the first on pros and cons of AI and security that examines the attacking and weaponization of AI; the second will focus on cognitive simulation and the intersection of ML and scientific computing. The sessions will be presented by speakers from IBM Research and Lawrence Livermore National Laboratory.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2019-06-12 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "AI",
        "isc"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/isc/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/trade-show-conference-shutterstock_1066234574-370x290.jpg"
    ]
}