{
    "title": "Dell Releases Newest FluidFS Scale-Out NAS",
    "author": "Alison Diana",
    "date": "2015-04-07 00:00:00",
    "text": "Dell today (April 7) released the latest edition of Dell Fluid File System (FluidFS), its scale out network attached storage (NAS) solution.Version 4 – available now on the FS8600 with the Compellent platform and sometime later this year on EqualLogic – was designed to help customers manage the number and size of user files; support file-based workflows, and enable tighter integration with VMware. Customers can increase performance by expanding the cluster from one FS8600 appliance to up to four appliances with up to 494,000 max SPECsfs file OPS and 11.9 GB per second throughput, according to Dell. In addition, organizations can manage files of up to 16TB, increasing file storage capacity up to 4PB in one namespace; that's twice the capacity of the earlier iteration of FluidFS, the developer said.\"For Dell to be a full portfolio provider to the enterprise it's important to have a strong file offering. FluidFS represents the core of our file offering,\" Mike Davis, senior product manager for Storage Solutions at Dell, told Enterprise Technology.FluidFS Version 4's enhancements allow organizations to expand their NAS to increase performance simply by adding controllers or enhance storage capabilities by adding that capability, he said.\"We have a lot of customers whose performance requirements grow as their business grows,\" said Davis. \"If you have, all of a sudden, lots of demand pick up for the system and performance demands increase but they're all retrieving the same file, all you need to do is add controllers to the system you already have. If it turns out demand for your website is the same but you're storing more files – for a backup service like a Dropbox – then you don't need to grow performance; you just need to add storage on the backend. You only add what you need at the time. It's pay as you grow.\"The FS8600 with Fluid V4 uses Compellent Storage Center's features, such as automated tiering; thin provisioning; optimization for solid state disks; dense 84-disk SC280 enclosure, and Copilot support. Now available with 48GB of memory per controller – double the original offering – the FS8600 with Fluid V4 includes support for protocols like SMB 3, NFS 4/NFS 4.1, and IPv6 networking; tighter integration with VMware; directory level quotas; SACL-based auditing; file filtering, and data protection enhancements in replication and NDMP. With support for IPv6, for example, Dell can now more aggressively position this solution for the federal market, Davis said.Dell is targeting the FS8600 with Fluid V4 at both general businesses and vertical markets such as healthcare and life sciences, media and entertainment, and video surveillance. These markets, as well as big-data and the Internet of Things, use a lot of unstructured data and files, making them optimal users of NAS, said Davis.\"Any time you have more than a couple terabytes of data stored, you can assume it's file based and NAS is the applicable solution,\" he added.Organizations running VMware environments have the choice of storage area networks or NAS for their environments, said Davis.\"For a significant portion of the marketplace, they've decided NAS is an easier, more efficient way to deploy and manage,\" he said. \"There are some advantages in terms of disaster protection and so forth. We see 30 percent to 40 percent of the VMware market is deployed on a NAS product and it's an area Dell hasn't previously played in. VMware and Microsoft are our greatest partners and we've collaborated with them on a number of things.\"      Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/Compellent-FS8600-370x290.png",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}