{
    "title": "At SC18: Humanitarianism Amid Boom Times for HPC",
    "author": "Doug Black",
    "date": "2018-11-14 00:00:00",
    "text": "At SC18 in Dallas, the feeling on the ground is forward-looking and buoyant. Like boom times that cycle through the Texas oil patch, the HPC industry is enjoying a prosperity seen only every few decades, one driven by AI, IoT, cloud, HPDA and other advanced technologies that are opening up vast new TAMs for technology vendors.Confirming all this is Hyperion Research, the HPC industry watcher that held its annual market update breakfast at a downtown Dallas hotel. While 2018 is shaping up as a gangbuster year, the future looks bright, too, with the march toward exascale, quantum computing, the mainstreaming of new processor, memory and fabric architectures moving toward viability (here’s an account of Hyperion’s latest market numbers).Money – big money – is there for the making. But this industry also is about more than that. Significant work is being done driven not by the profit motive but by humanitarian concern, projects that leverage the power of HPC-driven machine learning and simulation/modeling to take on some of the biggest humanitarian challenges we face now and over the next decades: the global food security crisis, preventing the spread of epidemic disease and understanding the impact of environmental health on our rapidly growing urban centers.These projects were the focus at SC18 of a plenary session, “HPC and AI: Helping to Solve Humanity’s Grand Challenges,” hosted by Debra Goldfarb, Intel fellow, Data Center Group and chief analyst, Competitive Performance and Market Intelligence Group.Speaking with her about their projects were:Dr. Evan Fraser, director of Arrell Food Institute and Canada research chair in Global Food Security. He leads a $100 million program geared at developing the tools to promote the “digital agricultural revolution” that involves technologists, policy makers, economists, politicians and private industry.“Over the next two generations, we face an enormous human security challenge,” Fraser said. “We must adapt to rapid economic and climate change by creating a food system that provides adequate and appropriate nutrition for 9 billion people in a way that does not compromise the environment.”Robert S. Hart, Ph.D., VP of Global Good and GM of the Institute for Disease Modeling at Intellectual Ventures. IDM’s mission is to guide global efforts toward control of infectious disease through the quantitative analysis to build accurate disease forecasting models. IDM has grown from a project focused on malaria eradication to an independent center building new tools and strategies for disease control, the challenges of which are exacerbated by population migration, urbanization and globalization dynamics. A finding that the institute is working to leverage: many epidemic diseases are known to be sensitive to climate. It is critical we have the ability to build accurate disease forecasting models for prevention.Dr. Marguerite Nyhan, research scientist at United Nations Global Pulse, which is dedicated to harnessing big data for development and humanitarian action.  Her work is focused on data science to further the work of the organization, , particularly in the area of environmental health.Dr. Nyhan spoke on the challenges posed by urbanization and population growth dynamics to human health and safety. She said that new analytical models of the interrelationship between transportation, air quality and other environmental conditions enable development of more effective policies to mitigate impacts on vulnerable populations in urban centers around the world.To watch the plenary session, please go to:",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SC18-signage-at-SC17.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SC18-Plenary-1.png"
    ]
}