{
    "title": "HPE Reports Q3 Gains Along With Cloud Deal",
    "author": "George Leopold",
    "date": "2017-09-06 00:00:00",
    "text": "Hewlett Packard Enterprise reported better-than-expected earnings for its third quarter ending July 31 despite what it described as continued \"commodities cost pressures\" related to tighter memory supplies for servers. It also announced a cloud acquisition.The hybrid IT specialist also reported unexpected gains in its server business as it \"pivots\" beyond the datacenter to greener pastures such as HPC while mapping its strategy in the emerging all-flash storage market.CEO Meg Whitman also addressed reports she was in the running to head the ride-share service Uber, acknowledging interest in the position but declaring she would remain as head of HPE.The company reported third quarter revenues totaling $8.21 billion, ahead of analysts' estimate of about $ $7.5 billion. The company (NYSE: HPE) also exceeded its earnings-per-share target while operating margins rose sequentially.The results also reflect completion of the \"spin-merge\" of its enterprise software business to U.K. vendor Micro Focus. HPE stock jumped 5 percent in response to the quarterly results, and is up 3 percent since the beginning of the year.As it exits the application software business to focus on systems software used in datacenters and cloud deployments, Whitman said future acquisitions in area such as storage would focus on \"organic growth.\" To that end, the company announced earlier in the day it is acquiring the consulting firm Cloud Technology Partners.Founded in 2010, the \"cloud agnostic\" consulting firm helps customers determine the appropriate environment for running specific workloads. Whitman said the acquisition strengthens HPE's \"hybrid IT\" approach that spans datacenters, public and private clouds as well as systems software.Asked whether the service would draw customers away from its on-premises IT services to public clouds, Whitman replied. \"We will add our expertise with [on-premises] private cloud\" and the acquisition is \"an opportunity to scale that practice.\" She added: \"There are some workloads that customers probably should move to a public cloud. Microsoft (NASDAQ: MSFT) Azure is HPE public cloud partner.Whitman and Tim Stonesifer, HPE's chief financial officer, made frequent references to the impact of what Stonesifer called \"ongoing commodities pressure\" related to tight supplies of DRAMs used in servers.\"We continue to see commodities pressure,\" Stonesifer noted, adding that the company expects rising memory prices at least through the end of this year. HPE reportedly plans to raise its server memory prices by 20 percent in response to accelerating adoption of higher density memory modules. Tightening supplies for server memories also is being driven by increased for DDR4 memory modules as new platforms such as Intel's (NASDAQ: INTC) Skylake-SP, or \"Purley\" are introduced.As DRAM supplies tighten, memory prices have risen between 5 and 10 percent. \"We'll see what happens with commodity prices,\" Whitman said.Meanwhile, HPE's overall server business grew during the third quarter, and its expects to gain market share in its core datacenter business while \"pivoting\" to higher-end markets such as HPC.\"We are cautiously optimistic about our server business,\" Whitman added, especially with blade and next-generation servers \"with security built into servers at the chip level.\"In the competitive storage business, HPE touts the introduction of all-flash arrays in its 3Par storage line along with its recent acquisition of all- and hybrid flash array provider Nimble Storage. Competitors such Dell EMC also are rolling out all-flash storage options while targeting their existing customer bases. \"We have to go mine our installed base\" as competitors have, Whitman said. \"This is a fundamental [technology] in the datacenter.\"As for her dalliance with Uber, Whitman said: \"In the end, it wasn't the right thing,\" adding, \"I actually am not going anywhere.\" George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/Screen-Shot-2017-09-06-at-11.01.10-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}