{
    "title": "SolidFire Aims Lower With All-Flash Arrays, Raises Cash",
    "text": "All-flash array upstart SolidFire, which was founded by a team of techies with expertise in online gaming, cloud computing, and enterprise storage, is launching smaller-scale versions of its eponymous arrays aimed at lowering the entry capacity and price point for prospective customers. At the same time, the company is announcing another big cash infusion to fuel its growth.Like many modern storage arrays, the SolidFire System, as the array is called, is based on a two-socket Xeon server, in this case, one built for SolidFire by the custom server division of Dell. The machine comes in a 1U chassis and has ten 2.5-inch bays for flash drives, which SolidFire sources from both Intel and Samsung Electronics. While SolidFire does not like the terms consumer or enterprise when applied to multi-level cell (MLC) flash, the company does not use eMLC, which has over provisioning built into the product because the perception is that such extra capacity is necessary to ensure a heavy enough duty cycle for enterprise uses. But SolidFire and other flash array upstarts have proven that with the right data placement and management techniques in the controller software, consumer flash is perfectly fine as storage media for enterprise workloads.\"Many companies are using flash to solve specific application problems,\" explains Jay Prassl, vice president of marketing at SolidFire, to EnterpriseTech. \"But they also want to scale out their flash once they deploy it to accelerate an Oracle database or a VDI setup.\"Up until now, the base SolidFire array was based on a node called the SF9010, which used 960 GB drives and which delivered an effective capacity of 35 TB after reserving lots of flash for wear-leveling as the flash ages. A base machine has four of these such nodes clustered together using 10 Gb/sec Ethernet links between the nodes. With 4:1 data reduction with inline compression and deduplication, the effective capacity of a four-node SF9010 base machine is on the order of 140 TB of effective capacity and delivers somewhere on the order of 300,000 I/O operations per second.Prassl says that in an entry configuration of the SF9010 with half the bays filled and delivering about 60 TB of effective capacity, the cost was on the order of $200,000 to $250,000. That is a little rich for some customers, particularly those who are still thinking of all-flash arrays as accelerating pin-point applications within their organizations. And to that end, SolidFire is scaling down its product line and its pricing to give customers a better starting point that they can then grow from as they add nodes to their flash array clusters.SolidFire had scaled down its product line before, with the SF3010 and SF6010 arrays, but the company has gone back and trimmed the memory and clock speeds on the controllers and also dialed back the capacity on the SSDs in the units to get the price point of an entry array with 35 TB of usable capacity and delivering 200,000 IOPS of throughput to below $100,000 or below $25,000 for each of the four nodes in a base system.Unlike many all-flash arrays, clustering of storage nodes for performance and capacity scalability was built into the SolidFire design from the get-go. More importantly, SolidFire does not have a concept of a separate controller (or pair of controllers) that have some storage and then have adjunct storage shelves added to them to expand the flash capacity. Each 1U enclosure in a SolidFire cluster has its own compute, and therefore, customers can scale up controller compute capacity and cache memory linearly with capacity. The SolidFire array can scale out to 100 nodes, which provides 3.4 PB of aggregate usable capacity and 7.5 million IOPS of data movement in a single system.The idea is to always have enough compute capacity across the nodes to provide various data services, with deduplication and compression being the two important ones because it is these that help bring the cost of flash down to something akin to what companies are paying for disk arrays that generally do not have very effective inline compression or deduplication. With these data reduction features and assuming only a 4:1 reduction with both dedupe and compression, SolidFire can get the array price to down below $3 per gigabyte of effective capacity. That is less than the 6:1 that many vendors claim when they do their pricing, and it is also less than the 7:1 to 9:1 ratios that Prassl says real-world SolidFire customers are seeing in the field in some cases. SolidFire wants to be conservative in the data reduction ratios so as to not oversell the cost per capacity.The entry SF2405 node from SolidFire is based on a two-socket server using Intel's Xeon \"Ivy Bridge\" E5-2620 v2 processor. The nodes have 64 GB of main memory that is used to run the SolidFire storage operating system and to act as read cache for the node. All SolidFire nodes have 8 GB of non-volatile DRAM that is used as a write cache and two 10 Gb/sec Ethernet ports with iSCSI drivers. Servers see the cluster as a single block storage device with iSCSI drivers.The SF4805 node uses the same 2.1 GHz Xeon E5-2620 v2 processor and has 128 GB of memory on the node for the storage operating system and write cache. This is slightly less write cache than is on the existing SF6010 array, which also, like the SF3010, was based on a six-core \"Sandy Bridge\" Xeon E5-2640 v1 processor cycling at a slightly faster 2.5 GHz. (Both of these Xeon chips used in the SolidFire nodes have 15 MB of on-chip L3 cache.) It is not at all clear if there is any substantial performance differences between the old SF3010 and SF6010 nodes and the new SF4805 nodes, but what Prassl did confirm is that the SF405 with its 480 GB SSD drives would have would have 40 percent more effective capacity per node (17 TB versus 12 TB for the SF3010) at a 30 percent lower cost. Each SF4805 node in the base four-node cluster delivers 50,000 IOPS. Prassl says that the SF4805 will deliver the most capacity for the dollar among the five current machines in its line.The SF9010 remains the top-end node and delivers 35 TB of effective capacity and 75,000 IOPS per node. And again, customers who have one kind of node can plug in beefier or skinnier nodes and the cluster will still present it all as a single, large block device to servers. The storage does not have to be stopped and reconfigured in any way as nodes are added. The flash in the new node is just added to the pool and data is moved automatically to it.The flexibility and scalability of the SolidFire arrays is something that the company believes gives it real competitive advantage. Other all-flash arrays do not, says Prassl, have the same kind of scale out across 100 nodes. But some of the data needs to be updated in the chart above. NetApp, for instance, has a cluster configuration of its FAS8080 EX that can span up to a dozen redundant controllers and sport up to 4.6 PB of flash and deliver an aggregate of 4 million IOPS.The new machines represent the third generation of hardware coming out of SolidFire since it launched its products in November 2012, three years after the company was founded by David Wright. Among many other things, Wright was the brains behind GameSpy Industries, a company he founded in 1998 after graduating from Stanford University that built back-end infrastructure for thousands of online games. Wright was also the founder in 2007 of a cloud storage company called Jungle Disk, which was acquired by Rackspace Hosting in 2008 before it had started up the OpenStack cloud controller project with NASA.SolidFire is still privately held but the company wants to talk a little bit about its growth because that is good for business. In 2013, says Prassl, SolidFire's revenues exploded by 700 percent (that is a factor of 8X remember, not 7X), and thus far in the first three quarters of 2014 sales have increased by 50 percent quarter on quarter. SolidFire is trying to be clever and not give comparative figures, but that is another way of saying that over the course of four quarters in 2014, if growth persists then revenues will at least triple and probably close to quadruple. The net result is that revenues in 2014 should be at least a factor of 25X higher than in 2012, when the company had barely started shipping products. The 2012 to 2013 figures are not apples-to-apples because SolidFire only shipped products for two months in 2012, so it is not at all surprising that growth was up by a factor of 8X in 2013 considering the growing appetite for all-flash arrays. The fact that the business will more than triple this year is more significant because this is actually accelerating growth when you normalize for a full twelve months for 2012.This accelerating growth is no doubt one of the reasons why SolidFire has been able to bag $82 million in Series D funding. Greenspring Associates, which is new to SolidFire investing, led the round along with a \"major sovereign wealth fund\" that was unnamed. Current investors NEA, Novak Biddle, Samsung Ventures, and Valhalla Partners all kicked in some of that $82 million in dough in this fourth round. To date, SolidFire has raised $150 million in its five rounds of funding (one seed round and four venture rounds). SolidFire does not talk about its customer base by the numbers, but Prassl says that online auctioneer eBay and hosting services provider Colt both have multi-million dollar SolidFire installations. In the most recent two quarters, the company has expanded from its initial service provider customer base and now has an even split between service providers and enterprise accounts, says Prassl. The company has increased its headcount from 100 to 250 so far in 2014 and is seeking to add another 30 employees right now, and now has 60 reseller and four distribution partners helping to push its products.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-10-07 00:00:00",
    "cats": [
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "array",
        "Flash",
        "SolidFire",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/array/",
        "https://www.enterpriseai.news/tag/flash/",
        "https://www.enterpriseai.news/tag/solidfire/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/solidfire-logo.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/solidfire-array-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/solidfire-array-evolution.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/solidfire-array-scale.jpg"
    ]
}