{
    "title": "Turnaround Complete, HPE’s Whitman Departs",
    "text": "Having turned around the aircraft carrier the Silicon Valley icon had become, Meg Whitman is leaving the helm of a restructured Hewlett Packard. Her successor, technologist Antonio Neri will now guide what Whitman asserts is a more \"nimble\" company through the uncharted waters of unrelenting change and hyper-scale disruption.Whitman, 61, announced Wednesday (Nov. 21) she is resigning as CEO of Hewlett Packard Enterprise. She will remain on HPE's board of directors. Neri will succeed Whitman early next year.Given Whitman's recent acknowledgement of interest in heading the ride-sharing outfit Uber, her departure is abrupt but not unexpected.Acknowledging her abiding interest in \"disruptive\" startups going back to her days at eBay, Whitman said in September that the timing of the Uber search was off and \"in the end that wasn’t the right thing.\" (By contrast, Whitman's timing was perfect: Uber this week admitted it concealed a massive hack exposing the personal data of 57 million riders and drivers.)\"I have dedicated the last six years of my life to this company and there is more work to do and I am here to help make this company successful and I am excited about the new strategy. So, lots more work to do and I actually am not going anywhere,\" she said in response to a query from Toni Sacconaghi, an analyst with Sanford C. Bernstein.In fact, Whitman was contemplating her departure.As HPE struggles to make the move from traditional IT hardware manufacturer to a provider of hybrid IT such as software-defined datacenters, edge computing and networking equipment (e.g., Internet of Things), Whitman asserted Tuesday, \"The next CEO of this company needs to be a deeper technologist, and that's exactly what Antonio is.\" Neri, who currently serves as HPE's president, will become CEO on Feb. 1.Whitman's accomplishment was reorienting a conglomerate that was only getting bigger through disastrous moves like its 2011 acquisition U.K. software vendor Autonomy. The result of Whitman's financial reorganization is a stable IT vendor capable of competing against rivals like Cisco Systems (NASDAQ: CSCO) and IBM (NYSE: IBM) that are facing the same competitive pressures.Whitman took credit this week for making HPE \"far more nimble, far more agile.\"Neri, an engineer by training, has been with Hewlett Packard for 22 years. \"Antonio is going to lead the next phase of value creation,\" Whitman asserted during a conference call with analysts.Neri has lately assumed a higher profile in spearheading acquisitions and cloud collaborations. For example, he announced a partnership with Rackspace earlier this month to offer an OpenStack private cloud service running on \"pay-per-use\" infrastructure.Meanwhile, company watchers reckoned HPE had a decent fourth quarter, expanding at a 5-percent clip. All-flash arrays were up 16 percent and networking equipment sales rose a healthy 21 percent over the same period last year. Server sales continued their steady decline, down 5 percent year-on-year. \"HPE has gotten lean and mean and now the company needs to drive growth. This is what everyone is looking for,\" noted technology analyst Patrick Moorhead.HPE's stock (NYSE: HPE) dropped more than one percent in reaction to Whitman's departure.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-11-22 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Networks",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "Antonio Neri",
        "cloud",
        "datacenters",
        "HPE",
        "hybrid IT",
        "Meg Whitman"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/antonio-neri/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/datacenters/",
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/hybrid-it/",
        "https://www.enterpriseai.news/tag/meg-whitman/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/Meg-Whitman-photo-v2-1940x1268-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/Screen-Shot-2017-11-22-at-11.39.02-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}