{
    "title": "Pure Storage, EMC, And IBM Lead The All-Flash Array Pack",
    "text": "All-flash storage arrays have come of age, and are increasingly being used to replace all-disk and hybrid flash-disk arrays for the tier one storage that underpins applications and databases in the datacenters of the world. This is what all of the major vendors are seeing happening, and it is also the view from the analysts at Gartner, who have just released their first-ever Magic Quadrant report on all-flash arrays.The Magic Quadrant is a patented Gartner means of ranking competitors in any particular technology, weighing who are the niche players, visionaries, challengers, and leaders and ranking them by their ability to execute and the completeness of their vision. Vendors are ranking on a scatter graph and it is very desirable to be in the upper right quadrant where a vendor is considered a leader with both a complete vision and the ability to execute on that vision. The fact that Gartner has put out a Magic Quadrant on all-flash arrays shows that the technology has come of age. It also shows that the big incumbents in the disk array market have their hands full coping with a slew of upstarts, even after many have made strategic acquisitions to accelerate their moves into flash arrays.For the purposes of the report, Gartner does not consider a disk array design that is equipped with solid state drives (SSDs) based on flash memory as an all-flash array. If you can put a disk drive into an array, Gartner does not consider it an all-flash array. In most cases, says Gartner, the solid state arrays, or SSAs as it calls them, have an operating system and accompanying data management software (including deduplication, compression, replication, snapshotting, and so on) that has been tuned specifically for flash technologies. Some are however based on tweaked disk controllers that have been re-engineered for flash and are sold as separate products.In the SSA Magic Quadrant report, which was released just before the Labor Day holiday, Gartner makes a few projections before getting down to the rankings. First, between 2014 and 2017, the revenue in the SSA market is expected to quintuple, which is why there is so much venture capital going into flash-based array upstarts these days. By 2017, the company expects that the number of vendors and products in the SSA market will increase by 50 percent, but that 20 percent of the current players will exit the market. (It is not clear if this will be by running out of money or by being acquired.) By 2019, Gartner is projecting that 20 percent of high-end storage arrays, either all-disk or hybrid disk-flash machines, will be replaced by SSAs. (You can get a copy of the full Gartner report compliments of Pure Storage, which has licensed it for distribution.)Here is how Gartner ranks the major SSA players:Not every vendor or all-flash array made the cut, and Gartner listed a bunch of products that warrant investigation by customers. These include Dell Compellent, EMC VMAX, Fujitsu Eternus DX200F, SanDisk Fusion-io ION, Hitachi Unified Storage, IBM DS8000, NetApp FAS, Oracle ZFS, and Tegile T-Series arrays.Obviously, EMC, Pure Storage, and IBM are perceived as being out ahead of the pack. EMC and IBM have gained their positions in the all-flash array market through acquisitions – XtremIO in the case of EMC and Texas Memory Systems in the case of IBM – and have reworked the acquired products to make them more suitable for their enterprise customers in the ensuing time. IBM has married its SAN Virtualization Controller to the FlashSystem 840 arrays to give it data management features it was lacking, and EMC has added similar features to the XtremIO arrays.Pure Storage was founded in 2009 and has raised $474.9 million in a mix of venture and private equity funding since that time; it has a market valuation of more than $3 billion and is in no big hurry to do an initial public offering. The company shipped its first all-flash array two years ago, and according to Matt Kixmoeller, who spoke to EnterpriseTech at the VMworld conference last week and who is vice president of products at the company, the deals for all flash arrays are getting bigger as the devices become more normal. With more than half of that money still in the bank, Pure Storage has the dough to fund its growth, which has been around 50 percent per quarter sequentially for those two years. The company boosted revenues by a factor of 8X in 2013, in fact. The company now has 650 employees and leads about 40 percent of its sales through the channel and does 98 percent of its fulfillment through the channel.In the beginning, Pure Storage was accelerating one application, maybe a database and some backup, and spanning maybe 30 TB to 50 TB of capacity. But enterprise customers have thousands of applications that span from hundreds of terabytes to petabytes of capacity. This will be the engine for the hockey stick of sales among all flash array providers and it is why so many people want to invest in the flash array makers. At the moment, the key workloads where Pure Storage is seeing uptake is to accelerate the I/O performance for relational databases, virtual desktop infrastructure (VDI), and virtual server infrastructure and clouds. Last year, these three categories represented roughly a third of revenues each for its FlashArray line, according to Kixmoeller. The database acceleration part of the business could grow to represent half of the revenue pie this year, he tells EnterpriseTech, because the problem is most acute here and companies don't want to trade out their relational databases to use alternate technologies.\"We are in the Hadoop avoidance game, and we help people avoid Exadata and other appliances,\" explains Kixmoeller. \"These Hadoop products and other analytics databases actually curtail the kinds of queries that companies can run.\"The reason why so many companies are banking on all-flash arrays is simply that disk technology is not progressing. Spindles are stuck spinning at 15K RPM and I/O bandwidth coming off drives is not improving. But every year, the disks get fatter – Seagate just shipped an 8 TB drive – and the performance per terabyte keeps getting worse and worse. \"Every year, the number of applications that can stay on disks does down,\" says Kixmoeller.Pure Storage has a number of customers who have broken through the petabyte barrier with its FlashArrays, including business networker LinkedIn and online human resources application provider Workday. LinkedIn uses Pure Storage arrays as tier one storage in its infrastructure, while Workday uses them to accelerate the search functions on its online applications.Where Pure Storage is leading, all of the other upstarts and all of the incumbents in the disk array market are sure to follow. All flash arrays may only constitute a $667 million business today, but it grew at 182 percent last year (that is nearly triple sales in 2012) and there is a $15 billion tier one storage business in play and lots of room for growth and many players.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2014-09-02 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash",
        "array",
        "EMC",
        "FlashArray",
        "FlashSystem",
        "Gartner",
        "IBM",
        "Pure Storage",
        "XtremIO"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash/",
        "https://www.enterpriseai.news/tag/array/",
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/flasharray/",
        "https://www.enterpriseai.news/tag/flashsystem/",
        "https://www.enterpriseai.news/tag/gartner/",
        "https://www.enterpriseai.news/tag/ibm/",
        "https://www.enterpriseai.news/tag/pure-storage/",
        "https://www.enterpriseai.news/tag/xtremio/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/pure-storage-logo.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/gartner-all-flash-array-mq.jpg"
    ]
}