{
    "title": "Avere Systems Adds Google as Investor",
    "author": "George Leopold",
    "date": "2017-03-22 00:00:00",
    "text": "Avere Systems, the hybrid cloud data storage and management vendor, announced its latest funding round this week that included new investor Google Inc.The $14 million Series E round included existing investors Lightspeed Venture Partners, Menlo Ventures, Norwest Venture Partners, Tenaya Capital and Western Digital Capital. Avere has so far raised $97 million, and said Tuesday (March 21) it would used the latest cash infusion to expand its hybrid cloud offerings as more enterprises shift to public clouds.The Pittsburgh-based vendor's scalable cloud storage platform dubbed FXT Edge Filers targets enterprises trying to integrate applications requiring file systems into the cloud. Along with data storage access, the platform helps scale computing and storage depending on application requirements.The company claimed cloud customers accounted for nearly half its bookings in 2016, helping to nearly double the growth of its cloud business on an annual basis. That has expanded Avere System's customer base to include financial services customers along with media and entertainment as well as healthcare and manufacturers.The addition of Google (NASDAQ: GOOGL) as an investor comes as the public cloud vendor is seeking to differentiate its offerings in the cutthroat public cloud market. Recent moves have included expanded support for Windows Server on the Google Compute Engine as well as the introduction of custom Intel Xeon chips to boost cloud performance.Meanwhile, Avere Systems has also announced partnerships with private cloud storage vendors. In February, the company announced support for Dell EMC's (NYSE: DVMT) Elastic Cloud Storage platform. The partners said the software-defined object storage approach would allow private cloud customers to consolidate content archives and file storage systems in a central repository.The combination lets Dell EMC customers use the Avere Systems file storage platform and accompanying operating system to move stored data between network-attached and object storage resources, including \"bi-directional translation of object APIs to NAS protocols,\" they noted.The partners are betting that the influx of unstructured data will continue to drive requirements for object storage while eliminating the need to rewrite existing enterprise applications to support new interfaces.Among the industry sectors struggling to cope with the rise of unstructured data is financial services. Those requirements are driving hybrid cloud offerings from Avere Systems and other vendors.\"Inevitably, you’ll get faster servers over time, but it seems to me the demand profile will only increase, and the sophistication of the [financial] models is only going to increase, and certainly the data available to process from diverse sources is only going to increase,\" Scott Jeschonek, Avere System's director of cloud products, noted during a recent company webinar.\"Not only that but if you’re a large enough firm you probably have multiple sites [based in] Europe, Asia/Pacific, looking to consume all that.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}