{
    "title": "Amazon Pulls Plug on Oracle Databases",
    "text": "Amazon Web Services declared victory in its latest skirmish with cloud rival and database leader Oracle, announcing this week it has completed the migration of its consumer business to its internal database services while pulling the plug on its final Oracle database.The migration announced Tuesday (Oct. 15) completes the lift and shift of 75 petabytes of internal data stored in nearly 7,500 Oracle databases to multiple Amazon database services. They include its Aurora, DynamoDB, Redshift and the cloud giant’s Relational Database Service.Jeff Barr, Amazon’s chief evangelist, used the milestone to return fire at Oracle, who’s brash co-founder, executive chairman and CTO Larry Ellison has for example claimed its cloud platform was 100 times faster for database analytics than Amazon Redshift.“Over the years we realized that we were spending too much time managing and scaling thousands of legacy Oracle databases,” Barr noted in a blog post. “Instead of focusing on high-value differentiated work, our database administrators spent a lot of time simply keeping the lights on while transaction rates climbed and the overall amount of stored data mounted.”Ellison has boasted that Amazon (NASDAQ: AMZN) was paying Oracle (NYSE: ORCL) $60 million annually for database support and licensing fees—proof Ellison asserted that Amazon’s own database services weren’t up to the task of shifting its operations to the cloud.Barr countered this week that Amazon administrators spent much time “dealing with complex and inefficient hardware provisioning, license management and many other issues that are now best handled by modern, managed database services.”Amazon said the migration included its consumer services, including Alexa, Prime Video, Twitch and Zappos, along with backend fulfillment and transaction services. Those services have been moved to AWS relational, graph and in-memory databased along with key-value stores, in-memory platforms and data warehouses.Along with reducing latency on consumer applications by 40 percent, Barr claimed the migration reduces Amazon’s database costs by more than 60 percent, a metric along with its sheer scale that Amazon claims could save current database customers 90 percent when switching from Oracle to Amazon platforms.In response, Oracle has been restructuring its operations by laying off workers in its legacy sectors while beefing up its cloud operations. In an effort to keep up with cloud leaders AWS and Microsoft (NYSE: ORCL), Oracle announced it was adding about 2,000 new employees to its cloud database operations. During the summer, it began a reorganization by laying off workers in its flash storage and other on-premise units.Oracle, Amazon, IBM (NYSE: IBM) and others are jockeying to dominate a global cloud database market recently pegged at more than $2 billion. According to market forecast released this week by Report Consultant, the cloud database market is forecast to approach $69 billion by 2027.Hence, it’s a good bet the war of words between Amazon and Oracle will continue as more enterprises shift databases to the cloud.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-10-17 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Amazon",
        "Amazon Redshift",
        "AWS",
        "cloud databases",
        "Jeff Barr",
        "Larry Ellison",
        "Oracle"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/amazon/",
        "https://www.enterpriseai.news/tag/amazon-redshift/",
        "https://www.enterpriseai.news/tag/aws/",
        "https://www.enterpriseai.news/tag/cloud-databases/",
        "https://www.enterpriseai.news/tag/jeff-barr/",
        "https://www.enterpriseai.news/tag/larry-ellison/",
        "https://www.enterpriseai.news/tag/oracle/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/database-cloud-logo-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}