{
    "title": "EMC, Mesosphere Collaborate on Datacenter Storage",
    "text": "Mesosphere, the datacenter operating system specialist, is teaming with federated storage leader EMC Corp. to expand datacenter storage options within Apaches Mesos cluster management architectures.Mesosphere said Thursday (Oct. 8) its collaboration with EMC (NYSE: EMC) means its datacenter operating system (DCOS) would support storage platforms such as EMC's ScaleIO, OpenStack Cinder, Amazon Web Services (AMZN) Elastic Block Storage and others. The storage partnership was announced at a Mesosphere event in Dublin, Ireland.The partners said they expect the collaboration to help drive external storage into expanded use cases for Apache Mesos, which has emerged as a preferred platform for operations teams and cloud-native application developers. The partners said the deal would allow developers to leverage external storage resources during the development and lifecycle maintenance of distributed applications.The collaboration includes participation from EMC{code}, the storage leader's team of open source developers.With cloud-native applications moving center stage, the partners argued that the requirements on data inside of applications have dramatically increased in scale and complexity. Hence, the partners said they jointly developed a \"Docker Volume Driver Interface Isolation Module\" that allows existing volume drivers for application containers to interoperate with the Mesos open source cluster manager. Apache Mesos is designed to handle resource isolation and sharing across distributed applications.Docker containers running in multitenant environments previously lacked the necessary isolation, a security feature that prevents one application from “seeing” another. Hence, the isolation feature is seen as increasingly important for moving Docker application containers into production environments, industry experts stress.Mesosphere and EMC also said they have jointly developed a new Docker Volume Driver CLI, or dvd-cli, that leverages the existing Docker code base to improve compatibility with the volume driver interface. The upshot is that existing volume plugins that work for Docker also will run natively with Mesos frameworks or agents, the partners said.Current distributed applications and frameworks rely on resources drawn from direct attached storage. The partners asserted that external volume support would extend the ability of a Mesos agent to use external or network-attached storage. It also means Mesosphere's DCOS could be extended by opening storage platforms to Apache Mesos, reducing management complexity for external storage and allowing developers to specify new volumes for each task.Combining existing Mesos frameworks with external volume support \"enables persistent container solutions from companies like EMC for Mesos and DCOS frameworks,\" Ben Hindman, co-creator of Apache Mesos and chief architect at Mesosphere, noted in a statement.The partners also said their goal is to make storage a \"first class citizen\" within Mesos by \"pooling datacenter and cloud resources to appear as a single computer abstraction.\" Added Josh Bernstein, vice president in EMC’s Emerging Technologies Division: the collaboration \"will continue to drive storage into the datacenter operating system and distributed application space.\"Mesosphere's collaboration with EMC comes amid reports that the storage vendor is in advanced merger talks with Dell. EMC's federated structure includes enterprise software developer Pivotal Labs and a majority stake in VMware.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-10-08 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Apache Mesos",
        "cluster management",
        "datacenter storage",
        "distributed applications",
        "Docker containers",
        "EMC",
        "Mesosphere"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/apache-mesos/",
        "https://www.enterpriseai.news/tag/cluster-management/",
        "https://www.enterpriseai.news/tag/datacenter-storage/",
        "https://www.enterpriseai.news/tag/distributed-applications/",
        "https://www.enterpriseai.news/tag/docker-containers/",
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/mesosphere/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/08/datacenter_graphic1.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}