{
    "title": "Red Hat Boosts Storage Capabilities With Inktank Deal",
    "text": "Red Hat is getting serious about storage and has snapped up Inktank, whose Ceph Enterprise technology provides file system, object and block storage software deployed by enterprises in public and private clouds. The software is increasingly paired with OpenStack, the cloud controller that Red Hat has put its significant weight behind.The deal builds on the earlier acquisition of clustered file system maker Gluster, giving Red Hat another leg up in the growing file and object segment of open source software-defined storage market.Red Hat said it would acquire privately held Inktank for approximately $175 million in cash. Red Hat will also assume outstanding Inktank equity along with company executives' equity incentives. The deal is expected to close in May.Inktank was founded in 2012 by Sage Weil, who also serves as Inktank's chief technology officer. Weil helped develop Ceph distributed storage as a scalable software-defined technology to replace legacy storage systems as enterprises move to cloud computing environments. The startup's goal was to help customers scale storage to without breaking the bank.Inktank said its customers include Cisco Systems, the European Organization for Nuclear Research (CERN), Deutsche Telekom, and Bloomberg. The company has about 50 employees.Red Hat CTO Brian Stevens attributed the deal to Inktank's success in building an ecosystem around the Ceph file system and its object and block storage. The partners project that data storage on Ceph systems will grow ten-fold by the end of 2014. The deal makes Red Hat the leader in OpenStack storage, Stevens claimed during a webcast. He estimated that 17 percent of OpenStack users are Ceph customers.\"Ceph will always be an open project,\" Weil stressed.In a blog post, Weil added that the acquisition will alter Inktank's product strategy by making proprietary software like its Calimari monitoring and diagnostics tool an open source offering. Weil offered no timeline for when that will happen.Red Hat acquired another open software storage vendor, Gluster, in October 2011 as the enterprise shift to software-defined storage was gaining momentum. Gluster focused on open storage approaches to standardize management of unstructured data based on a \"scale-out\" storage approach. Basically, Gluster turns a rack of commodity X86 servers into a very fast NAS filer that supports NFS and CIFS protocols.The Gluster deal also provided Red Hat with an entry into the growing market for big data stored either in public or private clouds.One question is whether the Gluster and Inktank communities will remain separate or be merged as a result of Red Hat's latest acquisition. Stevens said a merger is unlikely since \"both communities are healthy and vibrant.\" However, he did not rule out \"joint discussions\" in areas like operational management.Either way, Stevens said the acquisition would not shift Red Hat's emphasis to, say, object storage. \"The market is driving industry standards for accessing data,\" he said in response to a question on company strategy. \"We're seeing a convergence on [data] access\" along with \"on-premise scalability.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-05-01 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Ceph",
        "Gluster",
        "Inktank",
        "OpenStack",
        "Red Hat"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/ceph/",
        "https://www.enterpriseai.news/tag/gluster/",
        "https://www.enterpriseai.news/tag/inktank/",
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/red-hat/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/red-hat-logo-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/05/redhat-storage-opportunity-1024x631.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}