{
    "title": "Independent Hyperion Research Will Chart its Own Course",
    "author": "John Russell",
    "date": "2017-12-19 00:00:00",
    "text": "Hyperion Research, formerly the HPC research and consulting practice within IDC, has become an independent company with Earl Joseph, the long-time leader of the IDC HPC team, acquiring the company as a sole proprietorship. He becomes CEO of Hyperion Research, LLC. The year-end resolution of Hyperion’s status had been expected. Under the terms of the sale of IDC to China Holding Group and IDG Capital last January, the U.S. government required the IDC HPC practice be spun out separately while a new owner was sought.Talks were held with at least nine suitors, including some vendors and other analyst firms, said Steve Conway, long-time IDC HPC executive and now Hyperion senior vice president of research. Adequate resources and independence were key factors in the eventual decision to become an independent entity. “The team and I had discussions with many potential acquirers in recent months, but none of them would have given us the same freedom-of-action and growth potential we now have as an independent company,” Joseph said in the official press release.The coverage areas will largely be the same, said Conway, with growth into the enterprise segment, an increased focus on artificial intelligence and a new quantum computing practice led by IDC veteran Bob Sorensen, now vice president of technology and research. Conway said, “Really we are just tracking HPC’s expansion.” Conway was instrumental in developing IDC high performance data analysis (HPDA) effort and said the AI effort is really a subset of that.Quantum computing is of course new but Hyperion already has clients for those services, according to Conway, and it is meeting with entities such as the national labs to help define what such a practice would encompass. He noted, “Quantum is still in the hype phase but the carrot is so big [you have to pursue ].” Quantum computing will be one of the main themes at the HPC User Forum (April 16-18), he said.Conway cited deep learning as another growth area. “We expect to see a ramp up in exploratory deep learning; it’s still not quite there in most segments.” The overall 2018 HPC outlook remains strong, he said.As described in today’s announcement, “Hyperion helps IT professionals, business executives, and the investment community make fact-based decisions on HPC-related technology purchases and business strategy.”“The team will continue all the worldwide activities that have made it the world’s most respected HPC industry analyst group for more than 25 years,” said Conway, “That includes sizing and tracking the global markets for HPC and high-performance data analysis. We will also continue offering our subscription services, customer studies and papers, and operating the HPC User Forum.” Conway emphasized that Hyperion’s business model relies more heavily on consulting relative to subscriptions.During the eight-month period between Hyperion’s separation from IDC and the formation of the new company, not a single client left Hyperion, according to the release. “In fact, our business continued growing to the point where we recently hired two more people, analyst Alex Norton and our former IDC colleague Kurt Gantrish as a second sales counterpart to Mike Thorp,” said Joseph, adding that the firm plans to add more analysts to address expected demand.“On behalf of our entire team,” Joseph said, “I deeply thank IDC for making it possible for us to continue the HPC business practice we all worked so hard to build while at IDC.” For more about Hyperion Research, see www.HyperionResearch.com and www.hpcuserforum.com.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/globe-map-shutterstock_608837984-675x380-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/IDC-Earl-Joseph-SC16-169x300.jpg",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/Steve.Conway.IDC_.jpg"
    ]
}