{
    "title": "5G, IoT Spur the Edge Datacenter Market",
    "text": "The proliferation of connected devices and Internet of Things sensors is boosting a transformed datacenter market in which service providers are shifting operations closer to the network edge.That trend is influencing everything from network topologies to power management systems required for backup power at remotes sites. It is also expected to nearly quadruple an emerging category dubbed the “edge datacenter” to a more than $16 billion market by 2025, according to a forecast from Global Market Insights. That works out to a 20.5 percent compound annual growth rate.The market tracker defines edge datacenters as facilities located closer to end users, delivering faster service with minimum latency. That architecture also maintains data closer to computing platforms, allowing greater utilization of unstructured data generated by IoT sensors.Another driver is the rollout of 5G wireless services requiring reduced latency and improved data traffic management. “Edge facilities help redirect data traffic away from carrier networks to local public internet networks by effectively using scarce carrier network resources,” the market tracker said.The edge datacenter market was pegged at more than $4.5 billion in 2018. The emergence of 5G networks and the big data they will generate is seen as a key driver. Edge facilities would be able to process larger data volumes near 5G base stations, hence service providers are shifting operations to manage on-premises edge deployments.Among the early leaders in the emerging edge service market are EdgeConnex, which announced plans earlier this year to construct edge datacenters at about 1,000 locations to support 5G-based applications. Others include Fujitsu, Hewlett Packard Enterprise, Huawei Technologies and IBM.Another edge colocation service provider, Vapor IO, recently unveiled an interconnect to edge datacenters via its flagship Kinetic Edge platform. The edge exchange is being deployed in Atlanta and Chicago.Austin-based Vapor IO and others are targeting early 5G applications such as exchanging data near “last-mile” wireless networks.“Large enterprises are investing in [edge] datacenters to reduce latency and increase the speed of delivering services and data,” the market forecast noted. “Edge facilities provide secure data storage and aid enterprises to keep pace with real-time processing and low-latency responsiveness.“The rise in data traffic and the increasing adoption of IoT technology is boosting the industry demand globally,” it added.Another driver is the growing need for tighter data security within the North American banking and financial services sectors. Those sectors are among the earliest adopters of edge facilities as demand rises for secure local storage and processing of customer data.“Several financial institutions are highly focusing on IT facilities that are close to their operational centers for effectively implementing advancements and modifications in these devices,” added the forecast.\nSeparately, IHS Markit estimates edge deployments along with cloud and colocation service providers will drive the global market for uninterrupted power supply (UPS) hardware market beyond $10 billion by 2023. Healthcare and retail applications are among the key drivers of edge computing, fueling the enterprise UPS deployments.Improving energy storage technology is key, with datacenter adoption of lithium-ion battery accelerating this year, IHS said, especially across Asia.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-11-04 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Edge/IOT",
        "Financial Services",
        "Networks",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Front Page",
        "Slider: Networks",
        "Slider: Security",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/sectors/financial-services-sectors/",
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "5G wireless",
        "edge computing",
        "edge datacenters",
        "Global Market Insights",
        "IHS Markit",
        "lithium-ion",
        "UPS"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/5g-wireless/",
        "https://www.enterpriseai.news/tag/edge-computing/",
        "https://www.enterpriseai.news/tag/edge-datacenters/",
        "https://www.enterpriseai.news/tag/global-market-insights/",
        "https://www.enterpriseai.news/tag/ihs-markit/",
        "https://www.enterpriseai.news/tag/lithium-ion/",
        "https://www.enterpriseai.news/tag/ups/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/edge-network-shutterstock_669389722-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}