{
    "title": "Dell Founder Retains Control as it Resumes Public Trading",
    "author": "George Leopold",
    "date": "2018-07-03 00:00:00",
    "text": "Twenty-two months after completing its $67 billion megadeal to ingest EMC Corp., Dell Technologies has again gone public with the issuance of a publicly traded tracking stock and the buyout of earlier investors in the EMC deal. The complex transaction allows founder Michael Dell and financial partner Silver Lake to maintain majority control of the IT giant.Michael Dell and Silver Lake partnered in 2013 to take the company private in a transaction valued at about $25 billion.In its return to public trading, Dell announced it would exchange common stock for a tracking stock created to finance its September 2016 acquisition of EMC and most of VMware. The $21.7 billion deal announced Monday (July 2) is designed to buy back shares created in 2016 to acquire EMC.Dell (NYSE: DVMT) said holders of the tracking stock, which paralleled Dell’s stake in VMware, would receive either common stock in Dell or cash. The tracking stock would then be eliminated.Michael Dell owns 72 percent of Dell Technologies’ common stock while Silver Lake currently holds 24 percent.The transaction “simplifies capital structure and positions Dell Technologies to build on its growing strategic and financial strength,” the company said. Dell will retain an 81 percent stake in VMware, which remains a separate publicly traded company.“Unprecedented data growth is fueling the digital era of IT, and we are uniquely positioned with our portfolio of technologies and services to enable the digital, IT, security and workforce transformations of our customers,” Dell’s chairman and CEO said.Dell “did what it had to do as a private company that would have been more difficult as a public one,” said Patrick Moorhead, principal analyst with Moor Insights & Strategy. Those steps included shedding its legacy services and software units along with its acquisition of storage leader EMC  and its majority stake in VMware.“The equity markets are on fire now and given state the company's turnaround, it makes a lot of sense to me,” Moorhead added.Analysts also noted that Dell’s portfolio, which along with EMC and VMware includes cloud services provider Pivotal Software, RSA, Secureworks and Virtustream, positions the IT giant in market segments ranging from the Internet of Things and edge computing to AI and networking technology.Dell also remains the leading global server vendor. Moorhead said the publicly traded company also is well positioned in booming markets like storage and analytics, networking infrastructure and, eventually, machine learning.Aside from the return to public trading, observers foresee few changes in how Dell Technologies operates, noting that no new management changes were announced. Michael Dell will continue to own between 47 percent and 54 percent of the company, Moorhead estimated.For its part, the company noted: “As a public company, Dell Technologies has maintained and plans to continue to maintain the same strategic focus on long-term growth that the company had achieved while being privately managed.”Dell Technologies’ common stock has been trending sharply higher since the transaction was announced on Monday.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/Screen-Shot-2017-09-06-at-11.01.10-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}