{
    "title": "IBM Launches All-Flash, Multi-Cloud Storage",
    "author": "Doug Black",
    "date": "2018-07-10 00:00:00",
    "text": "IBM today announced a new all flash-based entry to its storage products portfolio, a fusion of high performance storage technologies that the company said combines low latency IBM FlashCore technology integrated with multi-cloud software-defined IBM Spectrum Storage solutions. The NVMe-optimized all-flash arrays come in two models – FlashSystem 9110 and FlashSystem 9150 – in 2U enclosures that include dual array controllers, dual power supplies, redundant cooling, and hot swap capabilities.Both models have two Intel Skylake CPUs per array controller with the 9110 offering eight cores per CPU and the 9150 with 14 cores/CPU for higher throughput. IBM said the two rack units of space can provide the performance and efficiency of over a terabyte of memory and up to 2 petabytes of effective storage – “moving at NVMe speeds to tackle even the most demanding real-time analytics and AI applications and workloads.The company said a key innovation of the FlashSystem product line involves the introduction of IBM FlashCore hardware-accelerated architecture modules with NVMe interfaces that can be deployed with industry-standard NVMe flash drives.“Most organizations are already moving to multi-cloud architectures. And most storage solutions are scrambling to keep up,” said Steve McDowell, senior storage analyst, Moor Insights & Strategy. “But not IBM. With the latest announcement of the IBM FlashSystem 9100, their new all-flash array, which offers multiple ways to build multi-cloud storage solutions while providing NVMe speed and hardware accelerated data compression, it is clear that IBM is moving aggressively in the high performance storage marketplace.”IBM touted the FlashSystem 9100’s support for private, hybrid and public cloud deployments (IBM Cloud for now; AWS and other public clouds later this year, IBM CMO and VP of Worldwide Storage Channels Eric Herzog told EnterpriseTech). The solution includes embedded multi-cloud API automation, replication and secondary data orchestration software. The product’s capabilities can be extended by adding IBM Spectrum Storage components in three “multi-cloud” blue prints:IBM FlashSystem 9100 arrays come with Storage Insights, IBM’s AI-based predictive analytics, storage resource management, and support platform delivered over the cloud. Storage Insights monitors the capacity and performance for IBM block storage and external storage under management on a single screen.“Every IT group must provide business continuity and data copy provisioning and management solutions to the larger enterprise,” said Eric Burgener, research vice president of storage at industry watcher IDC. “These two related challenges can divert substantial resources and focus from other business-critical pursuits. Highly flash-optimized storage arrays that offer a full complement of enterprise-class data services and support for the latest NVMe technologies, like the IBM FlashSystem 9100, provide the performance, scalability and functionality to address these challenges for the data-driven, multi-cloud enterprise.”",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/IBM-FlashSystem-9100-0718-370x100.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/IBM-logo-300x150.png"
    ]
}