{
    "title": "HGST Acquires Object Storage Specialist Amplidata",
    "text": "In a bid to boost its software-defined storage portfolio as its pushes deeper into enterprise storage, Western Digital's HGST unit announced a deal to acquire Amplidata, a developer of object storage software for cloud datacenters.Financial terms of the transaction were not disclosed, but HGST did say on Tuesday (March 3) it expects the acquisition to close by the end of March.HGST, which focuses primarily on enterprise-class, solid state drives, including the first helium drive, said the Amplidata deal supports its expansion into high-end data storage platforms and systems.Amplidata, Milpitas, Calif., has staked out markets like big data storage as key markets for its object storage software as public and private cloud datacenters transition to software-defined infrastructures with greater emphasis on intelligent storage.The deal gives HGST a foothold in the object storage market with the acquisition of Amplidata's Himalaya product designed to scale software-defined storage systems.HGST and Amplidata have previously worked together to develop the former's \"active archive\" platform designed to boost storage efficiency and cost. The software approach is intended to provide greater control and management of storage building blocks like hard drives, solid-state drives and software while tightening storage system integration.Along with the joint development of active archive, parent company Western Digital also invested in the privately held Amplidata. Western Digital CEO Steve Mulligan also cited Amplidata's object storage technology and intellectual property as reasons for the deal.\"The acquisition will support our strategic growth initiatives and broaden the scope of opportunity for HGST in cloud datacenter storage infrastructure,\" Mulligan added in a statement announcing the deal.Western Digital and HGST are betting that the unrelenting shift to big data will create cloud datacenter applications requiring peta-scale storage requirements. Hence, Amplidata's object storage software is seen as enabling the scaling of datacenter tiered storage and archiving along with data management and security.HGST noted that Amplidata's AmpliStor XT storage array technology was recently selected by scale-out storage and archiving specialist Quantum for integration into its family of data management and tiered storage products. Quantum along with Intel Capital and others were early investors in Amplidata.As HGST looks to expand into high-end storage platforms, the disk drive and NAND flash storage device maker is also focusing on next-generation non-volatile memory technologies like phase change memory. It showed off a prototype PCI Express card based on phase change technology last summer and is upgrading its FlashMAX flash cards while updating its ServerCache software.Last fall, it rolled out a batch of datacenter offerings that included server-side clustering and volume management software that is billed as clustering up to 128 servers and 16 PCI Express storage devices. The combination is intended to provide shared volumes of flash storage up to 38 TB.It also rolled out its active archiving approach, which is based on the premise that disk-based storage can meet performance requirements but falls short of meeting cost requirements imposed by petabyte scale storage requirements in cloud datacenters.Hence, HGST is betting it can leverage Amplidata's object storage software technology as a way to bridge the scale-out storage gap.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-03-03 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "acquisition",
        "Amplidata",
        "cloud",
        "datacenter",
        "HGST",
        "object storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/acquisition/",
        "https://www.enterpriseai.news/tag/amplidata/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/datacenter-2/",
        "https://www.enterpriseai.news/tag/hgst/",
        "https://www.enterpriseai.news/tag/object-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-03-at-2.14.24-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}