{
    "title": "Red Hat, AWS Expand Cloud Data Transfer Options",
    "author": "George Leopold",
    "date": "2018-11-27 00:00:00",
    "text": "With its acquisition by IBM not expected to close until the second half of 2019, Red Hat continues to snap up cloud startups as it builds its hybrid cloud management portfolio.On Tuesday (Nov. 27), Red Hat announced its acquisition of software startup NooBaa, which specializes in managing data storage services across hybrid and multi-cloud deployments. The acquisition along with a new data transfer service announced this week by Amazon Web Services (NASDAQ: AMZN) highlight enterprise requirements for migrating huge data sets stored on-premises to the cloud for processing.Founded in 2013, Boston-based NooBaa promotes its hybrid cloud data management software as leveraging the flexibility of public-cloud storage with the ability to manage storage locally. Red Hat said the acquisition would augment its hybrid cloud offerings. Terms were not disclosed.Red Hat and its soon-to-be parent company IBM (NYSE: IBM) are positioning themselves to meet what industry watchers predict will be a steady enterprise migration to multi-cloud deployments. The resulting proliferation of workloads will run up against efforts to scale up emerging cloud-native applications.“Data portability is a key imperative for organizations building and deploying cloud-native applications across private and multiple clouds,” said Ranga Rangacharivice, head of Red Hat’s storage and hyperconverged infrastructure unit.The addition of NooBaa’s data platform designed to manage growing volumes of widely dispersed unstructured data also is expected to complement Red Hat’s OpenShift container and Ceph storage platforms. That would allow users to manage data storage across private and public clouds, Red Hat said. The combination is expected to be particularly relevant as object storage options emerge for on-premise and public cloud applications.Red Hat’s acquisition of NooBaa occurs as IBM continues to work through the lengthy regulatory and financial steps required to complete its $34 billion acquisition of Red Hat announced in October.  Some market analysts looking for technology and revenue synergies in the blockbuster deal are bullish. In a research note this week, Amit Daryanani of RBC Capital Markets predicted the Red Hat deal could boost IBM’s annual earnings per share by more than $15.Combined, the moves by Red Hat, its suitor IBM and cloud giants like AWS underscore the growing enterprise requirement to automate and accelerate ever-larger data migrations to and from public clouds. AWS this week unveiled a new managed cloud service dubbed DataSync designed to orchestrate data transfers of on-premise data to its cloud storage service.AWS said DataSync is based on a custom data transfer protocol it claims is 10 times faster than open source data transfer schemes. The cloud giant is targeting energy, life science and media customers that routinely generate huge data sets for processing in the cloud.AWS said in a blog post the new service is free, and users are billed for data transfers on a per-gigabyte basis. DataSync in available immediately across many AWS regions. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/11/cloudcomputing_migration.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}