{
    "title": "Oracle Takes On All-Flash Makers With Hybrid FS1 Arrays",
    "author": "Timothy Prickett Morgan",
    "date": "2014-09-29 00:00:00",
    "text": "Despite the naysayers that still contend that Oracle should not have gotten into the hardware business through its acquisition of Sun Microsystems nearly five years ago, Oracle co-founder and now CTO Larry Ellison has a fondness for hardware, and he particularly likes any hardware that has been tuned up specifically to accelerate Oracle's database, middleware, and application software.During his opening keynote at Oracle OpenWorld, which has an astounding 60,000 attendees converging on San Francisco this week, Ellison waited until the end of his discussion on Oracle's efforts in cloud computing to talk about hardware. He unveiled two new pieces of iron: The FS1-2 was billed as a \"flash storage enterprise SAN\" by Ellison, who added that the new storage array would be available in October and would sport many scale-out and high-availability features that top-end SANs have while at the same time allowing for all-flash configurations to stand toe-to-toe with the all-flash arrays from the various upstarts in the market. The difference with the FS1-2 is that it can be configured with two different speeds of disk and has automatic tiering of data between flash and disks based on the relative warmth of the data.The FS1-2 does not have inline data deduplication or data compression features to lower the effective cost per gigabyte for the array at the file level, features that all-flash arrays have to have because flash capacity is so much more expensive than disk capacity. However, the FS1-2 array does support Oracle's hybrid columnar data compression for its databases, which can cut database storage requirements by a factor of 3X to 5X and speed up queries by up to a factor of 5X.The FS1-2 has a new storage operating system and uses Xeon processors from Intel as their controller nodes. Many of the software technologies that were created by Pillar Data Systems (a company that Ellison invested in for many years prior to Oracle acquiring it) for its Axiom 600 disk arrays have been ported to the FS1-2 arrays, but this should not be thought of as an upgrade to those Pillar machines. This is a new animal, albeit one that supports thin provisioning, various cloning services for LUNs, file systems, and volumes, and snapshotting, among other features.In a way, you can think of the FS1-2 as a competitor to EMC's VMAX arrays or NetApp's FAS arrays, which both allow scale-out clustering of the arrays for high availability as well as for increasing controller performance and array capacity. The FS1-2 can have up to sixteen high availability controller nodes (that is eight pairs of two nodes) and each node is based on a two-socket Oracle server sporting Xeon E5-2620 v2 processors running at 2 GHz. The base controller comes with 64 GB of DDR3 memory and 16 GB of NV-DIMM memory that is used as a cache; the performance controller boosts the DDR3 memory to 384 GB and the NV-DIMM to 32 GB. This added memory plus more ports in the performance variant of the controller allows the top-end FS1-2 machine to expand to 30 drive enclosures. That works out to a maximum of 912 TB of flash capacity or 2.88 PB of disk capacity in a fully configured array. Servers link to the controllers through 16 Gb/sec Fibre Channel or 10 Gb/sec Ethernet running NAS or iSCSI protocols. Oracle is supporting 400 GB and 1.6 TB SSDs for flash. For disks, customers can choose 300 GB and 900 GB 10K RPM drives or 4 TB 7.2K RPM drives. (The slower drives are fatter and therefore cheaper on a cost per GB basis.) All of the storage is SAS-2.Like NetApp, Oracle thinks of its hybrid disk-flash arrays as being a virtue. In many IT shops, customers have flash arrays for accelerating particular workloads and disk arrays for others. Oracle is allowing customers to collapse these two kinds of storage into one box and using quality-of-service software in the FS1-2 storage operating system to determine automatically where to put datasets. Of course, the all-flash array makers will say that with inline deduplication and compression and the use of commercial-grade multi-level cell flash, it is possible to create flash arrays that have the same duty cycle as disk arrays and do so for around the same cost per unit of effective capacity. (This argument will not be settled any time soon, but customers will eventually decide.)With the all-flash configuration, Ellison said in his keynote that the FS1-2 could deliver up to 2 million I/O operations per second (IOPS) with a 50 percent mix of reads and writes and deliver 80 GB/sec of throughput.Here is how Oracle stacks up the FS1-2 against EMC's XtremIO all-flash arrays:\"It is much faster than EMC's XtremIO, and it is half the price,\" boasted Ellison. \"It is very, very fast, and obviously aggressively priced.\"The pricing comparison that Oracle made is on a per-terabyte basis using a two-node high availability configuration using all flash SSDs for storage and Fibre Channel links to servers. It is not clear if the Oracle comparisons were including the inline deduplication and compression features in the XtremIO arrays. It doesn't look like it, because those features together yield about a 6:1 compression ratio together on common enterprise data, according to EMC's datasheets. Oracle has not released pricing yet on the FS1-2, so it is hard to reckon at the moment. But when the machine ships in October, pricing should be available and we can do a more thorough analysis then.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/oracle-virtual-compute-logo-370x245.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/oracle-openworld-fs1.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/oracle-openworld-fs1-performance.jpg"
    ]
}