{
    "title": "A Raft of Flash Options Emerge for Datacenters",
    "author": "George Leopold",
    "date": "2015-08-11 00:00:00",
    "text": "A batch of PCI Express storage devices emerged from this week's Flash Memory Summit targeting hyperscale and enterprise datacenters that are gradually incorporating PCIe for online transaction processing and other big data workloads.PMC-Sierra was among the PCIe storage vendors introducing new switches and solid-state drive (SSD) controllers, the latter based on its second-generation Flashtec NVMe (Non-Volatile Memory Express) controllers. Meanwhile, its PCIe storage switches also unveiled this week aim to help scale emerging PCIe infrastructure in the datacenter.Elsewhere, Seagate followed up the release of a new 4-TB SSD last week with an expanded flash portfolio that includes two new NVMe SSDs and a flash accelerator card. All are designed to work with its storage offerings to tackle workloads ranging from high frequency trading and high-performance computing to jobs with mixed I/O sizes and multiple applications running simultaneously.PMC-Sierra, Sunnyvale, Calif., noted the requirement for a reliable means of connecting and scaling its NVMe SSDs. The resulting storage switch called Switchtec is designed to scale PCIe flash in high-end storage systems. The Switchtec PSX family is touted as consuming up to 60 percent less power than competing PCIe switches while reducing the number of devices used in a typical flash array.Storage and flash vendors are also betting that datacenter operators will continue to adopt PCIe infrastructure as they seek faster connections and lower latency between SSDs and host processors. With that in mind, PMC-Sierra claimed its PCIe SSD delivers 2.5 times the more bandwidth than eight serial ATAs running an online transaction processing workload in a Microsoft SQL server database.The company also noted that existing PCIe switches lack the high availability and storage capabilities to attach and scale out SSDs. The Switchtec PSX devices are designed to address this scale-out storage challenge by enabling widespread PCIe SSD deployment.PMC-Sierra said its Switchtec PSX PCIe storage switches and second-generation Flashtec NVMe controllers are sampling now to select customers.Meanwhile, Seagate's Nytro line of NVMe SSDs aims to increase storage density while requiring less space and power in the datacenter. Seagate's Nytro PCIe flash accelerator card similarly is intended to boost SSD response times for datacenter applications requiring high IOPS and enough bandwidth for a range of workloads.Seagate officials said its Nytro portfolio is \"all about balancing power and performance,\" as in latency versus IOPS. \"It's about accelerating data rather than storing data,\" Kent Smith, Seagate’s senior director for product marketing, noted in an interview.Hence, the flash accelerator is designed to boost performance for \"write-latency sensitive applications\" while the pair of new Nytro SSDs aim to balance power and performance in high density datacenter applications, including direct-attached storage, caching and tiering.The Seagate SSD's come in a 2.5-inch and M.2 form factors, the company said Tuesday (Aug. 11).The Nytro XP6500 flash accelerator card is available now. The XF1440 SSD is scheduled for release in October while the XM1440 version will be available from OEMs in early 2016, Smith said.Seagate acquired the LSI Corp.'s Nytro PCIe flash and Sandforce controllers from Singapore-based chipmaker Avago in May 2014.Seagate, PMC-Sierra and other PCIe storage vendors are betting that future datacenters increasingly running big data workloads will deploy a mix of flash and hard drives as they cope with greater data volumes and more demanding workloads.\"Future storage systems must combine flash memory and hard drives in an efficient, cost-sensitive manner,\" Seagate President Phil Brace told the flash summit. \"The industry must find ways to ensure that enterprises and other users get the most out of the storage….\"\"Datacenters are incorporating SSDs into their storage tiers to significantly improve data access times and CPU efficiency,\" added Derick Dicker, vice president of non-volatile memory at PMC-Sierra. With the emergence of the NVM Express standard along with PCIe controllers and \"software-defined flash,\" Dicker told the flash summit that the resulting enterprise PCIe SSDs could be tuned to specific workloads.Separately at the flash summit, PMC-Sierra along with partner Mellanox, the Infiniband and Ethernet interconnect specialist, demonstrated a pair of NVMe drives running on Mellanox's remote direct memory access fabric cards.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/datacenter-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-11-at-10.45.38-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}