{
    "title": "Dell Reports Record Revenue, but Outlook Raises Flags",
    "text": "Dell Technologies record annual revenues announced last week was nevertheless met with unease by shareholders wary of the outlook for its VMware business.Dell (NYSE: DELL) reported full-year revenues totaling $92.2 billion while fiscal fourth quarter revenue was up only 1 percent to $24 billion as a result of declining server and storage sales in the U.S. and China. Hence, analysts cited VMware’s (NYSE: VMW) “disappointing outlook” as a key reason both stocks tumbled last Friday (Feb. 28), a day of continuing virus-induced volatility on global financial markets.Market watchers cited VMware’s acquisition of Pivotal Software and the resulting recasting of its financial statements as one reason for pessimism. Still, “investing to become a cloud-centric business is the right move for VMware,” concluded Viceni Investing in a research note.Jeff Clarke, Dell Technologies’ chief operating officer, noted in a call with analysts that the Pivotal acquisition would combine “critical IP and go-to-market capabilities.” Clarke also cited VMware’s Project Pacific initiative, intended to upgrade its flagship vSphere server virtualization software using the de facto standard Kubernetes cluster orchestrator as its control plane. Longer term, Clarke said he is upbeat about the company's prospects.\"In FY '21, we're planning for both the overall server market and our server revenue to return to growth, driven by higher value workload servers, increasingly more robust AI and machine-learning solutions and distributed IT requirements at the edge,\" Clarke said. \"According to IDC, mainstream server revenue is expected to grow at 3.3 percent in calendar year 2020, and we plan to grow at a premium to the IDC forecast.\"Dell rolled out its infrastructure strategy late last year, focusing on combining its portfolio of products into “an all-in-one automated” platform dubbed PowerOne. “We need a multi-cloud operational hub so we can orchestrate and automate the multi-cloud world,” said John Roese Dell Technologies’ president and CTO for products and operations. The next step is applying AI-driven automation and data security across enterprise infrastructure, Roese added.“The industry is at a critical juncture as cloud migration accelerates and fast-moving trends such as containers (Kubernetes) demand agility,” Viceni Investing noted. VMware’s “margins can improve as Pivotal and Carbon Black scale to profitability and as VMware’s investments begin to bear fruit.” Dell completed its acquisition of enterprise security vendor Carbon Black last October.Still, analysts remain wary of slowing growth as reflected in Dell’s guidance. “It does feel like [Dell is] become increasingly cautious about [its] long-term outlook,” said Toni Sacconaghi, a research analyst with Sanford C. Bernstein & Co.“Our model is built on long-term growth and consolidation of the market and share gain,” responded Tom Sweet, Dell’s chief financial officer.The infrastructure vendor continues to expand its cloud capabilities built around VMware’s cloud and NSX network virtualization platform running on Dell EMC storage infrastructure. That combination is touted as providing “consistency across the entire ecosystem,” COO Clarke said.Dell’s partner network expanded this week with the integration of Pluribus Networks’ software-defined networking tool with Dell EMC’s “virtual edge” platform. The partners said the modular platform can be used to host virtual networking functions.We also note that Dell Technologies' upcoming HPC Community Meeting remains on track to happen March 9-12 in Austin, TX, featuring sessions on HPC integration with AI and edge computing and the prospects for neuromorphic and quantum computing.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2020-03-02 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Edge/IOT",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Front Page",
        "Slider: Security",
        "Slider: Software",
        "Slider: Storage",
        "Slider: Systems",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-security/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "cloud",
        "dell emc",
        "Dell Technologies",
        "financial guidance",
        "financial results",
        "nfv",
        "server virtualization",
        "VMware"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/dell-emc/",
        "https://www.enterpriseai.news/tag/dell-technologies/",
        "https://www.enterpriseai.news/tag/financial-guidance/",
        "https://www.enterpriseai.news/tag/financial-results/",
        "https://www.enterpriseai.news/tag/nfv/",
        "https://www.enterpriseai.news/tag/server-virtualization/",
        "https://www.enterpriseai.news/tag/vmware/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/financial-Wall-Street-generic-shutterstock-561991639-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}