{
    "title": "EMC Elastic Storage Appliance Takes On Public Clouds",
    "author": "George Leopold",
    "date": "2014-05-06 00:00:00",
    "text": "EMC rolled out an elastic cloud storage appliance that targets the hyperscale cloud storage infrastructure market. The appliance is the result of a research project known as \"Project Nile.\"The company also announced a new version of a software-defined storage platform and related design services.EMC said during a company-sponsored event that the appliance scales up to 2.9 petabytes of storage per single rack. It also can be clustered up to exabyte scale, a requirement for the \"Third Platform of IT,\" a reference to the prospect that cloud computing will expand to connect billions of users and millions of applications.The storage company also claimed its new appliance could reduce total cost of ownership in object storage implementations.Specifically, Amitabh Srivastava, president of EMC's Advanced Software Division, asserted that the new appliance delivers 9 percent lower cost than a comparable Google offering and 18 percent lower than Amazon Web Services. EMC said those estimates are based on mainstream customer implementations (1.4 petabytes raw, 740 terabytes utilized). With block, object, and Hadoop Distributed File System capabilities in a single appliance, customers can \"develop and build the next generation of applications for the Third Platform of IT,\" Srivastava claimed in a statement.The ECS appliance is being pitched as allowing customers to add hyperscale cloud capabilities to existing private and hybrid cloud environments that can be leverage to automate provisioning and data services while delivering future applications.EMC said its cloud appliance addresses performance tradeoffs inherent within public clouds. These include system outages and costs related to moving data in and out of public clouds as well as potential compliance issues related to where data is stored, if or how it is backed up and whether data is being accessed by unauthorized users.Industry analysts said large enterprises are trying to leverage the cost and scale benefits of public cloud while retaining the control of applications afforded by private clouds. EMC \"is providing an alternate approach that promises to bring hyper-scale efficiencies to on-premise and hybrid cloud deployments,\" Simon Robinson, a market analyst with 451 Research said in a testimonial provided by EMC.EMC also announced version 2.0 of a software-defined storage platform called ViPR that is designed to simplify management of both existing and new storage infrastructure. The company said ViPR 2.0 also provides new data services supporting next-generation applications and big data analytics.ViPR 2.0 plugs into high-level management and orchestration tools from VMware, OpenStack, and Microsoft to integrate storage into data center workflows. It also adds block data services based on EMC's ScaleIO server-storage-area network software along with new geographic replication and distribution.Finally, EMC said it was introducing new architecture and design services for the ECS appliance designed to help identify which application workloads would derive the greatest return-on-investment in the new appliance.The services will be available with the general release of the ECS appliance during the second quarter of 2014, EMC said. Pricing was not divulged.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2011/08/imgCloudComputing-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}