{
    "title": "HGST Puts Software Spin on Hard Drive Storage",
    "text": "The waterfall of unstructured data pouring into datacenters is fueling the need for data and object storage approaches that retain all that stuff while at the same time making \"useful' data accessible if and when needed. Emerging storage vendors zeroing in on the big data market often refer to this approach as making storage \"data aware.\"That along with emerging regulatory requirements for retaining more data are pretty much the strategy behind an \"active\" archiving system rolled out Wednesday (April 8) by storage vendor HGST. At the same time, the subsidiary of storage giant Western Digital is signaling that it is moving beyond hard drives to integrated storage system technology aimed at challenging traditional cloud storage.HGST, San Jose, Calif., touts its active archiving system as a \"cloud-scale\" data and object storage system that can be deployed \"out-of-the-box\" to deliver up to 4.7 petabytes of raw data storage per rack. The company said the archiving system leverages its investment in object storage software designed to make data accessible on a petabyte level while scaling to exabyte capacities.HGST's storage strategy also reflects its storage systems strategy that combines its second-generation helium-filled hard drives delivering 8 terabytes of storage capacity with other storage hardware and object storage capabilities. The result, the company asserts, is storage costs lower than alternative open source and other commercial object storage systems. The integration of low power helium hard drive technology and object storage is also said to deliver storage densities and power efficiencies along with the scale required for public and private cloud datacenters.The petabyte-scale requirements of datacenters to archive data that is beyond the \"create and modify\" stage but must still be retained along with the influx of unstructured data is steadily reshaping the storage technology sector. While storage vendors like HGST look to marry hard drive technology with object storage to tap the big data bonanza, other platform vendors are seeking to make all that raw data \"analytics ready\" in the cloud.For example, \"data integration\" specialist Xplenty said this week it was folding Google Analytics into its platform as a way to blend stored data with other data sources. The goal is to automate the preparation of raw data so data analysts can find the needles in the data haystack. The data blending tools focus primarily on the constant stream of web traffic data, which is also an example of the torrent of unstructured data that is increasingly being archived in datacenters.Hence, storage vendors like HGST are pitching plug-and-play \"Third Platform\" systems that combine the equivalent of cloud storage services with big data capabilities that require only a network and power connection to each storage rack.Dave Tang, senior vice president of HGST's Elastic Storage Platforms Group, said it is targeting the gap between the growing amounts of \"useful\" data and available storage capacity. \"That is creating a greenfield opportunity\" to provide a scalable, simple storage system, he argued.Emerging data retention requirements are also driving the need to archive more records. Tang said the active archiving platform \"is tuned to that type of workload.\"The active archiving system is also the first fruit of HGST's recent acquisition of Amplidata, a developer of object storage software for cloud datacenters. In announcing the deal, HGST said it would support its expansion into high-end data storage platforms and systems. Analysts stressed that Amplidata's object storage software is at the heart of HGST's approach.That software-defined storage approach seeks to deliver greater control and management of storage building blocks like hard drives, solid-state drives and software while tightening storage system integration, HGST said in announcing the Amplidata acquisition in March.HGST said its active archiving system is available now. Tang estimated archiving costs run at about $180 per terabyte of storage, which works out to about $849,000 per system.Along with data-driven enterprises, HGST is targeting cloud service providers. The storage system also complies with Amazon Web Services Simple Storage Service object storage interface. It supports applications requiring a gateway between network-attached and object storage, the company added.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-04-08 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Archival Storage",
        "disk drives",
        "HGST",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/archival-storage/",
        "https://www.enterpriseai.news/tag/disk-drives/",
        "https://www.enterpriseai.news/tag/hgst/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/sgi-active-archive-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}