{
    "title": "Violin Memory Fiddles With Primary Storage",
    "author": "no author",
    "date": "2015-02-17 00:00:00",
    "text": "The push to elevate all-flash arrays as the primary storage technology of choice got a boost this week from Violin Memory Inc., which rolled out two new all-flash arrays designed to handle primary storage and active workloads at a cost the company insists is below traditional disk storage.Along with its 7300 and 7700 all-flash arrays, Violin also unveiled its new Concerto OS 7 as well as Symphony 3 management control system. Together, Violin said its flash storage platform aims to consolidate next-generation datacenter workloads through higher storage performance. Reduced operating expenses, it said, would justify the cost of using all-flash arrays for primary storage.All are available now.Violin Memory, Santa Clara, Calif., said its Concerto OS 7 combines system-level flash management and control along with block level de-duplication and a data compression engine. The new OS is managed through Symphony 3 management console, which is bundled with the 7300 and 7700 flash storage platforms.The 7700 flash storage platform targets large, multi-petabyte deployments at multiple sites. Running Concerto OS 7, the high-end storage platform, delivers 1.3 petabytes of effective storage capacity or 20,000 persistent virtual desktops across as many as six shelves. Violin described the storage performance as 1.3 petabytes of effective space in a single name space.It also adds synchronous replication and stretch cluster capabilities as new data protection services, the company said.Two versions of the 7300 series were also unveiled this week. The standard platform delivers 217 terabytes of effective capacity in a three-rack unit with a data reduction rate of 6:1. It is further billed as supporting mixed and multiple datacenter workloads across a range of storage needs.Further, Violin's block-level inline de-duplication and data compression features are touted as boosting storage efficiency while providing the option of turning off those features depending on the application.The 7300E flash platform operates on a \"pay-as-you-grow\" model with an entry level at 34 terabytes of effective storage capacity. Violin said capacity could be expanded to 125 terabytes in a three-rack unit without additional hardware upgrades.The 7300 and 7700 series are built on a fourth-generation Violin Memory's \"flash fabric architecture\" that is said to enable the mixing and matching of workloads.Key to the effort to shift all-flash arrays to primary storage is a custom operation system designed specifically to ease the transition to all-flash storage. Violin claims its Concerto OS 7 is the first of its kind. Building on the company's previous vMOS 5, the new operating system incorporates a data management capability along with inline data reduction features. These are integrated into an \"integrated software image\" designed to handle Violin's current and future flash storage platforms.The combined storage platform and flash storage OS are intended to succeed traditional hard-disk drive arrays as a primary storage option for enterprises. “We’ve eliminated the final cost and feature barriers to mainstream flash,\" claimed Steve Dalton, Violin's senior vice president of engineering.Meanwhile, the bundled data management console is intended to provide \"granular control\" of enterprise data services as an automated real-time analytics and reporting tool.The challenge for Violin and other all-flash array vendors will be delivering more bang for the storage buck in order to justify the investment in pricy flash storage. Hence, analysts note that emerging flash storage platforms must include standard features like data services that are baked in.They add that flash storage approaches that integrate enterprise storage management features like Violin's Symphony console directly into the storage OS kernel could help differentiate flash from traditional HDD storage.Ultimately, Violin argues that the economic benefits of all-flash storage array stem from predictably high performance and lower cost per transaction when the technology is used for primary storage workloads. Company executives added that a dense architecture would reduce operating expenses while low latency and parallelism when running workloads would ultimately reduce capital expenditures.Either way, the drive to make all-flash storage arrays the de facto primary storage alternative appears to be gaining momentum.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/Screen-Shot-2015-02-17-at-2.16.57-PM-363x290.png"
    ]
}