{
    "title": "Microsoft Storage Appliances Push Data To Azure",
    "author": "George Leopold",
    "date": "2014-07-10 00:00:00",
    "text": "Microsoft is rolling out the latest series of its Azure storage appliances with an eye toward helping customers manage data growth while forestalling the seemingly endless cycle of buying additional storage.Hence, Microsoft is promoting its StorSimple 8000 series hybrid storage arrays as \"massively scalable\" with greater on-premise capacity for SSD and HHD storage.Takeshi Numoto, Microsoft's corporate vice president for cloud end enterprise marketing, said in a blog post that double-digit data growth and accompanying storage capacity and data protection issues require more automation and ability to scale. Numoto said the latest version of StorSimple is more tightly integrated with Microsoft's Azure public cloud. The storage appliances provide a link between primary and archival storage along with disk-based and tape backup to Azure.The tighter integration includes two new Azure-based capabilities that, according to Microsoft, enable new use cases and centralized data management. Numoto claimed the combination of on-premise and cloud storage could help reduce storage costs by as much as 60 percent while reducing IT infrastructure management.The latest StorSimple devices includes the 8100 and 8600 versions. The 8100 includes 15 TB of usable local capacity and a maximum of 200 TB when linked to the cloud. The 8600 model provides 40 TB of usable local capacity and a maximum of 500 TB of cloud-linked capacity.Microsoft said the StorSimple arrays store data across SSD and disk tiers similar to other hybrid storage products but add cloud storage as the most scalable tier for storing inactive data. Cloud storage allows Azure StorSimple appliances to combine primary, backup, archive, and off-site storage with centralized management in the cloud.Along with the arrays, Microsoft also announced the StorSimple virtual appliance, an implementation of its hybrid storage technology running inside Azure virtual machine in the cloud. The virtual appliance works in conjunction with the Windows Server operating system and Hyper-V hypervisor from Microsoft as well as on-premises machines running Linux or VMware's ESXi hypervisor.Numoto said the release also includes a StorSimple manager that consolidates management of 8000 series storage arrays and virtual appliances. The manager can be used to control StorSimple storage and data management from the cloud. This ensures \"consistent operations and data protection/retention policies across the enterprise,\" the Microsoft executive said.The software giant also stressed data protection and disaster recovery features of the new appliance. Stored data is automatically protected off-site by \"cloud snapshots,\" an alternative to tape backup or remote replication. The 8000 series also includes an \"instant recovery\" feature that allows quick access to data after a disaster.The list price for the 8100 appliance is $100,000, with a first year support package ranging from $16,665 to $22,230. Pricing for the 8600 is $170,000, with first year support ranging from $27,780 to $37,780.The hybrid storage arrays are built and distributed by Xyratex, a unit of storage component giant Seagate Technology.Microsoft Azure StorSimple 8000 Series hybrid storage arrays will be available on August 1. A demonstration is available here.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/microsoft-azure-logo-370x275.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/microsoft-storsimple.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}