{
    "title": "Coronavirus Canceling Tech Conferences",
    "author": "Alex Woodie",
    "date": "2020-03-02 00:00:00",
    "text": "This story includes new information since it was first published on March 2. We will continue to update the article as the status of conferences changes.Several conferences scheduled to take place in the coming weeks, including Nvidia’s GPU Technology Conference (GTC) and the Strata Data + AI conference, have been canceled due to fears of the COVID-19 coronavirus. Many of these events have been transformed to online, or virtual, events to stem the spread of the contagious virus. The Gartner Data and Analytics Summit, however, is still scheduled to take place later this month.“As the coronavirus situation is not improving, we’re turning GTC San Jose into a digital conference rather than a live event,” an Nvidia spokesperson wrote in an email today to journalists planning on covering the event. “Jensen [Huang, the CEO] will still give a keynote. We will still share our announcements. And we’ll work to ensure our speakers can share their talks. But we’ll do this all online.”Nvidia will issue full refunds to folks who purchased admission to the event, which was scheduled to take place March 23 – March 26 at the San Jose McEnery Convention Center.On February 28, the Open Compute Project Foundation canceled the OCP Global Summit, which had been scheduled to start on March 3 at the San Jose McEnery Convention Center. It has been rescheduled as a virtual event for the week of May 11. The organization issued the following statement:“Due to the fact that the World Health Organization today increased the assessment of the risk of spread and impact of COVID-19 to very high at the global level, and additional cases reported in key regions including Santa Clara County (California), the Open Compute Project Foundation has decided to cancel the OCP Global Summit next week.” The cancelation also covers two related events, the Future Technology Symposium and the Open System Firmware Hack event.The analytics firm Domo similarly cancelled the upcoming Domopalooza 2020 event, which had been scheduled to take place March 18 and March 19 in Salt Lake City, Utah. “…[I]n taking steps to minimize the risk of COVID-19, we’re transforming Domopalooza 2020 into an event that is 100% online,” the company said. The keynotes, general sessions, customer stories, and breakout sessions will all be accessed over the Internet.Adobe has also cancelled its physical Adobe Summit event, scheduled for March 29 – April 2 in Las Vegas, Nevada, and has transformed it into a virtual event. “Over the past few weeks, we have been closely monitoring and evaluating the situation around COVID-19 to ensure we are taking the necessary measures to protect the health and well-being of Adobe Summit attendees,” the company wrote. “As a result, we have made the difficult but important decision to make Adobe Summit 2020 an online event this year and to cancel the live event in Las Vegas.”Google Cloud also canceled its upcoming event, Google Cloud Next ’20, which was slated to take place April 6 -8 at the Moscone Center in San Francisco. “Due to the growing concern around the coronavirus (COVID-19), and in alignment with the best practices laid out by the CDC, WHO and other relevant entities, Google Cloud has decided to reimagine Google Cloud Next ’20,” the company states on its website.Microsoft has also canceled the physical Microsoft MVP Global Summit, scheduled for March 15 –  March 20 in the Redmond, Washington area and made it an online-only affair.Tabor Communications, the parent company of Datanami, has postponed the HPC & AI on Wall Street event that was scheduled to take place in Singapore on April 14 and 15. It has been rescheduled for 2021. The HPC & AI on Wall Street New York event is scheduled to take place September 14 and 15.“We made the decision to reschedule our Singapore event in late February, nearly 60 days before its scheduled date,” Tabor Communications CEO Tom Tabor says. “We were closely monitoring the developments of the virus and realized the upward trend of this situation was not slowing in the APAC geo. Rather than put our attendees, sponsors and staff at risk, we made the decision to re-schedule the event to early Spring 2021.”On Tuesday, O’Reilly Media decided to cancel the Strata Data & AI Conference, which was scheduled to be held March 15 – 19 at the San Jose McEnery Convention Center.“Due to the recent outbreak of COVID-19, we’ve decided to postpone O’Reilly Strata Data & AI 2020 in San Jose,” O’Reilly Media said via email. “We’ve been working to keep the event moving forward over the course of the last few weeks because we’re excited about convening the data science and AI communities in such a unique new way. But an abundance of caution and our belief in putting people first has shifted our resolve.\"The Gartner Data and Analytics Summit, which is scheduled to take place March 23 – 26 near Dallas, Texas, is still going ahead too. “We are closely monitoring and assessing new developments pertaining to the Novel Coronavirus (COVID-19), including World Health Organization, the Centers for Disease Control and Prevention, and regional and national government directives and guidance,” the company states on its conference website.Flink Forward North America will also go ahead as planned in San Francisco from March 23 through 25. Ververica, the company behind the Apache Flink data streaming framework, expects more than 500 people to attend the event, which will take place at the Hyatt Regency hotel. Enterprise Data World is also planning to host more than 1,000 people at the Sheraton Hotel & Marina in San Diego from March 22 to 27.  The analytics company SAS is also planning to go ahead with its SAS Global Forum from March 29 to April 1 in Washington, DC.Dell has elected to go ahead with the Dell Technologies HPC Community Meeting, which is scheduled for March 9-12 in Austin, Texas. “Dell Technologies HPC Community Meeting and the COVID-19 outbreak. “Dell Technologies is closely monitoring the COVID-19 situation and has instituted some precautionary policies on international travel,” write the event coordinators, Jay Boisseau and Janet Morss. “We understand and respect cautionary decisions by other, larger conferences with 10K-100K international attendees to postpone (Game Developers Conference), go digital (GTC) or cancel (Mobile World Congress).  However, the situation in Austin, and in Texas, is currently 100% business-as-usual. We are watching things closely…”Neo4j has made no announcement regarding changes to its upcoming GraphConnect event, which is scheduled to take place April 20-22 in New York. Similarly, there are no changes to the Kafka Summit event that Confluent has scheduled to take place in London April 27 and 28.Alex Woodie has written about IT as a technology journalist for more than a decade. He brings extensive experience from the IBM midrange marketplace, including topics such as servers, ERP applications, programming, databases, security, high availability, storage, business intelligence, cloud, and mobile enablement. He resides in the San Diego area.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/coronavirus-shutterstock-1622644309-0320-370x279.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/GTC-Nvidia-2020.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/Strata-2020.png",
        "https://secure.gravatar.com/avatar/b0307dd70ffe024a023722c06b737966?s=80&r=g"
    ]
}