{
    "title": "Quantum: Joining the Worlds of High Performance and Enterprise Storage",
    "text": "High performance storage specialist Quantum today announced a scale-out NAS appliance that the company said is the first to bring together the qualities typically found in enterprise-class storage solutions (tools and management capabilities) with those found in technical and scientific computing (capacity and scaling to accommodate rapid data growth).The new product, called Xcellis Scale-out NAS, targets what Quantum calls “high-value workloads”: commercial high performance users for whom “the data is the product,” Laura Shepard, senior director, emerging technologies, told EnterpriseTech, such as organizations in the autonomous vehicle, media/entertainment, genomics, drug disco very and personalized medicine industries. Unlike enterprise IT workloads, data in high-value workload environments is constantly growing on every axis — ingest, processing, analysis, distribution, archive. These environments require storage solutions with the management and features of enterprise NAS, but which can also cost-effectively scale performance and capacity.“They have a common set of characteristics that translates into a common set of requirements,” Shepard said. “They have large amounts of high growth data and the data is largely unstructured. And because of the nature of their business and how often they compute against it, or how sensitive it is from a personalization and an intellectual property standpoint, the majority of their tier 1 data tends to stay on premise.”According to Quantum, Xcellis delivers greater than 3X the performance of competitive enterprise NAS offerings and, with integrated storage tiering, can cost as little as 1/10 that of alternative enterprise NAS solutions with the same capacity and performance.Xcellis is built on Quantum’s StorNext parallel file system and data management platform. It enables clusters to scale performance and capacity together or independently to reach hundreds of petabytes in capacity and terabytes per second in performance. The company said a single client (SMB, NFS or high-performance client) can achieve over 3X the performance of competitive scale-out NAS offerings with multiple clients scaling a single cluster’s bandwidth to over a terabyte per second.It also offers features and management capabilities designed to simplify installation and setup, a single screen for administrative and performance monitoring, alerting and management, along with scanning and search capabilities for large data repositories. It is designed to integrate with the high performance Ethernet networks through SMB and NFS interfaces, and it supports high-performance block storage.For data management, Xcellis provides automatic tiering within a unified, single name space architecture, between SSD, disk, tape, object storage and public cloud. Copies can be created for content distribution, collaboration, data protection and disaster recovery regardless of data location.Quantum said Xcellis also offers integrated AI capabilities that actively interrogate data across multiple axes to uncover events, objects, faces, words and sentiments, automatically generating custom metadata.“The proliferation of unstructured data in a vast array of industries offers virtually unlimited opportunity for discovery and monetization,” said Scott Sinclair, senior analyst, Enterprise Strategy Group, “but traditional storage and management of that data has kept many organizations from achieving their full potential. Xcellis Scale-out NAS is designed to empower users to scale performance and capacity independently and cost-effectively to keep storage from becoming an obstacle to progress.”“There is a gap in the market between NAS systems designed for enterprise data management and HPC solutions designed for data-intensive workloads,” Molly Presley, vice president, global marketing, Quantum. “Xcellis Scale-out NAS fills this gap with the features needed by enterprises and the performance required by HPC in a single solution. Xcellis uniquely delivers capacity with the economics of tape and cloud and integrated AI for advanced data insights and can even support traditional block storage demands within the same platform.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-12-12 00:00:00",
    "cats": [
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "high performance storage",
        "NAS"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/high-performance-storage/",
        "https://www.enterpriseai.news/tag/nas/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_abstract_tech_space-ARM-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/Quantum-storage-logo-300x65.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/Quantum-Xcellis-121217-1024x687.jpg"
    ]
}