{
    "title": "Nvidia Buys Object Storage Vendor SwiftStack",
    "text": "Nvidia is acquiring cloud data storage specialist SwiftStack, accelerating the consolidation of the object storage sector as AI applications developed by Nvidia move between private and public clouds.Terms of the acquisition were not disclosed.The GPU leader (NASDAQ: NVDA) currently uses SwiftStack’s technology in its datacenters. The object storage framework is based OpenStack, which includes a Swift component used to provision object storage.A key component of the acquisition is a file connector called 1space, billed as a data accelerator “at the edge, and in the cloud.” Joe Arnold, SwiftStack’s co-founder, also noted in a blog post announcing the deal that its object storage technology is used with Nvidia’s AI infrastructure.The file connector is compatible with public cloud storage platforms like Amazon Web Services S3 and is designed to move data between private and public cloudsAlong with 1space, Arnold the new Nvidia storage unit would continue to support its products based on OpenStack Swift APIs as well as its ProxyFS file access platform.The San Francisco-based storage vendor unveiled the latest version of its flagship platform last October. SwiftStack 7 incorporates its 1space file connector. General availability was scheduled for early this year.The platform upgrade underscored SwiftStack’s shift from commodity object storage to high-end applications ranging from machine learning to media analytics. The release also highlighted growing enterprise requirements for “a storage architecture with the ability to feed thousands of GPUs working in parallel,” the company said.Nvidia told the website Blocks&Files.com it would continue to use SwiftStack’s technology internally while directing its customers to its storage platform, using 1space as the link between its AI stack and object storage.SwiftStack laid off an undisclosed number of employees late last year as it shifted its focus to HPC and other data-intensive applications.Meanwhile, the object storage market is seen consolidating as technical standards emerge and more AI-centered uses cases emerge.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "date": "2020-03-06 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Data Analytics",
        "Edge/IOT",
        "Slider: Cloud",
        "Slider: Edge/IOT",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "1space",
        "acquisiiton",
        "AI",
        "GPUs",
        "NVIDIA",
        "object storage",
        "OpenStack",
        "SwiftStack"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/1space/",
        "https://www.enterpriseai.news/tag/acquisiiton/",
        "https://www.enterpriseai.news/tag/ai/",
        "https://www.enterpriseai.news/tag/gpus/",
        "https://www.enterpriseai.news/tag/nvidia/",
        "https://www.enterpriseai.news/tag/object-storage/",
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/swiftstack/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-28-at-9.34.16-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}