{
    "title": "Workplace Collaboration: Why Workflow Management in Storage Technology Is Critical to Team Success",
    "author": "no author",
    "date": "2019-02-25 00:00:00",
    "text": "Search for “workplace collaboration” and you’ll find self-improvement websites with recommendations covering how to brainstorm as a team, collectively work toward a common goal, manage participation levels from various contributors, and so forth. All good advice, but the impression is that these teamwork skills are nice-to-have personal capabilities.In today’s business world, workplace collaboration is no more an option than the fuel in your vehicle. It’s a business requirement driven by global, interconnected economies, generational identities, optimizing workforces and sweeping technology changes. And it’s those businesses harnessing this collective power that are maximizing opportunities and outmaneuvering the competition.Market Drivers\nWhy Big Organizations Need Big Collaboration \nAn Architectural Foundation for CollaborationThere are three major factors in choosing the right storage technology for complex collaborative workflows: comprehensive accessibility, centralized functionality and affordability.Let’s examine a handful of companies that implemented storage solutions with these characteristics to support their collaborative workflow environments.Deluxe EntertainmentDeluxe Entertainment provides digital delivery services for large content providers. Over the past several years, Deluxe transitioned to a fully digital workflow that produces 4TB of content daily and 7 million minutes of content per week. Compounding this difficulty further, they have to do this while simultaneously supporting 1,300 file formats. Collaborative workflows provide different Deluxe teams with parallel access to files, and the ability to transfer up to 10TB of content every day to waiting customers.Visual Data Media ServicesAs a leader in media preparation and distribution, with an innovative approach to restoring film archives, Visual Data Media Services was recently presented with a potentially lucrative project to remaster a portfolio into 4K/UHD digital assets. Although the company could handle the process, the data storage foundation for completing this work was not capable of supporting the new workflow.  This was even more true considering that the production process involved various team members requiring different levels of performance and accessibility. Ultimately the organization chose a solution that provided high performance over an all-IP storage architecture and allowed for the entire team to have accessibility to the content no matter how remote they were.CERNBest known for its Large Hadron Collider (LHC), CERN is the world’s leading particle physics laboratory. One major project is whimsically named ALICE (A Large Ion Collider Experiment), which generates billions of data bits per second and involves an international collaboration of more than 1,000 physicists, engineers and technicians from 30 countries. CERN is utilizing a highly secure HPC storage infrastructure and shared workflow that enables global research teams to generate and access ALICE data.ConclusionEffective workplace collaboration depends on a multitude of factors that extend from staff to the technical foundation of the entire organization. Ensuring that each one is tuned to run efficiently will require time and investment; this is not going to happen by itself, nor will it happen overnight. But without resourcing this area of the business effectively, it becomes siloed, and no business can thrive in a siloed environment.Big business and government organizations must have the will to transform their siloed cultures and siloed storage technology into something that supports their global collaborative teams. Like most things in life, taking the more difficult path is the one that will deliver the most rewards – the ultimate choice is between gradual decline in the marketplace, or a thriving business that employs and benefits people and customers all over the world.Jason Coari is director, high-performance storage solutions at Quantum.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/workflow-shutterstock-1010005792-370x290.jpg"
    ]
}