{
    "title": "The Evolution of EMC",
    "author": "Tiffany Trader",
    "date": "2013-09-20 00:00:00",
    "text": "Founded as a storage company in Massachusetts in 1979, EMC has developed into a major IT company with two principle parts, its information infrastructure business and its VMware virtual infrastructure operation, represented by its majority stake in VMware. Of the company's 48,500 employees, 9,000 are employed by VMware.A recent white paper explores EMC's evolution from a simple storage company into a major IT player, but, as the author observes, fulfilling that potential means that EMC \"must integrate its many acquisitions and overcome the challenges of commoditization and increasing competition in the storage market.\"In 2011, EMC fit 26 dancers into the back of a Mini Cooper to celebrate its launch of 41 storage products. It was attention-grabbing, designed to draw crowds o what the company called the \"biggest storage product launch in history.\"According to IDC executive analyst Ben Woo, EMC \"wanted people to realize that it was still number one in storage. EMC now controls over a quarter of the entire market share. It wanted to reaffirm its leadership.”But what image was EMC reaffirming? Experts say this was a different company from even a year prior. “The company has transformed beyond all recognition in the last decade,” was how The 451 analyst Simon Robinson put it.Once up a time, the Hopkinton, Massachusetts-based company derived healthy profits from sales of the Symmetrix hard drive array. But in 2001, CEO Joseph Tucci stepped in and shook things up. Taking a page from the Cisco and HP playbook, Tucci transformed EMC into a diversified hardware, software and services company. The impetus for the change, according to Clive Longbottom, founder of analyst firm Quocirca, was a realization that led to a vision: instead of just storing the information, EMC would help companies manage the information they stored.Having this diversified IT portfolio, allowed EMC to act more strategically and endowed it with more credibility from the industry. Still a leading storage vendor, EMC had branched out into two important areas: security and virtualization. These technologies would prove to be the source of their growth and of their future success.The execution for this expansion relied on a strategy of acquisition, including the highly talked about purchases of RSA on the security front and VMware, which is pretty much synonymous with virtualization.With these and other acquisitions under its belt, the company now needs to work on unifying all the expertise that it has bought. Analysts have pointed out that EMC has not always done a great job at executing its purchases, at bringing the companies together. The VMware IPO, for example, even though it was successful, showed a lack of integration between the two entities.The takeaway here is that EMC's talent for anticipating future market needs has led to a bit of an identify crisis. Despite its storied expansion, the \"storage company\" label has proved rather sticky. Getting its house and messaging in order will be crucial, especially as it works out how to leverage the IT target known as big data.With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.Pingback: EMC Seeking Merger Partner?Pingback: EMC Seeking Merger Partner? – EnterpriseTech | Everyday News Update",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/EMC-headquarters-400x-370x290.jpg",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}