{
    "title": "Kubernetes Seen Driving Bare-Metal Comeback",
    "text": "Hardware vendors are betting the transition to 5G wireless networks supporting myriad connected consumer and industrial devices also will accelerate the shift to heavy-duty bare-metal servers as a way to provision cloud-native tools like the Kubernetes cluster orchestrator.The expansion of the Kubernetes ecosystem as a de facto standard for managing application containers is reflected in adoption of the micro-services framework by cloud vendors and, now, networking specialists designing new hardware approaches to break network bottlenecks.Among them is high-performance interconnect specialist Mellanox Technologies (NASDAQ: MLNX), which is pitching a smart network integration card as a way for service providers and companies switching to cloud-native operations to provision Kubernetes on emerging bare-metal clouds.The soon-to-be-Nvidia (NASDAQ: NVDA) unit is rolling out a programmable network adapter that integrates its architecture with a set of Arm processors. The combination of programmable hardware acceleration engines with new networking capabilities and a dash of networking software is intended as a platform for bare-metal provisioning of Kubernetes clusters along with storage virtualization.Mellanox noted in a blog post that companies and service providers are turning to bare-metal Kubernetes as they deploy more workloads at the network edge, especially industrial Internet of Things applications. “Bare-metal servers that provide direct hardware access, coupled with a leading-edge computing software stack, typically outperform hypervisor-based platforms at the edge,” said Itay Ozery, senior product manager at Mellanox.That approach dovetails with Nvidia CEO Jensen Huang’s assertion in March when Nvidia acquired Mellanox that “future datacenters of all kinds will be built like high performance computers,” especially as IoT and other edge deployments accelerate.The bare metal approach also is being touted as a way to simplify virtualized storage. Mellanox said its proprietary NVM Express technology would allow cloud operators to virtualize Kubernetes bare-metal storage without sacrificing application performance.Those enhancements illustrate how virtualization is advancing in parallel with Kubernetes adoption, observers note. Virtual machine “usage is evolving across multiple layers of the Kubernetes stack,” Joe Fernandes, Red Hat’s vice president of products and cloud platforms, noted in a recent commentary.Among the drivers of bare-metal provisioning of Kubernetes are the demands placed on infrastructure struggling to handle high-end workloads like big data analytics and machine learning. “These are driving system architects and cloud operators to take the hypervisor out of the equation and achieve better application performance straight on metal,” Mellanox said.As cloud-native applications are built from the ground up, Kubernetes is increasingly seen the preferred micro-services framework for handling AI application workloads. Among the advantages is its ability to abstract infrastructure, allowing data scientists and developers to focus on applications while infrastructure runs in the background.Red Hat (NYSE: RHT) and others also see a resurgence in bare-metal provisioning of Kubernetes. A recent OpenStack survey found growth in bare-metal infrastructure in production deployments. The poll found that Kubernetes is driving the shift, with 37 percent of those using Kubernetes on OpenStack doing do via a bare-metal provisioner.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-05-21 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Datacenter",
        "Edge/IOT",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "bare metal",
        "edge",
        "interconnects",
        "iot",
        "Kubernetes",
        "Mellanox",
        "network integration card",
        "NVMe",
        "OpenStack",
        "Virtualization"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/bare-metal/",
        "https://www.enterpriseai.news/tag/edge/",
        "https://www.enterpriseai.news/tag/interconnects/",
        "https://www.enterpriseai.news/tag/iot/",
        "https://www.enterpriseai.news/tag/kubernetes/",
        "https://www.enterpriseai.news/tag/mellanox/",
        "https://www.enterpriseai.news/tag/network-integration-card/",
        "https://www.enterpriseai.news/tag/nvme/",
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/virtualization/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/10/bare-metal-cloud-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}