{
    "title": "Google Expands Cloud Tools with Data Orchestrator",
    "author": "George Leopold",
    "date": "2018-05-01 00:00:00",
    "text": "Google Cloud Platform’s new data orchestrator dubbed Cloud Composer is its latest managed service based on its Apache Airflow workflow management tool.Announcing the beta launch of Cloud Composer on Tuesday (May 1), Google (NASDAQ: GOOGL) said the orchestration tool is designed to develop, schedule and monitor enterprise workflows across internal datacenters or multiple clouds. Hence, workflow management would operate at the “platform level, like other cloud services,” James Malone, a Google product manager, noted in a blog post.Given the open source roots of the orchestration tool, Google also stressed its portability, meaning the workflow tool and related infrastructure could be transferred among clouds as a way to reduce development headaches while avoiding vendor lock-in.Google noted the beta launch of Cloud Composer was a “starting point” and other new features are planned, including additional Google Cloud regions, Airflow and Python versions along with an autoscaling feature. Malone said Google continues to work on Airflow extensions, including an “executor” toolfor the Google-developed Kubernetes cluster orchestrator.Airflow and Cloud Composer currently support Google BigQuery, the search giant’s analytics data warehouse, along with Cloud Dataflow stream and batch processing and several other Google cloud data and storage services.The effort to provide a cloud data orchestrator underscores Google’s ongoing effort to differentiate its public cloud service from rivals Amazon Web Services (NASDAQ: AMZN) and Microsoft Azure (NASDAQ: MSFT) as each adds new bells and whistles to attract companies launching multi-cloud strategies.For example, Microsoftunveiled a “compute optimized” Azure SQL data warehouse this week designed to boost database query performance.Google said it will offer a consumption-based pricing structure for Cloud Composer that includes virtual CPU per hour, Gb/month and Gb transferred per month since the cloud data orchestrator is based on several Google Cloud platform components.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/shutterstock_orchestrate-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}