{
    "title": "Primary Data Virtualization Storage Platform Adds VMware Capability",
    "text": "Days after unveiling its DataSphere data virtualization platform, Primary Data announced the technology act as a Universal VMware vSphere Storage APIs for Storage Awareness storage provider for the Virtual Volumes feature in VMare vSphere 6.This capability is part of Primary Data's focus on eliminating silos by allowing organizations to access data, regardless of vendor or technology, and on improving enterprises' usage of their existing storage solutions.With Virtual Volumes, organizations attain finer control per virtual machine so underlying storage becomes VM-aware and simplifying storage via policies, according to Primary Data. Using data virtualization, DataSphere abstracts storage into a global dataspace that enables current storage to be VMware VASA-compliant, the vendor said. As a result, it allows existing storage resources to be presented as one, adaptable VMware vSphere Virtual Volumes datastore managed in VMware vCenter Server.DataSphere enables data mobility across multiple storage tiers, such as server flash, SAN, NAS, and cloud storage, according to Primary Data. The developer eliminates today's storage silos, which are tied to an application, by operating out of band.\"We do to data what VMware does for servers. This gives us a separation from the logical view versus where it is physically stored,\" Primary Data CEO Lance Smith told EnterpriseTech. \"We allow data mobility to occur on the fly without disruption. If they want more performance, based off demand, we can take a file and we can migrate it to an all-flash array without the application stopping. The application itself will have higher-level performance.\"The storage-agnostic technology is available as a virtual machine or appliance, he said. Targeted at large enterprises such as the Fortune 2000, major hospital chains, and other organizations with lots of mission critical data typically stored across various technologies, Primary Data can manage up to 1 billion files, said Smith.\"Our customers wanted to make sure we weren't trying to control how much storage capacity they had. We don't limit them,\" he said.DataSphere acts as a Universal VASA provide, accelerating and simplifying adoption of vSphere Virtual Volumes and allowing organizations to more rapidly adopt new technologies – such as VMware vSphere 6 – when they become available, said Smith.Most organizations face the same challenge: Data grows, yet only 10 percent to 20 percent has business value, said Smith. Generally enterprises resolve that today via rows of provisioning, he said, but locating the necessary data can be time-consuming and create pools of unused, expensive storage.\"Even though last week’s hot data quickly becomes cold, today most data is stuck in the same storage silo where it was first created because of the complexity and cost of data migration,\" said Steve Wozniak, Primary Data chief scientist, in a statement. “This can be an expensive problem that ties up storage resources. Primary Data finally makes it possible to automatically have the right data on the right storage tier at the right time, without the need to rip and replace a single storage system.\"   Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-08-31 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/storage-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}