{
    "title": "Qumulo-HPE Launch Updated Enterprise File Storage Solutions",
    "text": "High performance storage vendor Qumulo today launched an updated line of distributed file storage solutions integrated with HPE’s high-end Apollo 4200 Gen 10 Servers. Qumulo, whose partnership with HPE began two years ago, said the combined solution “provides enterprise organizations scalable, software-defined file storage with deep data visibility into unstructured data workloads that scale-across on-prem, hybrid and cloud environments.”The hybrid scale-out appliance comes in a 2U form factor and offers FIPS-2 Level 1 security compliance along with HPE’s “silicon root of trust” technology, designed to prevent modifications to be made to hardware within the supply chain. Three configurations of the Qumulo-Apollo 4200 platform are available: “As our customers seek to gain visibility into and control over their unstructured data, security and real-time analytics capabilities are emerging as top priorities for file storage solutions,” said Bill Richter, CEO of Qumulo. “To that end, this intelligence-enabled solution from Qumulo and HPE provides a whole new level of security coupled with unmatched data visibility from Qumulo’s real-time analytics and HPE’s infoSight predictive analytics platform.”In its launch announcement, Seattle-based Qumulo cited a report from industry analyst firm IDC stating that the scale-out file storage market is growing rapidly in response to growing demand for processing, analyzing and storing massive unstructured data sets, reaching $11B market by 2022, up nearly 2X from previous forecasts. “Global enterprises are increasingly looking to scalable file storage to address their massive unstructured data processing, analytics and retention demands,” said Amita Potnis, research director, Infrastructure Systems, Platforms and Technologies Group at IDC.Molly Presley, Qumulo’s head of worldwide product marketing, pointed out that as of 2017, IDC had projected the file system market to grow by a relatively tepid 10 percent through 2022.“The reason was that even though unstructured data was growing very quickly,” Presley told us, “file systems in the legacy space really didn’t have the capability to scale to meet massive unstructured data demand. So customers were starting to shift to on-prem object storage and (AWS) S3 in the cloud, looking at ways to take advantage of object technologies that accomplished scale.“But now that file systems…have been designed for the modern world where they’re designed for the cloud, they’re designed for massive file counts, the market has shifted back towards a growth market for file storage, about a 60 percent increase in actual sales as well as projections moving forward.”The result, she said, is “a tech shift” in which modern file systems “are helping customers with having single-tier architectures, being able to analyze, create and archive in a single name space, instead of having to do tiering or HSM (hierarchical storage management).”The Qumulo-HPE offering is available from HPE and HPE VARs. HPE customers with cloud initiatives can also purchase Qumulo cloud offerings for Amazon Web Services through HPE.",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2019-11-04 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Storage",
        "Slider: Systems",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/slider-systems/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Qumulo-HPE-Apollo-integration-1119-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Qumulo-HPE-IDC-File-System-market-chart-1119.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Qumulo-HPE-File-System-Apollo-workloads-1119.png"
    ]
}