{
    "title": "SDS, Hyper-C Gain Traction in Datacenter, Survey Finds",
    "author": "no author",
    "date": "2014-11-13 00:00:00",
    "text": "Software-defined storage along with hyper-converged infrastructure may be catching on at the high end of the enterprise market largely because it promises to make life a little easier for those who manage storage infrastructure.Most of the IT managers interviewed by market analyst 451 Research this past summer said they either understood SDS (59 percent) or had heard of it and wanted to know more (39 percent). For the purposes of the survey, SDS was defined as software loaded onto a cluster of standard servers to leverage server-side storage while providing shared storage. It is also touted as eliminating the need for storage arrays and storage area networks.Along with simplifying storage and SAN management, those respondents considering SDS also cited its ability to scale and the potential to reduce total cost of ownership. Among the most appealing SDS features uncovered by the survey were virtual machine-level administration and the ability to mix and match storage drives. Data compression also ranked high.While awareness of SDS technology is relatively high among storage managers, 451 Research found that only 51 percent of those familiar with hyper-convergence understood it benefits. Twelve percent of respondents said they had never heard of it.Hyper-converged systems, delivered either as an appliance or software alone, were defined by the market researcher as consisting of standard servers implementing both compute and storage functionality to leverage software and server resources. (The chart says Hyper-C, and it is not a typo for Hyper-V, Microsoft's server virtualization hypervisor, in error.)The researcher reported that 82 percent of respondents were \"likely\" or \"very likely\" to consider hyper-converged installations. Again, the primary reason was that it promised to simplify infrastructure management or reduce administrative or operating expenses.The report's authors judged the results \"surprising, given that the qualities of SDS that respondents like are also hyper-convergence virtues.\" They suspect the seeming discrepancy stems from \"confusion\" over what hyper-convergence actually entails.\"Clearly there is a demand for IT infrastructure that is simpler to manage, and can scale out as data grows,\" said Tim Stammers senior storage analyst at 451 Research.While Hewlett-Packard and IBM/Lenovo appeared to have the most brand loyalty when it comes to hyper-converged systems, the current installed base told a different story, the market researcher found. Asked which hypervisor product they were using for virtualization, 49 percent said Microsoft Hyper-V while 29 percent VMware's vSphere.While Hyper-V, for instance, was found to be not as prevalent in large enterprises as vSphere, the researchers singled out OpenStack as a potential player as enterprise cloud platforms gain momentum in the datacenter. \"The OpenStack community appears to be perceived as a light at the end of the tunnel in the enterprise journey toward the cloud and its gathering momentum like an oncoming freight train,\" the market research predicted.The researcher also found a link between early adopters of server virtualization and interest in SDS and hyper-convergence. Those with virtualized infrastructure were found to be twice as likely to consider either or both of the storage upgrades. For instance, 37 percent of respondents who said their infrastructure was nearly or fully virtualized said they are likely to consider SDS.The SDS and hyper-convergence study was commissioned virtual datacenter vendor Maxta Inc. and chipmaker Intel, whose venture capital arm is an investor in Maxta. Two hundred data center purchasing managers at companies with revenues between $100 million and $1 billion were surveyed by 451 Research during August and September.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/pi_00622-420x300-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-13-at-12.37.31-PM.png"
    ]
}