{
    "title": "OpenIO Takes on x86-based Object Storage TCO",
    "author": "Doug Black",
    "date": "2016-12-15 00:00:00",
    "text": "OpenIO has announced a new object storage appliance that combines its open source storage software with an ARM-based Marvell chassis that OpenIO said is priced at a fraction of x86-based storage technologies.Aimed at cloud and telco service providers, media companies and large government organizations, the SLS-4U96 costs $0.008/Gb/month for a 96X8TB box, well below average pricing of around $0.02/Gb/month.SLS-4U96 appliances can host up to 96 nano-nodes, each with a dedicated 3.5-inch HDD or SSD and dual 2.5Gb/s SGMII ports, dual 6-port 40Gb/sec Ethernet backend Marvell Prestera family switches for external connectivity and N+1 power supplies. OpenIO said the SLS (ServerLess Storage) platform brings together power-efficient ARM CPUs, high capacity drives and a 40Gb/s Ethernet backend for a petabyte scale-out storage system in a 4U chassis.“We believe this architecture is better suited for scale-out object storage,” Marie Ponseel, co-founder and COO of ObjectIO, told EnterpriseTech. “The economics and capabilities (including power consumption) make this more attractive than most x86-based object storage solutions.”Officially launched as a company last year, OpenIO has been in the object storage arena since the early days of the technology back in 2006. The company said its software-defined hyperscale storage platforms are used by 60 million end-users in massive production environments.OpenIO said the SLS-4U96 will compete Ceph, Scality, SwiftStack and other object storage providers.“SLS has all the features of our next generation object storage platform and it is easier to manage, and more power efficient,” said Laurent Denel, CEO of OpenIO. “With a cost that can be as low as $0.008/GB/month over 36 months for a fully populated configuration, and the ease of use of our software, a single SysAdmin can easily manage a large multi-petabytes environment at the lowest TCO”.This new product is based on the Marvell Armada-3700 Dual core ARM v8 @1.2Ghz based nano-node architecture. Hardware features of the SLS-4U96 include from three to 96 hot swappable nano-nodes per appliances for a maximum of 960TB with 10TB HDDs or 1152TB with 12TB HDDs; and two six-port 40Gb/s port switches backend for both client connectivity and direct chassis interconnect, which can scale up to more than 10PB per rack. Software features include: automatic nano-node discovery, setup and load balancing, local and geo-distributed object replica or erasure coding and S3, Swift and Native object APIs. The appliance is compatible with existing x86 based SDS installations.ObjectIO said its nano-node architecture is a new approach to the management and maintenance of scale-out storage infrastructures. The failure domain is limited to a single nano-node, equivalent to a disk, that can be replaced as needed when failure occurs. New or replaced nano-nodes join the SLS resource pool without needing a rebalancing operation a process the company said takes less than 60 seconds.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/OpenIO_logo-370x228.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/Marie-Ponseel.jpg"
    ]
}