{
    "title": "Investment Magnet Cohesity Launches Hyperconverged Secondary Storage Platform",
    "text": "High performance storage is the strongest growth sector in the advanced scale computing realm – we see this in analyst reports and in last week’s moved by Cray toward acquiring Seagate’s ClusterStor high end storage line. Storing the tsunami of new data in cost effective ways, and accessing it in manageable ways, is the imperative of the moment for companies with ballooning big data analytics and machine learning workloads.Today brings news from Cohesity, the money magnet that’s attracted more than $150 million from venture firms and corporate investors, that it has announced its newest hyperconverged platform for the secondary-storage market, one estimated at $50 billion. The company said Cohesity Orion 5.0 represents the first system to manage both structured and unstructured data in a single system, rather than siloed data pools, while also combining end-to-end data protection on a distributed, “infinitely scalable” architecture.Cohesity drew attention in April when the four-year-old company, founded by Mohit Aron (an early Google employee and co-founder of the hot hyperconverged solutions company Nutanix), announced it had raised a $90 million series C round, for a total funding of $160 million. Among the other investors were HPE and Cisco, two companies not normally found in the same room together.“Our vision (is) to consolidate, simplify, and significantly reduce the costs associated with inefficient secondary storage silos that dominate enterprise IT today….,” said Aron. “We can now deliver to our rapidly expanding roster of clients not only simplicity in data protection, but also big data storage, which together typically comprise over half their total capacity.”The Orion 5.0 platform is managed through a single-pane-of-glass UI, the company said, and is designed to address problems caused when companies use two different sets of storage solutions – one for data backup and recovery and another to archive large quantities of structured and unstructured data, such as customer records to large-scale media content. With the larger size and diversity of data that must be stored, separate storage infrastructures results in copies of the same data accumulating on each point solution, and force administrators to work across multiple UIs to handle separate data use cases.Cohesity’s emphasized the “radical efficiencies” offered by Orion 5.0 functioning as a single hyperconverged platform “…by serving double duty as a backup solution and searchable archive for large amounts of structured and unstructured data. By combining historically siloed solutions on a single platform that works across cloud and on-premises infrastructure, Cohesity Orion enables companies to simplify administration, reduce overall data copies, accelerate search and   retrieval, and dramatically lower storage costs.”“The fully indexed and searchable platform gives IT administrators easier access and greater insight into their data and eliminates redundant copies. Data is now instantly accessible to any application and user via standard protocols including NFS, CIFS/SMB, and S3. This drives extremely efficient data and infrastructure re-use across data protection, archive, content repositories, test/dev, and analytic workloads,” the company said.Cohesity’s platform scales incrementally to cover overall storage requirements as they increase and decrease, instead of requiring separate environments for each specific workload. Cohesity released findings by the Taneja Group that Orion demonstrated linear, non-disruptive scaling through 256 nodes, 3 petabytes capacity, and 80 GB/s throughput.\n“Cohesity helped us to easily back up the growing critical and mandatory-to-save data, like police department videos from their vehicle and body cameras, and made those files instantaneously available upon request,” said Ben Price, director of administrative and residential IT at the University of California, Santa Barbara. “From backup to recovery, analytics to monitoring and alerting, Cohesity consolidated everything under a simple, easy-to-access user interface.”Cohesity said Orion 5.0’s C3000 Dense Nodes improve storage capacity by 7X and rack density by 2X, and are suited for large content repositories or data protection workloads that require the lowest storage cost per terabyte, such as media content or financial and medical records.Other features include simultaneous multiprotocol access to content via NFS, CIFS/SMB, and S3 protocols; global in-line deduplication and compression across all content, including S3 object storage; global indexing and search for rapid retrieval; and file system and user quotas with audit logs.As part of the announcement, Cohesity and Applied Computer Solutions said they recently closed a large deal with a leading U.S. healthcare provider to consolidate more than 20 standalone backup servers into a scale-out solution that cut backup time windows in half.“Cohesity recoveries are now seconds rather than hours, and together we saved our client over 50 percent in costs compared to continuing with their legacy vendor,” said Kevin C. Prahm, VP/sales and operations at ACS US. “We’re excited to see the fifth generation of Cohesity data protection software now expanding to include the massive content storage required by our largest healthcare accounts for retention of critical patient data.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-08-01 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/shutterstock_584233447-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/Cohesity-logo.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/Cohesity-Mohit-Aron-150x150.jpeg"
    ]
}