{
    "title": "Violin Fattens Up Flash Arrays, Adds Data Services",
    "author": "Timothy Prickett Morgan",
    "date": "2014-06-24 00:00:00",
    "text": "All-flash array maker Violin Memory is striking up the data orchestra with its new Concerto 7000 series, adding a suite of data management software to its arrays and extending the capacity of the units by a factor of four.The Concerto 7000 arrays have been in development for some time, and Eric Herzog, chief marketing officer at Violin Memory, tells EnterpriseTech that key customers have been looking at the machine since late last year to get a feel for the new features it would have. The company has been actually selling it since June 1, even though the formal announcement was this week.With the Concerto 7000 arrays, Violin is offering that suite of data management software in a number of different configurations that reflect the needs of its customers. Customers who already have a Violin 6000 series array, which scales up to 70 TB of raw flash capacity, and who are perhaps using Oracle Replication Manager or other tools to replicate their databases do not need to buy the Concerto suite. In other cases, such as supporting virtual desktop infrastructure or remote offices, replicating data is also not something that is necessary between arrays. In those cases, just having a plain vanilla Violin 6000 array will do the trick.But, Herzog says, there is an entirely different set of customers who want to have various data services embedded in the arrays and spanning multiple workloads, and it is for these customers that Violin Memory created the Concerto 7000s. To that end, Violin Memory went out and licensed the source code to a set of tools that did replication, snapshotting, and other services – it will not divulge who it licensed the software from – and had a team of 30 engineers tweak it and tune it for the Violin Memory Operating System, or VMOS, that is at the heart of the all-flash arrays.\"This software we licensed is generic in that it works with anybody's storage, and it ran naked on servers not on arrays,\" Herzog explains. \"We did a fair amount of work to integrate it specifically with our storage and VMOS because otherwise it would be slow. Some stuff is just as we bought it, but most of it has been modified.\"Here's the Concerto software feature set:There are a lot of necessary features for enterprise-grade all flash arrays, but you will note that there is still no in-line de-duplication. But with those brainy head nodes in the box, it is possible that de-dupe will be coming in the future. It is a tick box for a lot of enterprise shops, and other all-flash arrays have it. The table does not point out that Concerto adds in-flight encryption, but it does. All of these services are configurable on a LUN-by-LUN basis.The Concerto 7100 has two head nodes running the Concerto stack – the pair is for redundancy – and has two storage shelves with a total of 140 TB of capacity. The shelves do not have the Violin switched fabric between them to cluster the shelves because it is not necessary. The Concerto 7200 has four shelves, and the switched fabric linked the four shelves and their 280 TB of capacity together. The 6200 series flash storage shelves are linked to the controllers by fast, dual-path Fibre Channel links,To refresh your memory on the speeds and feeds of the storage shelf: It can provide over 500,000 IOPS at 500 microseconds latency with a mixed, heavy workload and does not have hotspots the way some all-flash arrays based on solid state disks do because the virtual flash memory modules (based on 19 nanometer MLC) used by Violin are all linked into a giant virtual pool and VMOS spreads data around the flash. VMOS also has wear leveling and vRAID data protection, and does transparent garbage collection in the background as data gets crufty on the array. The shelf burns about 500 watts and comes in a 3U rack.Unlike a lot of all-flash array suppliers, Violin gives out list prices so you at least know where to start bargaining from. The starter Concerto system with 35 TB of raw capacity costs $595,000 with another $25,000 for a license to the base Concerto software stack, so you are in for $620,000. If you load up a Concerto with all four storage shelves and 280 TB of capacity, that costs $2.56 million and then you will pay another $105,000 for the full set of Concerto software, so call it $2.66 million before haggling.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/lightning-flash-370x261.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/violin-memory-concerto-7000-table.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/violin-memory-concerto-7000.jpg"
    ]
}