{
    "title": "Dell Shows Off Avoton Atoms In Cold Storage Array",
    "text": "Intel launched its first respectable server-class Atom processor, the \"Avoton\" Atom C2000, three weeks ago, and one of the interesting new uses for the eight-core chip is not in servers, but rather in dense storage arrays for hosting infrequently accessed data.Cold storage arrays, as the devices are known colloquially, are where you put the kinds of files that clutter our hard drives and flash drives on our personal devices. The stuff that you rarely access, but you never want to lose, such as a digital photo from a fishing trip a few years back. Dell is not against using Avotons in microservers, but thinks that cold storage may be the killer app for processors such as the Avotons and their rising 64-bit competitors based on ARM RISC designs.\"We have been tooling around with low-power servers, and we spent a great deal of time with SeaMicro, too,\" says Drew Schulke, product marketing manager for Dell's Data Center Solutions division. \"But we think there is a compelling play for storage, especially cold storage, which has low utilization. You just don't want that on expensive storage arrays.\"DCS makes custom servers and storage for hyperscale data center operators, who tend to want everything unnecessary stripped out of their boxes to reduce cost, increase compute or storage density, and reduce cost. DCS has the lion's share of the hyperscale server market (around 60 percent most quarters), and was the primary supplier of gear to Facebook before it decided to do its own designs and launch the Open Compute Project and release its server and data center designs to the world. And it is Facebook that gets cited most when talking about the need for cold storage. The Social Network stores 300 million new photos a day from its billion-plus users, but the company says that only about 8 percent of those photos are every accessed once the initial flurry of activity is over.Enterprise companies have similar issues for all kinds of documents, scans, pictures, and every other kind of digital object you can imagine. And so cold storage arrays with a certain amount of intelligence, low cost per unit of capacity, and very low power consumption could take off in the data centers of the world.The DCS1300 designed by Dell is aimed at the early adopter hyperscale data center operators, and there is little question that something like this will eventually be commercialized. Here is the mechanical design of the array:And here are the feeds and speeds of the array:The array uses the big (3.5-inch), fat (3 TB or 4 TB), and cheap (well compared to SAS drives anyway) SATA disks that stingy customers love and will probably never be replaced by 2.5-inch SAS drives any time in the future. It crams a dozen of these drives into a rack-mounted chassis that is 1U tall plus has two 2.5-inch disks to boot up an operating system and storage software on the unit. In the case of the customer for which this storage array was designed, it ran the open source Ceph distributed file system. Ceph is very clever in that it can do both block storage. which databases and certain kinds of applications require, and object storage, which other kinds of applications prefer.The interesting bit is that Dell has soldered three four-port Maxwell SATA controllers onto the system board for the array controller to drive those dozen disks, which then feed back into the PCI-Express bus and on back to the Atom C2000 processor.",
    "author": [
        "Timothy Prickett Morgan",
        "https://www.enterpriseai.news/author/tpm/"
    ],
    "date": "2013-09-19 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Editor's Picks: Systems",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/editors-picks-systems/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Avoton",
        "Dell"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/avoton/",
        "https://www.enterpriseai.news/tag/dell/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/dell-dcs-avoton-cold-storage-array-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/dell-dcs1300-mechanical.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/09/dell-dcs1300-features.jpg"
    ]
}