{
    "title": "Kubernetes Gains Stability, New Features",
    "text": "This year’s first update of the de facto standard Kubernetes cluster orchestrator includes 38 enhancements, of which nearly half have been declared “stable” features.Kubernetes 1.18 released this week is billed by maintainers as a “fit and finish” release that includes 15 stable enhancements, 11 moving to beta testing and 12 at the “alpha” stage of development and testing. They emphasized the orchestrator’s growing reliability for handling production workloads as well as a steady stream of enhancements designed to “expand existing functionality.”The flourishing Kubernetes community has been averaging about four version releases a year. Earlier versions released last year addressed issues like installation and configuration. Meanwhile, enterprise adoption of Kubernetes has also exposed security vulnerabilities.Among the new beta features is a topology manager designed to align so-called non-uniform memory access between CPU cores and networked devices. Previously, resource allocation among CPUs and devices was done independently.The topology manager “will allow [a] workload to run in an environment optimized for low-latency,” the Kubernetes release team noted in a blog post.Among the new “alpha” features is a container storage interface proxy for Windows. The CSI proxy allows “non-privileged” (but pre-approved) application containers to perform privileged storage operations on Windows. Hence, drivers for those container storage interfaces are now supported on Windows via the new proxy.Kubernetes 1.18 releases notes are here.The latest version is available for download on GitHub.As the Kubernetes ecosystem prepares its next quarterly release, other parts of the community are addressing lingering security concerns within cloud-native platforms built around Kubernetes. For example, Aqua Security released an open source tool earlier this month designed to scan image registries running on Docker and the enterprise version of Mirantis Docker.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2020-03-27 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Edge/IOT",
        "Security",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Edge/IOT",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/edge-iot/",
        "https://www.enterpriseai.news/category/security/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider-edge-iot/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "CSI proxy",
        "Kubernetes",
        "Kubernetes 1.18",
        "topology manager",
        "Windows"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/csi-proxy/",
        "https://www.enterpriseai.news/tag/kubernetes/",
        "https://www.enterpriseai.news/tag/kubernetes-1-18/",
        "https://www.enterpriseai.news/tag/topology-manager/",
        "https://www.enterpriseai.news/tag/windows/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/K_1.18-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}