{
    "title": "HP 3PAR 7450 Is All-Flash For The Price Of Disk",
    "author": "Timothy Prickett Morgan",
    "date": "2014-06-13 00:00:00",
    "text": "In the early days of flash-accelerated storage, it was all about making a subset of the data available on storage that had higher I/O so applications would speed up. With the falling cost of flash storage and more sophisticated software to compress, de-dupe, and provision data on flash arrays, now all of the talk is turning to getting rid of disk arrays for whole swaths of workloads in the datacenter. With the new 3PAR StoreServ 7450 all-flash arrays announced this week at the Discover 2014 shindig in Las Vegas, HP says you can do just that.The 3PAR array lineup has entry StoreServ 7200 and 7400 arrays for price-conscious customers where datasets and performance are relatively modest, and the StoreServ 10400 (two racks and four controller nodes) and 10800 (four racks and eight controller nodes) for when scale is the important factor. The new all-flash StoreServ 7450 sits smack dab in the middle of the lineup, and is designed for workloads where performance is the key factor. But, as Craig Nunes, vice president of marketing for the HP Storage division, explains to EnterpriseTech, thanks to a number of new technologies, that this performance can be had at the price of a raw disk array.All-flash arrays are one of the fastest growing parts of the storage market, with IDC projecting that sales will grow at a 59 percent compound annual growth rate between 2012 and 2016, hitting around $1.6 billion at the end of that projection period. This may be one of those projections that turns out to be too pessimistic, if the economics that HP and many of its rivals in the all-flash array space turn out to be true.With the StoreServ 7450, HP focused on ramping up the performance of the 3PAR arrays while at the same time radically bringing down the cost of effective capacity on the machine. The first thing HP did, says Nunes, is switch to consumer-grade multi-level cell (MLC) memory. This is a 1.6 TB SSD, which HP sources from multiple suppliers. These flash arrays have plenty of excess capacity because of the wear issue with flash memory, and the drives have their own wear-leveling algorithms to keep the effective capacity the same while at the same time not jeopardizing the data stored on the flash. Nunes says that HP's techies have worked with its SSD suppliers to hook the 3PAR data spreading algorithms with the wear-leveling algorithms in the drives to free up some of that excess capacity without affecting the long-term viability of the SSD. This feature, called adaptive sparing, boosts the capacity of the SSD drive to 1.92 TB, which is in essence 20 percent of free capacity. So the switch to consumer-grade MLC plus adaptive sparing has brought the cost of flash down significantly.With last year's StoreServ 7400, customers could have made their own all-flash array using enterprise MLC solid state drives, but they would have been paying something on the order of $15 per GB (usable, not raw capacity), which is somewhere between five and six times the cost of a disk array fronted by some flash cache to accelerate some of the data into and out of servers. Adding block-zero, in-line de-duplication to the arrays cut that $15 per GB down to around $13 per GB, and shifting to cMLC cuts it way down, to around $5 per GB. Adaptive sparing cuts it further down to about $4 per GB, and then the thin cloning provides a 10:1 compression and thin de-duplication adds another 4:1 compression, and together they drop the cost of an all-flash array down to under $2 per GB. This, says Nunes, is about what you pay per usable GB for a disk array using 15K RPM SAS drives today that doesn't have compression or de-duplication on it.One of the things that HP is hammering on is the fact that the all-flash StoreServ 7450 delivers predictable and consistent sub-microsecond response time across a wide range of I/O operations per second loads. This is accomplished by scaling across multiple controllers, and the 7450 machine can have up to four controllers to cope with the IOPS. But as you can see, even a fully loaded 7450 will start seeing the latency spike as the machine approaches 1 million IOPS:Here is how HP stacks up its StoreServ 7450s against the competition:Nunes says that an EMC VMAX 10K with 250 TB of usable capacity with auto-tiering of data across disk and flash will take up three racks of space, which is 25X that of a single enclosure of the StoreServ 7450 all-flash array. The EMC VMAX will also cost 3.8X as much to acquire and use eight times as much power. As for Pure Storage, which just launched its 250 TB all-flash array a month ago, Nunes says it will take six of the FA-450 arrays to yield around 1.5 PB of usable capacity, but that a fully loaded StoreServ 7450 can hit 1.38 PB of usable capacity with four controllers and do so at a cost of $1.68 per GB. (That is an all-flash array with 460 TB of raw capacity, 25 percent overhead, and a 4:1 compaction ratio overall.)That cost per GB is about half of the cost of the Pure Storage setup, according to Nunes. The configurations cost around $360,000 for the Pure Storage all-flash arrays compared to around $170,000 for the HP StoreServ 7450. That 1.92 TB drive will be available in July and will cost $14,315 a pop, by the way. The thin clone and thin de-duplication software that pushes the flash cost down to disk will be available in September at no charge.I searched online for about 30 minutes, yet was unable to find any hard numbers about this product’s read or write IOPS, and read or write latency. It would be good to see some real benchmarked numbers instead of marketing BS.Can you provide the parameters that were used to generate the IOPS and latency graph? What I/O size, what percent read/write? Random/Sequential?BenHi Ben – Timothy is no longer with EnterpriseTech and I’m not sure where he got these figures. From reading the article, it appears they were provided by HP. Since this article is 12 months old, HP may have removed this info from its website if it’s out of date — for example, if the specs have changed. I don’t know who he worked with at HP so my suggestion would be to contact the vendor directly about these questions. Sorry I can’t provide more assistance… if you have questions about articles that appear after my arrival (in April 2015), I should be a LOT more helpful!",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/hp-3par-storserv-7450-370x241.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/hp-3par-7450-latency.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/hp-3par-7450-comparison.jpg",
        "https://secure.gravatar.com/avatar/5e40de48bc249961e5e8d2e057033d98?s=60&r=g",
        "https://secure.gravatar.com/avatar/622c9a4eb2054fa8d3bb770688467c5f?s=60&r=g",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=60&r=g"
    ]
}