{
    "title": "AI Career Notes: December 2019 Edition",
    "text": "In this monthly feature, we'll keep you up to date on the latest career developments in the enterprise A.I. community -- promotions, new hires, and accolades. Here's the A.I. career news for early December:Ari Berman\nBioTeam, Inc. promoted Ari Berman to chief executive officer. In his new role, Berman will expand the company's reach into the scientific and business communities, helping to bring innovative solutions to leading life sciences organizations. Since joining BioTeam, Berman has worked to increase the company's impact on science by taking on problems and guiding its consulting team towards more collaborative approaches in their service delivery. In 2016, Berman was promoted to V.P. of consulting to apply the lessons he learned with government applications to other industries.\"I am honored and incredibly excited to be taking on my new role at BioTeam,\" Berman said. \"Biomedical and life sciences research is entering a transition from the information age to the analytics age. The industry's explosion in data generation has led to high-performance computing (HPC) being a core research requirement in nearly all modern research programs. New and more efficient applications are being developed, and data has taken center-stage in biomedicine's discovery process. As BioTeam's new CEO, I will focus even more on the science that we support, and will continue to utilize innovative technology to assist the scientific organizations we serve.\"Jeff Clarke\nDell Technologies announced that Jeff Clarke was named chief operating officer (COO) and vice-chairman. Clarke recently served as vice chairman of products and operations. As COO, Clarke will retain his current responsibilities leading Client Solutions Group, Infrastructure Solutions Group, Global Supply Chain, and working with Pat Gelsinger, VMware CEO, to drive innovation and integration across Dell Technologies.In his expanded role, Clarke will have oversight of day-to-day business operations working closely with Dell and the Dell Technologies' executive leadership team. Clarke and the team continue to report to the CEO.Rajeeb Hazra\nCorporate V.P. of Intel's Data Center Group and G.M. for the Enterprise and Government Group Rajeeb Hazra announced he is retiring after more than 24 years at the company. Hazra has been with Intel serving under technical and management leadership roles in Intel Labs and the Digital Enterprise Group.Hazra obtained a Ph.D. in Computer Science from the College of William & Mary in Virginia and then joined Intel in 1995. Hazra contributed to the development of several Intel products that earned him the Intel Achievement Award for his contributions. Before Intel, Hazra worked for Lockheed Corporation and, prior to that, five years he was at NASA's Langley Research Center in Hampton, Virginia. He currently holds 15 patents.John Joseph\nDATAMARK announced the addition of John Joseph as a public safety GIS [geographic information systems] expert. Joseph brings more than 20 years of geographic information systems and public safety experience to the team, with his most recent roles at Motorola and GeoComm supporting NG9-1-1 initiatives. In his role at DATAMARK, Joseph will work with prospects and customers who need to look beyond the basic requirements of traditional data silos for computer-aided dispatch and 9-1-1.Joseph will lead engagements with consultants, partners, and customers to further expand DATAMARK's presence in the western region and across the industry. He will work with key stakeholders to evaluate their specific needs for the transition to NG9-1-1 using DATAMARK's suite of public safety GIS products and services to meet their objectives while supporting current E9-1-1 systems.Jon Masters\nNUVIA announced the addition of Jon Masters as vice president of software. Masters joins NUVIA from IBM/Red Hat, where he was chief Arm architect. He created and led the team that built Red Hat Enterprise Linux for Arm from the ground up.He also drove various industry standards for Arm servers, and open interconnects, as well as cross-industry security efforts. Masters is a published author and has co-founded several industry working groups around the advancement of high-performance server technology, as well as driven technical specifications for Arm in the datacenter.Stuart Pann\nGroq Inc. announced that Stuart Pann was appointed to its board of directors. Pann currently leads H.P.'s supply chain and previously led Intel's General Management Group, where he was responsible for pricing, revenue, and forecasting for the microprocessor and chipset operations.\"I'm delighted to join the board of a company as interesting and innovative as Groq,\" Pann said. \"There's a lot of excitement and growth, but also some hype in the A.I. sector right now. When I came to understand Groq's new architecture and saw the company's first silicon, early customer traction, and deployment to production capability, I knew that this company had placed itself at the forefront of chip architecture innovation, with a proven execution ability to match. I'm thrilled to be a part of this exciting team. Groq is a game-changer.\"Chad Rodriguez \nStream Data Centers announced that it is welcoming Chad Rodriguez as the company's new vice president of Network and Cloud. Rodriguez has 17 years of experience in the telecommunications industry and will directly shape how the company works to diversify its connectivity options to meet the growing bandwidth and local access needs of its customers.\"The data center space in the U.S. market has certainly matured with enterprises seeking not only pure colocation options but also scalable, diverse solutions for connecting to other networks and service providers, particularly the public clouds,\" Rodriguez said. \"Our goal at Stream is twofold. First, we want to hone our relationships with Tier I providers by providing them with more customized solution sets as they look to establish on-ramps as close as possible to their enterprise end-users. Second, we can then blend this result with Stream's deep-seated real estate expertise to further develop our sites as increasingly important connectivity hubs, bringing robust and redundant services to our customers. I am excited to be a part of the Stream team and look forward to supporting the company on our roadmap into the global digital future.\"Sarah Rollins\nDATAMARK announced Sarah Rollins, former GIS analyst, and educator at West Safety Services (now known as Intrado) joined DATAMARK as a public safety GIS [geographic information systems] expert. In her new role, Rollins will consult with clients to evaluate their needs and communicate how DATAMARK's public safety GIS products and services will meet objectives, support current E9-1-1 systems, and aid in the transition to NG9-1-1. Rollins earned her B.A. and M.A. in Sociology with a Concentration in Organizational Behavior from Stanford University. She also holds a certificate in GIS from Front Range Community College, elected to the National Society of Leadership and Success.At Intrado, Rollins managed the GIS elements for 9-1-1 dispatch mapping solution deployments ranging from multiple cities to county-wide, establishing, and maintaining effective working relationships with governmental departments, agencies, and private businesses. She also helped public safety organizations apply GIS and prepare data for NG9-1-1 using her extensive knowledge of 9-1-1, E9-1-1, and NG9-1-1 operational workflows. Also, Rollins was a project lead for 9-1-1 dispatch mapping solution deployments, software installations and training, and technical support.Vito Salvaggio\nJitterbit announced that it has brought on Vito Salvaggio as senior vice president of product management to shepherd development and long-term product strategy. He has been a product manager and led product management teams for more than 25 years in technology areas including mobile, web analytics, log management, IoT, digital media, DevOps, and more.Salvaggio held positions at four startups and two mid-size companies, along with tech giants, including Apple and H.P. His work helped drive five successful exits for venture-backed companies, three acquisitions, and two IPOs. He is an advisor and mentor to three startups and participates in MIT's Venture Mentoring Service.Joe Walsh\nContentserv announced the appointment of Joe Walsh as the company's new sales director for the North American operations area. Walsh's primary task is to grow Contentserv's customer base and ensure overall customer satisfaction in the region. Walsh has a 23-year career working in companies such as Sterling Commerce, Codifyd, Perfion, where he played a role in helping the company establish a foothold in the US PIM software market. Walsh has worked in Master Data Management and Enterprise Data Quality, handling sales management, integrated marketing, and channel development roles.\"I was very intrigued by Contentserv's focus on product experience management,\" Walsh said. \"As organizations embark on digital transformation, they also need to consider their customers' end-to-end journey, which goes well beyond transactions. Contentserv understands this well; that is why they continue to develop the technology that supports these transformations. Furthermore, when I met and spoke with the team, it was apparent that Contentserv has all the right tools to succeed in the U.S.\"Keith White\nHPE has announced that Keith White will take over the HPE Greenlake business unit. White comes to HPE from more than 20 years at Microsoft, where he helped to drive the growth of Azure over the course of seven years. Most recently, he was head of the Intelligent Cloud, Worldwide Commercial Business unit.\"As we transform to become the premier edge-to-cloud platform-as-a-Service company,\" said Phil Davis, president of Hybrid IT at HPE, \"Keith’s role is fundamental to ensuring HPE continues to deliver a seamless cloud experience for our customers’ and partners’ workloads, at the edge, across all of their clouds, and in the data center.\"Do you know someone that should be included in next month’s list? If so, send us an email at oliver@taborcommunications.com. We look forward to hearing from you.",
    "author": [
        "Mariana Iriarte",
        "https://www.enterpriseai.news/author/mariana/"
    ],
    "date": "2019-12-09 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Software",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "BioTeam",
        "Contentserv",
        "DATAMARK",
        "Dell Technologies",
        "Intel",
        "Jitterbit",
        "Stream Data Centers"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/bioteam/",
        "https://www.enterpriseai.news/tag/contentserv/",
        "https://www.enterpriseai.news/tag/datamark/",
        "https://www.enterpriseai.news/tag/dell-technologies/",
        "https://www.enterpriseai.news/tag/intel/",
        "https://www.enterpriseai.news/tag/jitterbit/",
        "https://www.enterpriseai.news/tag/stream-data-centers/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/shutterstock_career_notes-685x320.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/ari_headshot_2017_adjusted-300x300-150x150.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/jeff-clarke-Dell-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Intel-Raj-Hasrah-1119-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/John_Joseph-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Jon_Masters-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Stuart_Pann_Groq-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Chad-Rodriguez-150x202.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Sarah_Rollins-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/vito-salvaggio-3-360x360-150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Joe_walsh_150x150.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/keith-white.fw_-150x150.png"
    ]
}