{
    "title": "EMC Finally Joins the All Flash Party",
    "author": "Isaac Lopez",
    "date": "2013-11-14 00:00:00",
    "text": "A year and a half after the purchase of XtremIO, EMC has finally joined the all-flash game with its XtremIO scale-out storage array, which has started shipping.Joining a field largely pioneered by start-ups, EMC’s entrance on the field is noteworthy in that it marks the first general purpose all-flash array from an OEM that has been designed from the ground up to be powered by flash. Based on the technology it gained when it purchased XtremIO, the new storage array is effectively commodity housing for a slew of software technologies that EMC says delivers performance without the efficiency and durability issues that flash vendors have wrestled with.The base XtremeIO unit is an x86-based system in a 6U storage enclosure called an X-Brick, which will initially ship with 10 TB of capacity. X-Bricks containing 20 TB of flash capacity are expected to be available early 2014. The company says that the arrays are capable of delivering up to one million fully random I/O operations per second (IOPS) with over 250 TB of effective capacity in a single XtremIO cluster with inline deduplication. Each clustered box scales from two to eight controllers and up to 128 cores, which EMC says will allow customers to scale out the XtremIO arrays linearly for both performance and capacity.While the hardware is standard, off-the-shelf stuff, it is the software that EMC says makes the system shine. The XtremIO array has four different software technologies that are geared to work in concert to improve performance, reduce the cost per IOPS, and simplify administration for its workloads, which include flash array fare such as VDI, virtual servers, massively consolidated databases, and test/dev environments.These four technologies include: “Because of the way that they manage data, EMC can present fairly compelling arguments that the performance of this box is very consistent,” said Tim Stammers, a senior storage analyst at 451 Research, who told EnterpriseTech that the entrance of EMC in the all-flash arena sets the stage for a shake-up. “There are about seven or eight  startups, some of them heavily funded, that have been selling all-flash arrays for the last two to three years. The EMC XtremIO is the one that everybody has been waiting to see because the competition will be really hard for the startups to beat. Next year is going to be make or break for these startups, many of which aren’t going to survive.”Certainly, the flash array athletes are feeling the heat as many rushed to put out statements welcoming EMC to the party ahead of the XtremIO announcement. One of the more interesting ones came from Pure Storage CEO, Scott Dietzen, who recently guided his company through the successful closing of a $150 million Series E funding round. Dietzen took to the company blog to draw parallels between the two, saying that it is no accident that XtremIO and Pure Storage look very similar – a particularity which he intimates is going to “bifurcate the all-flash market” between the EMC and Pure Storage haves versus what he says is the rest of the field of have-nots.Dietzen explained that the winning recipe for all-flash storage includes high availability, non-disruptive upgrades, inline, submillisecond deduplication, and no overhead for snapshots and clones. Dietzen wrote: “Pure and XtremIO are the only all-flash arrays offering this feature set today, and I submit that our mutual competitors are still a long way from delivering the above recipe (despite the fact that these items are now included in most vendor’s roadmaps). The last place you want to be as an early-stage company is looking up at EMC because you are behind on critical features, but that is arguably where the rest of the all-flash field wakes up tomorrow, with Pure Storage the notable exception.”Dell took a different tact, releasing an ESG Lab Validation report, which compared its all-flash Compellent SC8000 with other major vendors, and concluded that Dell is the most affordable array on the all-flash block. ”The cost per gigabyte of the high-capacity MLC devices that Dell recently started shipping is about the same as the cost per GB of the low-capacity 15K RPM hard drives that have typically been used to address I/O performance problems,” wrote Brian Garrett of ESG. \"This is a surprising and significant development given the fact that the price differential between flash and disk remains significantly high for the enterprise-class SLC and MLC that has been deployed to date in most disk array solutions.”To that point, EMC is remaining mum on the pricing of the XtremIO offering, except to say that they will be priced competitively with the other flash arrays in the market.While the company is not yet revealing pricing, EMC has said that it has already sold 10 PB of “effective deduplicated capacity” through its Directed Availability program, which they launched this past March. Among its customers is E*TRADE, who says that it is using XtremIO in its application environments.“We are deploying XtremIO to get us to the next level of performance – but even more than that provide us with new levels of usability for our applications,” said Russ Norman, senior manager of systems engineering at E*TRADE. “With these lower storage latencies, we can process higher numbers of IOPS and move larger amounts of data. We found on average writing to the XtremIO array to be between 0.25 to 0.3 millisecond response time, with reads being somewhere around 0.2 millisecond. This was, consistent with workloads between 100,000 to 200,000 IOPS. In addition, XtremIO’s thin provisioning and inline deduplication were selling points for us also for cost and capacity efficiency.”So what is next for an all-flash field that features a ripe field of startups, OEM vendors who are retrofitting storage boxes to play in the all-flash game, and now the 800 pound gorilla of storage joining the fray?  More competition, said Stammers, noting that NetApp’s purpose-built FlashRay is expected to be the next entrant into the crowding market.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2013/11/xtremio_profile-370x290.jpeg"
    ]
}