{
    "title": "Dell Delivers Spectrum of Datacenter Storage Products",
    "author": "Alison Diana",
    "date": "2015-05-06 00:00:00",
    "text": "Dell hopes to address enterprises' current and future storage needs with a flurry of new products, ranging from high-performance data repositories to entry-level arrays.Businesses typically have a mix of traditional architectures and software-defined storage co-existing in the same datacenter, said Alan Atkinson, vice president and general manager of Dell Storage in a press conference last week. \"We are playing to both the new and traditional IT and we're not looking at them as mutually exclusive. It's a customer-driven approach to the problem that needs to be solved. How can we put the right solution in place for the right workload? Depending on workload and personal preference, we see two customers,\" said Atkinson.Software-defined datacenters will reach $77.18 billion in 2020, compared with $21.78 billion this year, according to MarketsandMarkets. Between 2014 and 2020, traditional storage systems – such as appliances and storage software – will decrease to $20 billion in sales from $38 billion, while software-defined storage for capacity-driven storage will grow to $40 billion from $13 billion, software developer Scality estimates. Of that $40 billion, $27 billion will be spent on OEM servers; the remainder will go toward software, Scality said.Looking to build new sales on its existing foundation, Dell on Wednesday took the wraps off three storage products: the Dell Storage SCv2000 Series of entry-class arrays; the Dell Storage PS6610 Series of dense arrays, and Dell Storage with Microsoft Spaces.\"You're seeing a very rapid evolution of our array technology while we're also heavily investing with the software-defined side of things,\" Atkinson said.The Dell Storage PS6610 Series dense arrays provide hybrid flash and hard disk drive configurations, and are designed for large data repositories. They combine 10 Gigabit Ethernet (GbE) and dense storage and can support half a petabyte in one 5U array, and are slated to begin shipping early in the third quarter, according to Dell. The family of arrays comes in three configurations.The devices ship with Dell EqualLogic PS Series Array Software 8.0, which Dell also released today, that includes compression of snapshots and replicas as some of its space-saving features. The software includes VMware vSphere Virtual Volumes integration so enterprises can manage arrays on a virtual machine basis, not per volume or LUN. VMware's solution also makes it easier and most cost-efficient to manage VMs, Atkinson said. The software upgrade will be free to existing customers when it becomes available early next quarter.Dell also expanded its software-defined storage offerings with the release of Dell Storage with Microsoft Storage Spaces. Designed to support Microsoft’s SDS capabilities on Dell’s enterprise-class server and direct attached storage hardware, the scale-out file server (SOFS) solution will be available in five configurations and supports workloads including private cloud deployments, virtual desktop infrastructure, and SQL and Hyper-V environments, Dell said. The offering is set to become available in June.Some organizations have been slow to adopt software defined storage because of incompatibility problems, especially when it comes to integrating new software with legacy hardware, said Travis Vigil, executive director, product management, at Dell Storage. \"The Storage Space Solution is a very flexible, single SKU [that] customers can order, and it is ordered and serviced as a single item,\" he said.Rounding out Dell's product news for the day, the company took the wraps off the Dell Storage SCv2000 Series entry-level arrays, available now. The products, which come in a 2U enclosure, include integrated data protection; RAID tiering; thin provisioning; flash support; data migration services, and multi-protocol connectivity.\"We think a lot of existing SME customers will be interested for small SANs, test environments. The fact you have a common pane of glass to manage everything will be truly interesting to them. You get the price benefit but there's no sacrifice at all on the features of the solution,\" Atkinson said.  Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/Dell-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/Dellchart3-300x93.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}