{
    "title": "Cloudian, Seagate Partner on AI Cloud Storage",
    "author": "George Leopold",
    "date": "2019-06-25 00:00:00",
    "text": "Data storage technology vendors Cloudian and Seagate Technology are teaming on a private cloud storage platform aimed at AI and network edge workloads.The storage partners said they are delivering exabyte scale private cloud storage with much greater densities in a system aimed at “capacity-intensive” workloads requiring tens of petabytes of storage. Cloudian specializes in object storage platforms while Seagate (NASDAQ: STX) provides high-density storage drives.Looking to outdo emerging storage-as-a-service vendors, the partners said Tuesday (June 25) their scale-out storage package delivers up to 83 percent greater density. It combines Cloudian’s object storage software that is compatible with Amazon Web Services’ (NASDAQ: AMZN) Simple Storage Service (S3) with Seagate’s high-density data storage drives.Seagate, Cupertino, Calif., noted that the emergence of the S3 API as a de facto standard for cloud storage motivated its partnership with Cloudian.The storage vendors are betting more customers will shift to private clouds as AI, machine learning, edge and other demanding workloads drive demand for ready access to large data sets. They cited estimates that IT infrastructure spending will jump more than 50 percent between now and 2023 as traditional datacenter spending declines.The partners also make the case the current storage-as-a-service offerings lack the scaling capacity required for “super-capacity” uses cases while traditional storage cannot keep pace with data access requirements.“Private clouds are quickly becoming a viable data storage option in the quest to provide faster data collection and analysis for connected devices,” Seagate noted in a blog post. “Private clouds are critical to enabling the real-time information collected by trillions of devices.”The partners noted that private clouds are speeding data processing at the edge, a configuration requiring faster input and output speeds. Hence, Seagate developed application platforms that store large amounts of unstructured data using object-based storage. Its high-capacity drive bays handle up to 1.6 petabytes of data storage in four rack units “while presenting all storage as a single pool,” the partners said.Storage costs are estimated to be half a cent per gigabyte a month.For its part, Cloudian said its software-defined storage technology would expand access to Seagate’s high-density capabilities previously available to only a few hyperscale storage users.Cloudian, San Mateo, Calif., said the private clouds storage platform will be released next month through the company and its resellers.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-28-at-9.34.16-AM-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}