{
    "title": "Dell Adds Kubernetes Support to VxRail",
    "author": "George Leopold",
    "date": "2019-08-26 00:00:00",
    "text": "Dell Technologies joins the growing list of IT vendors expanding support for the Kubernetes cluster orchestrator with the addition of automated Kubernetes infrastructure deployments via its VxRail running in conjunction with VMware’s container service.VxRail, Dell EMC’s hyperconverged infrastructure for the cloud, will now support Kubernetes “right out of the starting gate” running with VMware’s PKS container service on Cloud Foundation, the partners said this week as Dell kicks off its annual company showcase in San Francsico.The company’s (NYSE: DELL) hyperconverged infrastructure integrates software-defined storage, like those in its VxRail appliance, with computing and networking as a way to reduce latency and accelerate performance.Dell said it worked with its VMware unit (NYSE: VMW) and PKS development partner Pivotal Software (NYSE: PVTL) to enable simpler Kubernetes provisioning, providing what the partners said is a container orchestration approach that complements datacenter virtualization. The result is Kubernetes support running on the Dell cloud.The automated Kubernetes container service running on Dell’s VxRail includes VMware’s NXT security and networking framework along with “smart” life-cycle management. That feature is intended to update and patch components “from one known good state to the next,” the partners said Monday (Aug. 26).Dell said the addition of Kubernetes support targets cloud-native workloads running on multiple clusters, adding automation and security features.Performance enhancement to Dell’s VxRail platform include Intel (NASDAQ: INTC) and Dell EMC PowerEdge server technologies designed to boost performance and reduce latency. The company said it is also offering Nvidia (NASDAQ: NVDA) GPUs for graphics, machine learning and virtual datacenter workstation options.These enhancements would be linked via Fibre Channel connections handling workloads with large storage requirements along with I/O intensive jobs running on VxRail clusters.Dell is the latest infrastructure vendor to offer simpler provisioning of the de facto standard Kubernetes cluster orchestrator. Meanwhile, containers specialist such as Docker have embraced the orchestrator while offering ways to reduce the complexity associated with the configuration and management steps required to deploy production-grade software.Last fall, VMware acquired Heptio, the startup launched by the creators of Kubernetes.Dell’s support for Kubernetes also expands on a partnership between Dell EMC and Ubuntu software vendor Canonical announced last December that combines Dell PowerEdge servers and Ethernet switches with Canonical Kubernetes implementation and its Ceph software-defined storage.Dell said its cloud platforms with Kubernetes support will be available in September.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/07/cloud-generic-shutterstock-1370256563--370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}