{
    "title": "SAP HANA Gets Intel Memory Boost on Google Cloud",
    "author": "no author",
    "date": "2018-07-23 00:00:00",
    "text": "Intel Corp. and SAP are joining forces with Google to offer cloud virtual machines supporting persistent memory for in-memory workloads running on the SAP HANA relational database manager.The partners announced the Google cloud virtual machines would support the upcoming release of SAP HANA workloads running on Intel’s Optane DC persistent memory. Google (NASDAQ: GOOGL)said the cloud virtual machines would be powered by Intel’s (NASDAQ: INTC) next-generation Cascade Lake processor, the successor to its current generation Skylake scalable processor. (Google was the first cloud provider to offer Skylake.)The upgrade would allow SAP HANA (NYSE: SAP) users to expand virtual machine resource sizing, Google said Monday (July 23).The partners said Google Compute Engine virtual machines running on Optane DC persistent memory would almost double memory capacity, helping to expand the number of use cases running in the cloud. Support for Optane was introduced in version 2.0 SPS 03 edition of SAP HANA released in April. (SPS stands for “support package stack.”)Cloud instances running on Optane persistent memory for SAP HANA and other workloads will be available later this year for testing, Google said.The cloud partnership for in-memory workloads comes as Google continues to expand its public cloud offerings  and SAP supports a growing list of enterprise applications in the cloud. Earlier this month, SAP reported steady annual growth in its cloud and software revenue, including a more than 30 percent jump in cloud subscriptions and support revenue.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/database-cloud-logo-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}