{
    "title": "Nimble, Dell, Seagate Unveil Storage, Backup Products",
    "text": "IT professionals' storage options continued to expand this week, as Nimble Storage enhanced its Adaptive Flash product and both Seagate and Dell unveiled cloud backup and replication solutions.On July 15, Nimble Storage added new capabilities to its Nimble Storage Adaptive Flash, such as the ability to deliver an all-flash service level for applications with tough demands for responsiveness; an auto-flash service level for mainstream applications, and a disk-only service level for those applications that need low-cost capacity. Nimble Storage's solution also now includes software-based encryption and a REST API-based extensibility framework, the company said.Enterprises can deliver all-flash services without having to invest in flash-only storage arrays, according to Nimble Storage. This allows organizations to consolidate their storage platforms, reducing costs and complexity, and enhancing IT productivity, it noted.\"You don't have to go out and buy an all-flash array just because one of your applications needs it. Sometimes you may have applications or a batch job which only needs high performance at certain times of day or certain days of the week,\" said Radhika Krishnan, vice president of product marketing and alliances at Nimble Storage, in an interview. \"With Nimble Storage Adaptive Flash, we give customers the ability to turn it on only when needed.\"Nimble SmartSecure software-based encryption allows storage administrators to use data encryption in consolidation and multi-tenant storage environments at no extra cost, according to Nimble Storage. The new feature, which does not need custom drivers or dedicated firmware, allows encryption and shredding on both per-application and per-array levels. The REST APIs enable administrators to create customized reporting and workflows around storage.The cloud-connected Nimble InfoSight management and support engine gives IT visibility into virtual machines, network, and LUN latencies to simplify resource contention issues and improve SLAs. Per-VM monitoring feature InfoSight-VMVision alerts to performance issues, by showing throughput, IOPs, and latency across host, network, and storage.In addition, Nimble Storage provides an integrated data protection package for primary storage, backup, and disaster recovery. The solution allows administrators to take snapshots of newly changed data; administrators can quickly restore snapshots when necessary, the vendor said. To reduce inefficiencies and improve recovery, administrators can store all snapshots and production data on the same array, Krishnan said.\"Oftentimes we find that our customers will snapshot multiple times a day and keep it around for 30, 60, 90 120 days,\" she added.To the CloudFor its part, Seagate today expanded and updated its Hybrid Cloud Data Protection collection, for enterprises through small and midsize business customers. The portfolio now includes Seagate Backup and Recovery Software, Seagate Cloud Backup and Recovery Services, Seagate Backup and Recovery Private Cloud, and Seagate Data Management Services.\"Today our customers and partners are faced with explosive data growth, compliance requirements, the cost and complexity of non-traditional applications like the Internet of Things, big data, and the ongoing transition to software-as-a-service,\" said Mike Palmer, senior vice president and general manager of cloud solutions at Seagate in a statement. \"At the same time IT budgets are not increasing, security threats continue to put organizations at risk and data center operations are taking more time away from the core business. Today we are responding to each of these challenges - through new performance, scale, availability and management solutions, which drive out operational complexity and give our customers and partners time back to run their core business.\"On July 14, Dell took the wraps off AppAssure Replication Target VM for Azure, which enables AppAssure users to replicate backups to the cloud. With Dell's latest offering, IT organizations create a VM replication target for AppAssure backups in the Azure cloud. The solution, which is available in the Microsoft's Azure Marketplace, is designed as a cost-effective alternative to complex secondary and co-location sites, according to Dell.“The solution makes it easy for customers to integrate Microsoft’s leading cloud capability into their backup strategies, allowing them to deploy a replication and disaster recovery target in minutes at a fraction of the cost of traditional replication techniques,\" said Brett Roscoe, executive director and general manager, data protection, Dell Software, in a statement. Managing editor of Enterprise Technology. I've been covering tech and business for many years, for publications such as InformationWeek, Baseline Magazine, and Florida Today. A native Brit and longtime Yankees fan, I live with my husband, daughter, and two cats on the Space Coast in Florida.",
    "author": [
        "Alison Diana",
        "https://www.enterpriseai.news/author/alison/"
    ],
    "date": "2015-07-15 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "azure",
        "backup",
        "cloud",
        "Dell",
        "nimble storage",
        "replication",
        "Seagate",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/azure/",
        "https://www.enterpriseai.news/tag/backup/",
        "https://www.enterpriseai.news/tag/cloud-2/",
        "https://www.enterpriseai.news/tag/dell/",
        "https://www.enterpriseai.news/tag/nimble-storage/",
        "https://www.enterpriseai.news/tag/replication/",
        "https://www.enterpriseai.news/tag/seagate/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/07/backup-370x290.jpg",
        "https://secure.gravatar.com/avatar/c9a7c1bfbf00a21541cc0388b22c36c4?s=80&r=g"
    ]
}