{
    "title": "NetApp Eyes Unstructured Data with Storage Deal",
    "author": "George Leopold",
    "date": "2020-03-09 00:00:00",
    "text": "As companies consolidate storage infrastructure in public clouds, market consolidation among storage vendors continues apace as vendors offer expanded offerings designed to boost cloud access to growing data volumes.The latest example is NetApp’s (NASDAQ: NTAP) deal announced on Monday (March 9) to acquire Talon Storage, which specializes in software-defined cloud storage that among other scenarios makes data accessible to branch offices.NetApp, Sunnyvale, Calif., said the acquisition would combine its Cloud Volumes framework with Talon’s software-defined storage platform designed to centralized data storage in the cloud while allowing consistent access at remote locations.The result, said Anthony Lyle, general manager of NetApp’s Cloud Data Services unit, is “a unified footprint of unstructured data that all users access seamlessly, regardless of where in the world they are, as if all users and data were in the same physical location.”Terms of the acquisition were not disclosed.The deal for Talon would add new remote capabilities to NetApp’s portfolio of cloud data services, including its file storage service running on Microsoft Azure and other public clouds. The company notes that its Azure NetApp File service handles cloud workloads without code modification.Along with the file storage service, NetApp said Talon’s storage software will be integrated with its Cloud Volumes offerings.NetApp was among the early hybrid cloud vendors to endorse the Kubernetes cluster orchestrator with its acquisition of StackPointCloud, developer of a Kubernetes cluster orchestration service for multiple clouds. The September 2018 deal gave NetApp a Kubernetes service to support the application orchestration framework of its Data Fabric platform.Among other features, that combination enabled multi-cloud application orchestration with persistent storage for stateful applications.The acquisitions are designed to bolster NetApp’s efforts to help customers consolidate unstructured data in the cloud that can be organized in files shared across enterprises. Along with Azure, the company’s file sharing service also runs on Amazon Web Services and Google Cloud.NetApp and Talon Storage previously partnered to create a data fabric for managing unstructured data. The platform unveiled last year incorporated Talon’s software-defined data storage fabric as a way to consolidate unstructured data into an enterprise-wide directory structure visible to all users. Active data sets are cached locally to reduce latency.The file caching capability “automatically updates the active data set on the local storage volume based on actual usage patterns and typically reduces storage capacity requirements by 70 to 80 percent at the [network] edge,” the partners said in a blog post describing their data storage partnership.“The future of data storage is not just in cloud storage or virtualization,” added Jaap van Duijvenbode, Talon Storage’s product director, in a separate post. “To future-proof data storage, an intelligent file management system is needed.”George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/data-storage-shutterstock-1085748272-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}