{
    "title": "Hyperion: Deep Learning, AI Helping Drive Healthy HPC Industry Growth",
    "text": "To be at the ISC conference in Frankfurt this week is to experience deep immersion in deep learning. Users want to learn about it, vendors want to talk about it, analysts and journalists want to report on it. Deep learning undergirds Hyperion Research’s optimistic HPC market forecast, with the former IDC HPC analyst team noting that deep learning (and high performance data analytics) is driving HPC into organizations that aren’t even aware they’re “doing HPC.”Adoption of deep learning is one of several “Dark Energy” forces expanding the HPC universe in ways that are difficult to observe directly, said Hyperion’s Bob Sorensen. Other compute- and data-intensive forces pushing industry growth are security anomaly detection, financial services applications and the offloading of HPC workloads to the public cloud.While non-traditional HPC procurements are difficult for analyst groups like Hyperion to track, what can be observed is that traditional enterprise servers don’t have the computational capabilities for advanced AI workloads, such as training neural networks for deep learning tasks, Sorensen said. Right now, deep learning is mostly happening at the big internet and social media FANG (Facebook, Amazon, Netflix and Google [now Alphabet], and Microsoft) companies, along with autonomous vehicle companies. Its broader adoption in the enterprise over the next several years is a major reason Hyperion is bullish on the HPC industry between now and 2021.The analyst group announced today the overall HPC server market worldwide in 2016 generated record revenues of $11.2 billion, growth of 4.5 percent over 2015. Hyperion divides the HPC server market into four price-based sectors (see slide), with the supercomputer category (cost: more than $500,000) taking the lion’s share with $4.1 billion.Growth of this kind is expected to continue, with Hyperion projecting the total HPC server industry to reach $14.8 billion by 2021, led by growth in the supercomputer category followed, in order, by divisional, departmental and workgroup systems.Taking the HPC ecosystem as a whole – including servers, storage, middleware applications and services – the industry had revenues of more than $22 billion in 2016. With an expected CAGR of 6.2 percent, Hyperion expects the total worth of the sector to reach $30 billion by 2021. Storage is expected to be the fastest growing sector, with an annual growth rate of 7.8 percent.Hyperion reported that HPE has established itself as the no. 1 HPC server vendor, with sales of $3.8 billion (of the $11.2 billion total) last year, followed by Dell EMC at $2.0 billion, Lenovo at $909 million and IBM at $492 million. As for HPC market sectors, the government/national labs led with purchases totaling $2.1 billion, followed by university/academia at $1.9 billion. Among industrial sectors, computer-aided engineering led with $1.2 billion, then bio-sciences at $1B, followed by geosciences at $844 million.At the pinnacle of the supercomputer sector is the drive to exascale computing. Hyperion examined the four leading countries/regions (the U.S., China, the EU and Japan) and said China may win the race, predicting a Chinese system delivering exascale at peak by 2020 (possibly by 2019) and sustained exascale performance by 2023. It expects the U.S. to deliver peak exascale by 2020 and sustained by 2023. The EU and Japan are projected to reach sustained exascale performance by 2023 or 2024. Joseph noted that China’s exascale system may be powered by Chinese processors, rather than American.While innovations developed for exascale systems will work their way into the broader government/academic/industrial sectors, near term HPC industry growth will be driven by demand in industrial and commercial sectors adopting more power HPDA (high performance data analytics) and deep learning capabilities.Hyperion’s Steve Conway said 200 companies in recent years “have moved up to HPC because of competitive forces and requirements – complexity and time criticality – have pushed them up into the HPC competency space. These are companies that for the most part have hit a wall with enterprise services technology. They don’t have HPC data centers and they’re not going to build them, they’re inserting HPC at the right point into the live workflow in the enterprise.”Sorensen said a typical scenario is a traditional company using conventional servers, “and you have a business intelligence capability that’s just inundated with data – more types of data, more data coming in faster, and people wanting results in real time or nearly so. So you’re being dragged kicking and screaming into the HPC environment. You’re coming at it (HPC) from an entirely different orthogonal direction. You’re doing HPC, you just don’t know it yet.”Hyperion also expects HPC capabilities on public cloud computing platforms to generate increasing demand, though for now it’s showing more potential than actual results. Conway said Hyperion found that 64 percent of HPC sites run “some” jobs in public clouds, up from 13 percent in 2011. But those sites only run 7 to 8 percent of their total workloads in the cloud, roughly the same as six years ago.“It’s a phenomenon of the public cloud in HPC is getting very wide but not very deep yet,” he said. But it’s a market with strong potential, Conway said. Hyperion asked HPC data center managers how difficult it is to decide which jobs to keep on premises and which to send off-prem. In a high percentage of cases, Conway said, the response was that it’s not difficult at all.“If the clouds are architected to be more friendly to HPC jobs, people are going to send them more jobs,” Conway said. “There’s not a big educational effort (by the public cloud providers) that’s needed here, it has to do with the appropriateness of the jobs.”",
    "author": [
        "Doug Black",
        "https://www.enterpriseai.news/author/doug/"
    ],
    "date": "2017-06-19 00:00:00",
    "cats": [
        "Slider: Cloud",
        "Slider: Front Page",
        "Storage",
        "Systems"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/storage/",
        "https://www.enterpriseai.news/category/systems/"
    ],
    "tags": [
        "HPC",
        "Hyperion"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/hpc/",
        "https://www.enterpriseai.news/tag/hyperion/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/Data-Visualization_shutterstock-675x380-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/Hyperion-ISC17-HPC-server-market.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/ISC17-Earl-Joseph-169x300.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/Hyperion-ISC17-HPDA.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/Hyperion-ISC17-HPC-in-Cloud.png"
    ]
}