{
    "title": "Google Predicts Big Year for ‘API-ification’",
    "text": "Google Cloud introduced an API platform last July designed in part to give developers better visibility into the interconnections between, and the inner workings among, enterprise applications and data hosted in hybrid and multi-cloud deployments.The Apigee platform developed with partner Informatica, an integration services specialist, is billed as a “cross-cloud API management platform.” Among other goals, Apigee seeks to free developers from mundane coding tasks so they can “invoke business integration processes” to accelerate deployment of enterprise applications.The API initiative also illustrates Google Cloud’s (NASDAQ: GOOGL) ongoing focus on nuts-and-bolts cloud tools targeting emerging frameworks like agile microservices.In a series of predictions about how APIs will shape the IT market in the coming year, Google’s Apigee team predicted increased standardization of APIs while noting that APIs and microservices are becoming synonymous. In a blog post, they noted “a much larger number of APIs are to be found internally within enterprises as interfaces between software systems and teams.”As APIs enter the mainstream, Google argues they will kickstart new enterprise architectures driven by microservices that structure applications as collections of loosely coupled, targeted services.“Key to realizing the promise and benefits of microservices architecture will be successfully designing and building reusable, decoupled services that deliver scalability and agility for the business, with the right level of governance and lifecycle management capabilities,” Google noted. “The availability of appropriate tooling for supporting and debugging microservices architecture will be key to its success in the enterprise.”As AI and machine learning transform the API landscape, Google predicts greater standardization around emerging technologies like GraphQL, an open-source data query language for APIs developed by Facebook (NASDAQ: FB). GraphQL is seen as a promising framework for delivering reusable services and APIs.Another magnet for API standardization is GRPC, a Google-backed open-source framework designed to enable clients and server applications to communicate “transparently” with the goal of making it easier for developers to build “connected systems.” A building block of the de facto standard Kubernetes cluster orchestrator, GRPC is seen as an emerging option for delivering core business applications.Meanwhile, Google and others note the rise of AI-driven API traffic, ranging from calls made by Internet of Things devices to voice applications. The resulting huge boost in API calls generated by algorithms or machine intelligence brings with them greater security threats.“Whether it’s for crypto-mining or for credential stealing, we expect APIs to continue to bear the burden of machine-driven traffic, which will burden backends unless the right security is built into APIs,” Google noted.As AI enters the mainstream, APIs are increasingly seen as one way of building useful enterprise applications. Hence, Google predicts the rise of “API-driven AI” in which developers build a model while a separate team leverages that work using APIs. “We expect this trend to accelerate,” Apigee said. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2019-01-29 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Slider: Cloud",
        "Slider: Front Page",
        "Slider: Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "API-driven AI",
        "APIs",
        "Facebook",
        "Google Apigee",
        "GraphQL",
        "GRPC",
        "hybrid cloud. Google Cloud",
        "microservivces",
        "multi-cloud"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/api-driven-ai/",
        "https://www.enterpriseai.news/tag/apis/",
        "https://www.enterpriseai.news/tag/facebook/",
        "https://www.enterpriseai.news/tag/google-apigee/",
        "https://www.enterpriseai.news/tag/graphql/",
        "https://www.enterpriseai.news/tag/grpc/",
        "https://www.enterpriseai.news/tag/hybrid-cloud-google-cloud/",
        "https://www.enterpriseai.news/tag/microservivces/",
        "https://www.enterpriseai.news/tag/multi-cloud/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_API-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}