{
    "title": "Software-Defined Storage is Being Redefined",
    "text": "If it's true that there has been very little technology innovation in the development of enterprise storage technology and that current technologies are failing to keep pace with the rise of data analytics, then this week showed that a gaggle of vendors are focused on leveraging software-defined networking technologies to address the current storage gap.Most potential solutions are proprietary while others are taking an open-source route to busting up the proverbial \"data silos\" that prevent companies from creating value from petabytes of structured and, increasingly, unstructured data.Among the most intriguing approaches to filling the storage gap is the emergence of distributed storage platform startup Hedvig from stealth mode this week. The startup appears to have the technology and firepower to move software-defined storage from the drawing board to the datacenter.“What we need now is a totally different kind of [storage] technology and an approach because the workloads are demanding that,” asserted Hedvig CEO and Founder Avinash Lakshman, the former Amazon and Facebook engineer.But Hedvig's splashy unveiling of its proprietary solution was just one of several software-defined storage offerings that surfaced in recent days. On the open-source front, Red Hat this week rolled out its software-defined storage portfolio intended to merge its versions of Ceph storage with Red Hat Gluster storage.Red Hat said its goal of its unified storage portfolio is to manage emerging storage workloads using open source software and commodity hardware.The open source leader, which reported robust annual earnings this week, began targeting software-defined storage with its 2011 acquisition of Gluster Inc. Last May, it acquired Ceph provider Inktank Inc. This week's announcement from Red Hat signals the integration of Inktank Ceph Enterprise and Red Storage Server into its software-defined storage portfolio.Like Hedvig, Red Hat is emphasizing that its scale-out software-defined storage package can run on commodity hardware and can handle a variety of enterprise storage workloads. Moreover, the Ceph storage offering targets cloud infrastructure workloads like OpenStack, Red Hat stressed.Elsewhere, hyper-scale software-defined storage vendors are attempting to shift the focus to datacenters, as in \"software defined datacenters.\" With that approach in mind, software-defined storage vendor Scality rolled out the latest version of its RING software this week intended to accelerate the introduction of software-defined storage in the datacenter. The update also included connectivity options for Windows Server and various distributions of Linux, including Red Hat and Ubuntu.Others also have targeted the software-defined datacenter, including Hewlett-Packard, which rolled out a virtual storage appliance last summer as an integrated storage option for its Helion OpenStack cloud platforms.HP's approach to introducing software-defined storage to the datacenter focuses on pitching its virtual storage appliance as a way to fill gaps in the datacenter created by legacy hardware-oriented storage. That approach also seeks to optimize emerging datacenter technologies like all-flash storage arrays, HP said.Which approach will eventually win out is anyone's guess. Perhaps the answer is a combination of all of the above. But the need for greater and more flexible storage will only grow as datacenters fill up with unstructured data that must be sorted and sifted.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-03-27 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Software",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Hedvig Inc.",
        "HP",
        "Red Hat",
        "software defined data center",
        "storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/hedvig-inc/",
        "https://www.enterpriseai.news/tag/hp/",
        "https://www.enterpriseai.news/tag/red-hat/",
        "https://www.enterpriseai.news/tag/software-defined-data-center/",
        "https://www.enterpriseai.news/tag/storage-2/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/10/red-hat-storage-server-logo-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}