{
    "title": "Google Adds Deep Learning Containers to AI Lineup",
    "text": "Deep learning containers, a service recently rolled out in beta by Google, aims to help AI developers package the storage and computing dependencies required for services like its Kubernetes Engine when developers find themselves prototyping locally while using multiple cloud tools.The goal is to ensure that those dependencies are packaged correctly and consistently for use with container runtimes handling emerging AI applications, the search giant (NASDAQ: GOOGL) said.Along with making it easier to scale deep learning and other applications in the cloud or on-premises, the new Google Cloud container service also comes with optimized versions of TensorFlow. That feature can be used, for example, to train models on Nvidia (NASDAQ: NVDA) GPUs or deploy them on Intel (NASDAQ: INTC) CPUs.In a recent blog post, Mike Cheng, a Google software engineer, noted that deep learning containers come with a preconfigured Jupyter Notebook environment. The cloud provider bills the new service as delivering a “consistent and portable environment” for accelerating development and deployment of machine learning projects“At some point, [developers] will likely need a beefier machine than what [a] local machine has to offer,” with local data and packages that must be installed in that environment, Cheng said. “Deep Learning Containers can be extended to include local files, and then these custom containers can then be deployed in a Cloud AI Platform Notebooks instance” or Google Kubernetes Engine.Google promotes its Kubernetes Engine as a way to accelerate the deployment and updating of applications and services by provisioning cloud resources based on a user’s computing, memory and storage requirements.As for the new deep learning container service, users can also deploy AI applications using Docker Swarm, other distributions of Kubernetes and Google Compute Engine.Along with TensorFlow, the container service also supports PyTorch and scikit learn, the machine learning framework for Python. Google said it plans to soon add support for other popular frameworks. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "date": "2019-07-11 00:00:00",
    "cats": [
        "AI/ML/DL",
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/ai-ml-dl/",
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Application containers",
        "deep learning",
        "deep learning containers",
        "Google Cloud",
        "Kubernetes",
        "Kubernetes engine"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/application-containers/",
        "https://www.enterpriseai.news/tag/deep-learning/",
        "https://www.enterpriseai.news/tag/deep-learning-containers/",
        "https://www.enterpriseai.news/tag/google-cloud/",
        "https://www.enterpriseai.news/tag/kubernetes/",
        "https://www.enterpriseai.news/tag/kubernetes-engine/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/07/DL_containers-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}