{
    "title": "HSGT Unveils Cloud Datacenter Storage Tools",
    "author": "George Leopold",
    "date": "2014-09-10 00:00:00",
    "text": "Enterprise storage specialist HGST unveiled a slew of new flash products as the Western Digital unit seeks to fashion of \"flash fabric\" that promises to help move datacenter storage closer to computing and applications.While its latest PCIe SSD series and accompanying server-side clustering and volume management software stresses performance, HGST also on Sept. 9 rolled out several high-capacity HDDs and a new initiative called \"active archive\" that seeks to scale storage and access as data volume soars on the cloud.HGST said its latest series of Ultrastar SN100 PCIe SSDs target datacenter virtualization, application and database acceleration. The flash drives are being offered as add-in cards as well as 2.5-inch drives storing up to 3.2 terabytes. \"We see flash as a more pervasive technology\" and HGST is now \"delivering flash as a platform\" via its flash fabric approach, noted Mike Gustafson, general manager of HGST's Flash Platform Group.The SSD flash family along with clustering and management software are said to allow clustering of up to 128 servers and as many as 16 PCIe storage devices to deliver multiple shared volumes of flash storage up to 38 terabytes.Gustafson added that the company expects demand for PCIe-based SSDs to grow among enterprises implementing server-side flash in conjunction with flash-optimized applications.Along with extending its enterprise flash storage partnership with Intel, HGST raised a few eyebrows in announcing that it is going with Toshiba as the NAND vendor for its \"flash fabric\" approach. Gustafson said only that Toshiba's current MLC NAND Flash offering was better suited to mixed rewrite workloads and HSGT wouldn't announce additional performance details until later.The Intel partnership combines HGST's enterprise storage devices with Intel NAND flash technology. The storage company said it is also working with a third NAND supplier, Micron Technology. \"All of the NAND vendors are not created equal\" at each technology node, Gustafson added.HGST President Mike Cordano stressed at the top that the unrelenting shift of datacenter workloads to the cloud is driving storage requirements and that operators must now decide \"What's it worth to keep it?\" Hence, HGST's mantra is \"data storage scalability\" as it seeks to bring flash storage closer to the computing power in datacenters that run applications.HGST also is betting on a new storage category as datacenter volumes grow. The company estimates that more than 75 percent of new cloud applications involve big data analytics. Hence, its \"active archive\" push seeks to scale storage capacity in datacenters by among other things leveraging current HDD storage and the addition of \"scale out\" software.While HGST said it wasn't ready to disclose details of the underlying technologies behind the active archive platform, Dave Tang, general manager of HGST's Cold Storage Solutions Group, claimed a five-fold increase in storage density and power efficiency compared to similar cloud scaling solutions along with up to 10 petabytes of storage capacity per datacenter rack.Tang also announced related deals with object storage specialists Amplidata and Avere Systems.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/HGST_flashfabric-370x290.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}