{
    "title": "IBM Launches Container Service Around Watson",
    "text": "A new IBM cloud service targeting the development and deployment of cognitive applications will utilize the Docker container engine running on the Kubernetes container orchestrator.IBM's container service running on its Bluemix application development cloud was among a batch of cloud and related Watson data analytics products along with an OpenStack partnership unveiled this week at a company event in Las Vegas. The company (NYSE: IBM) also said it would roll out a new beta version of its Watson cognitive computing \"discovery service\" in April designed to identify patterns in large datasets.Meanwhile, the new container service will combine Docker and Kubernetes to automatically provision and monitor application containers. The service is targeted at developers building cognitive tools that incorporate \"real-time security intelligence,\" the company said Monday (March 20).The Kubernetes cluster orchestrator would be used to automate \"critical parts of an app's environment,\" explained Jason McGee, vice president of IBM Cloud. \"Building micro-services with containers helps developers to do what they do best – invent – by creating and stitching together different services that work in tandem.\"Leveraging Kubernetes cluster automation would free developers from the burden of managing Docker containers while building new cognitive applications, the company added. The new service also includes native Kubernetes APIs built on Bluemix that will run on different cloud infrastructures.IBM is among the growing list of open source contributors to the Google-backed Kubernetes project, which is emerging as a leading container orchestration platform. IBM said its new cloud service combines Kubernetes management capabilities with the Docker engine to enable developers to write code within a container and deploy it to multiple apps. That capability also allows developers of cognitive services and Watson APIs to see where and when code is running.The container orchestration tools are among more than 150 services and APIs available on IBM's Bluemix public cloud development platform. Those tools are being used to development applications ranging from the Internet of Things to data analytics.Those tools are also being combined with Watson cognitive services such as the new discovery tools aimed at reducing \"data janitor\" work. The analytics service incorporates Watson AI capabilities with tooling and APIs used to index large sets of company data. That internal data can then be combined with public data provided by IBM.Other IBM announcements this week included a series of blockchain services used to track transactions and running on its cloud-based \"hyperledger fabric.\"The company also announced collaboration with Red Hat on OpenStack deployment, including support for Red Hat virtualized and cloud workloads running IBM's private cloud. The partnership also includes certification for running Red Hat's OpenStack platform and Ceph storage on the IBM private cloud.The ability to extend on-premise workloads to OpenStack via the IBM private cloud is touted as accelerating adoption of hybrid cloud infrastructure, the partners said.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-03-21 00:00:00",
    "cats": [
        "Cloud",
        "Data Analytics",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/data-analytics/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "cognitive computing",
        "containers",
        "Docker",
        "Hybrid Cloud",
        "Kubernetes",
        "OpenStack",
        "Watson"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/cognitive-computing/",
        "https://www.enterpriseai.news/tag/containers/",
        "https://www.enterpriseai.news/tag/docker/",
        "https://www.enterpriseai.news/tag/hybrid-cloud/",
        "https://www.enterpriseai.news/tag/kubernetes/",
        "https://www.enterpriseai.news/tag/openstack/",
        "https://www.enterpriseai.news/tag/watson/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/shutterstock_368761736-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}