{
    "title": "EMC Targets Mid-Market With All-Flash Arrays",
    "text": "EMC Corp.'s all-flash storage family unveiled this week at a company event targets mid-sized enterprise IT deployments while bringing cloud-based flash storage performance to the datacenter.Meanwhile, networking partners announced support for EMC's (NYSE: EMC) new Unity all-flash storage family.EMC's Unity all-flash family offers file and block storage at a price point—under $18,000—that eyes datacenters operated by small- and medium-sized enterprises. The storage leader is promising a three-fold performance increase over its previous generation VNX arrays, along with the ability to deliver 300,000 IOPS and scale up to 3 petabytes of storage.Along with an all-flash configuration, Unity storage is available in a hybrid array format along with software-defined and converged configurations, the company said this week. The \"purpose-built\" all-flash array configuration targets datacenters while the hybrid configuration is intended for specific business requirements.The software-defined version incorporates file and block storage along with data management features so Unity can be deployed as a virtual appliance in the datacenter. Finally, a converged version combines EMC's block storage configurations that are available now.EMC said Unity is available immediately, with an all-flash configuration starting at less than $18,000. Hybrid array configurations start at under $10,000. \"Unity is squarely focused at the external storage use cases that start small—into the less than $10K bands, and with all-flash configurations that start at $18K—and go up to 500 SSDs/HDDs,\" the company noted in a blog post.EMC also announced partners for its Unity launch, including networking specialist Brocade (NASDAQ: BRCD) and managed IT services specialist Presidio Inc.In conjunction with the Unity launch, Brocade announced Tuesday (May 3) that EMC will incorporate its Gen 6 Fibre Channel and IP networking storage technologies. Both could be used to as a network foundation between datacenter servers and Unity all-flash and hybrid storage arrays. The partners stressed that the combination could help eliminate bottlenecks associated with mixed workloads running on flash-based arrays.The Brocade storage-networking portfolio for Unity arrays also is available now via EMC's channel partners.EMC's move in the all-flash market illustrates the storage technology's migration into the datacenter and the growing demand for flash performance. Still, storage rivals argue that, according to one, EMC \"missed the mark\" by not providing critical storage features such as data deduplication and compression. \"Dedup\" is a data compression technique used to eliminate duplicate copies of repeating data. It is also referred to as \"single-instance storage.\"\"Flash alone does not solve the majority of the root causes responsible for performance issues in the datacenter,\" countered Dan Leary, vice president of San Jose-based predictive flash storage vendor Nimble Storage. \"When performance wavers, the common assumption is that storage is the culprit,\" Leary continued, citing industry studies arguing that the majority of applications performance issues have little to do with storage.\"Identifying and proactively resolving these performance issues before they occur requires deep data analytics and machine learning,\" Leary argued.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2016-05-04 00:00:00",
    "cats": [
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash arrays",
        "All-flash storage",
        "block storage",
        "EMC",
        "enterprise datacenters",
        "Unity"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-arrays/",
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/block-storage/",
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/enterprise-datacenters/",
        "https://www.enterpriseai.news/tag/unity/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/Screen-Shot-2016-05-04-at-11.38.37-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}