{
    "title": "HPE, Hedvig Target Hybrid Cloud Storage",
    "text": "A day after announcing lackluster quarterly results as IT hardware demand declines, Hewlett-Packard Enterprise and software-defined storage startup Hedvig Inc. announced a hybrid cloud storage platform customized for HPE servers.The partners said Thursday (June 1) they have initially bundled Hedvig's software-defined storage with HPE's Apollo 4200 servers to create a distributed storage platform aimed at enterprises deploying private, hybrid and multi-datacenter clouds. The platform is available in 48- and 96-terabyte configurations.Targeting \"rack-scale infrastructure,\" Hedvig said its software-defined approach leverages HPE servers geared toward data-intensive cloud workloads. Its multi-protocol approach seeks to collapse disparate storage tiers through support of block, file and object storage interfaces in a single API-driven platform.The approach is also designed to provision storage from different hypervisors or application container infrastructure.Running on HPE hardware, software and services, Hedvig added that the combination supports private cloud storage for VMware (NYSE: VMW) vSphere, Microsoft (NASDAQ: MSFT) Hyper-V and other hypervisors. The storage platform also supports hybrid cloud storage services running on Amazon Web Services (NASDAQ: AMZN) Google Cloud Platform (NASDAQ: GOOGL) and Microsoft Azure.With persistent storage emerging as a key requirement for container infrastructure, the partners also stress support for stateful container storage for Docker as well as micro-services and DevOps.The partnership with Hedvig, Santa Clara, Calif., comes as HPE (NYSE: HPE) positions itself to provide all-flash and other storage options in datacenters supporting hybrid clouds. In March, HPE acquired \"predictive flash\" specialist Nimble Storage, and CEO Meg Whitman said this week the company is \"just about now ramping Nimble into our datacenter storage business.\"Hedvig CEO and founder Avinash Lakshman, the former Amazon and Facebook (NASDAQ: FB) engineer credited with creating the Cassandra database, noted that its collaboration with HPE underscores \"the increasing momentum we’re seeing in software-defined storage.\"Hewlett Packard Pathfinder contributed to Hedvig's most recent funding round in March that raised $21.5 million. So far, the startup has attracted $52 million in venture funding.The distributed storage platform is initially available beginning June 5 on Apollo 4200 servers, with availability on HPE Apollo 4500 and ProLiant server variants to follow. Pricing starts at $115 per terabyte of storage per year, plus associated HPE hardware costs, the partners said. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-06-02 00:00:00",
    "cats": [
        "Cloud",
        "Datacenter",
        "Slider: Cloud",
        "Slider: Datacenter",
        "Slider: Front Page",
        "Slider: Software",
        "Slider: Storage",
        "Software",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/cloud/",
        "https://www.enterpriseai.news/category/datacenter/",
        "https://www.enterpriseai.news/category/slider-cloud/",
        "https://www.enterpriseai.news/category/slider-datacenter/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-software/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/software/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "Hedvig",
        "HPE",
        "Software-defined storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/hedvig/",
        "https://www.enterpriseai.news/tag/hpe/",
        "https://www.enterpriseai.news/tag/software-defined-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/shutterstock_cloud_storage-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}