{
    "title": "Data Security Concerns Grow Along with Threats",
    "text": "As Sony Pictures learned the hard way this week, the relatively small cost of backing up your data is worth the expense and trouble. Still, a survey released this week by storage giant EMC found that the vast majority of global enterprises are \"behind the curve\" when it comes to data security.The timing of the EMC survey is propitious as details emerge about of the unprecedented hack at Sony Pictures. Estimates of the amount of stolen data – unreleased films, scripts, employee criminal background checks – range as high as 100 terabytes. Observers were dumbfounded by the revelation that much of the stolen data was not backed up.Underlying the EMC survey is a pitch for greater adoption of advanced data protection tools as a way to reduce the costs and other consequences of data loss. Hence, the survey highlights the fact that 87 percent of businesses surveyed are failing to keep pace with data protection methods while 71 percent don't think they could restore lost data.Among the areas hardest to protect were big data, data stored in hybrid clouds, and data accessed by ubiquitous mobile devices.When it comes to IT spending, the survey found that data protection gets short shrift. For example, U.S. companies spend an estimated $32 million annually on data protection measures, which works out to about 8.9 percent of overall IT spending. Enterprises deemed by EMC to be \"ahead of the curve\" when it comes to data security spend nearly 10 percent of their IT budget to protect or retrieve lost data.Tellingly, 64 percent of respondents acknowledged they had suffered either unplanned downtime or data loss over the last year. While the survey provided few details about data losses (a sore subject with most companies), it's likely security breaches could have pushed the data loss total higher.In any event, two-thirds of the disruptions involved IT outages. Companies categorized as data security \"leaders\" or \"adopters\" managed to cut their data losses while 37 percent of \"laggards\" said they had lost data.The survey also revealed that the average annual data loss per company amounted to 2.33 terabytes, costing each company an average of just over $1 million. (That total was based on 25 hours of downtime per year; total annual downtime was found to be greater for companies with multiple data protection vendors.)Hardware failures were cited most often (53 percent) as the cause of disruptions, followed by power outages (39 percent) and software glitches (38 percent). Security breaches including malware, spyware viruses and botnets accounted for 23 percent of disruptions. As the Sony hack demonstrates, many security specialists expect the number of security breaches to grow as long as standard \"patch and pray\" security policies remain in place.What's to be done? For those companies with a data security strategy in place, backing up data was the primary method use (41 percent). Other strategies included replication, standby servers at remote locations, virtual servers with restart capabilities and \"active-active\" instances of applications running in the cloud, in that order.The survey found no consensus on what technologies were best suited to ensure availability of applications, systems and data. Nearly a dozen strategies were cited, including automatic backup to the cloud, which was most popular (43 percent), along with tape (38 percent) and disk-based backup (36 percent).Many enterprises feel their data is more secure when stored on-premise. The EMC survey bore this out, with nearly a third of respondents saying they store data on-premise in physical servers. Virtual servers and private cloud storage also ranked high. Only 8 percent said they stored \"primary data\" and applications on hybrid cloud platforms, which the survey highlighted as a key source of data security concerns.Indeed, for applications and platforms running without data recovery schemes, only mobile devices (78 percent) were cited more as \"hardest to protect.\"Hence, the EMC survey argues that \"backup storage-as-a-service\" is emerging as the best way to protect data in the cloud. Fifty-three percent of respondents said they are already backing up data in cloud while 34 percent said they planned to in the future.Other emerging storage options include \"archive-as-a-service\" and \"data recovery-as-a-service,\" the EMC survey found.The storage vendor said it interviewed 3,300 IT decision makers in 24 countries. It ranked China and Hong Kong as having the highest percentage of businesses \"ahead of the maturity curve\" on data protection.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2014-12-03 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "archive",
        "data",
        "EMC",
        "Security"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/archive/",
        "https://www.enterpriseai.news/tag/data/",
        "https://www.enterpriseai.news/tag/emc/",
        "https://www.enterpriseai.news/tag/security/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/03/sap-hana-logo-2-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/12/emc-data-loss.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}