{
    "title": "Storage Startup Qumulo Raises $40M",
    "text": "An enterprise data storage startup has announced a second funding round along with the addition of industry veterans to its board.Seattle-based Qumulo Inc. bills itself as the next big thing in scale-out intelligent storage. The startup announced Wednesday (Feb. 4) it has raised $40 million in a Series B funding round led by Silicon Valley heavyweights Kleiner Perkins Caufield & Byers. The startup has so far raised $67 million. Earlier investors include Highland Capital, Madrona Venture Group and Valhalla Partners.Qumulo also announced that Sujal Patel, founder of scale-out network attached storage specialist Isilon Systems, is joining its board. Patel sold Isilon to EMC Corp. in 2010 for $2.5 billion. Also joining the startup's board are Kleiner Perkins partner Wen Hsieh and Matt McIIwain, a managing director at Madrona Venture.The startup said it would use the venture funding to expand development of its scale-out network attached storage products as well as cranking up its sales and marketing efforts.Along with Patel, Qumulo said it has recruited ex-Isilon technical managers \"to tackle and change the way enterprises deal with the massive explosion of digital data,\" especially unstructured audio and video.Patel added in a statement that Qumulo's approach to massive scale-out network attached storage software would attack the \"root\" of current storage issues, allowing customers to \"manage the data, rather then managing the storage.\"The startup added that its mission is to store, manage and curate customers' data \"forever.\"The enterprise storage specialist was founded in 2012 by a group of Isilon veterans. It has also attracted storage experts from Amazon Web Services (AWS), Google and Microsoft, the company said.Peter Godman, a former director of software engineering at Isilon, is listed as co-founder and CEO of Qumulo. At Isilon, Godman oversaw several releases of its OneFS distributed file system. He is also credited with bringing the first \"thin-hypervisor based product\" to market.Former AWS engineer Neal Fachan, another Qumulo co-founder, serves as vice president of engineering. Before joining AWS, where he designed database technologies, Fachan helped develop Isilon's OneFS clustered file system. Fachan also serves on Qumulo's board.Other ex-Isilon employees joining Qumulo include CTO Aaron Passey, who served as chief architecture at Isilon Systems. Prior to that stint, Passey designed code for the I/O subsystem for Cray supercomputers.Other Isilon veterans on the Qumulo management team include Mary Godwin, who will serve as vice president of operations, and Brett Goodwin, vice president of marketing.The storage specialist announced an initial $24.5 million financing round in November 2012.Along with soaring data volumes, Qumulo has stressed that network-attached storage approaches can be used to cope with shared, virtualized environments that put tremendous pressure on storage systems.The startup is likely to compete directly with EMC's Isilon scale-out network storage offering.",
    "date": "2015-02-04 00:00:00",
    "cats": [
        "Editor's Picks: Storage",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/Screen-Shot-2015-02-04-at-12.36.44-PM-370x207.png"
    ]
}