{
    "title": "EMC Buys Flash Startup, Rolls Out Hybrid Cloud",
    "author": "George Leopold",
    "date": "2014-05-07 00:00:00",
    "text": "EMC said this week it will acquire privately held DSSD Inc., a secretive developer of a flash storage architecture geared to I/O-intensive in-memory databases and big data workloads.Separately, EMC announced a new hybrid cloud offeringEMC said the DSSD acquisition is expected to close by the end of the second quarter but released no other details of the transaction.The company did say DSSD is expected to operate as a stand-alone unit within EMC's Emerging Technology Products Division. DSSD president and CEO Bill Moore will head the new EMC unit. Moore previously served chief storage engineer at Sun Microsystems, and DSSD co-founder Jeff Bonwick worked with Moore to create the Zettabyte File System (ZFS) while at the company. Sun co-founder Andy Bechtolsheim, who is currently chairman and chief development officer at Ethernet switching upstart Arista Networks, was chairman at DSSD. Bechtolsheim will serve as a \"strategic advisor\" to DSSD, EMC said.Products based on DSSD's rack-scale flash storage architecture are expected to be available sometime during 2015, EMC added. They include in-memory databases such as SAP HANA, real-time analytics, and high-end applications used by government agencies and for research such as genomics, climate analysis, and security applications like facial recognition.EMC said it would target future DSSD products at the fastest tier of multitier storage architectures.EMC began integrating flash drives into enterprise storage arrays in 2008. During the first quarter of 2014, it claims to have sold more than 17 petabytes of flash capacity, up by more than 70 percent over the same period last year.David Goulden, CEO of EMC's Information Infrastructure unit, said in a statement that the company has been working with DSSD for more than a year. EMC lead a Series A investment round in DSSD. The interesting bit about DSSD is that it is working to put together hundreds of terabytes of flash that can be addressed either like memory or disk, providing persistence either way, with an order of magnitude more speed than what is on the market today.Separately, EMC announced a hybrid cloud offering that seeks to bridge the gap between agile public clouds and secure private clouds. The solution would allow customers to \"integrate with multiple public clouds to create a unified hybrid cloud,\" the storage company said.The hybrid cloud product is based on a software-defined datacenter architecture using EMC's storage and data protection tools along with its Pivotal CF platform-as-a-service (the commercial version of Cloud Foundry) and its Pivotal Big Data Suite.EMC said its new hybrid cloud offering currently supports VMware environments and will soon support OpenStack and Microsoft cloud environments.\"Our objective is to make it simpler for IT organizations to deploy well run hybrid clouds in a matter of days and deliver the same or even better agility and efficiency benefits to public clouds,\" Josh Kahn, EMC's senior vice president for global solutions marketing, said in a statement.EMC has been emphasizing speedy hybrid cloud deployments during a company-sponsored event this week in Las Vegas. Company engineers will seek to build a hybrid cloud in less than 48 hours based on the company's hybrid cloud reference architecture. The demonstration will also highlight application mobility through outside providers such as VMware's Hybrid Cloud Service, the public cloud that the virtualization juggernaut has built using its own ESXi hypervisor and vCloud cloud controller.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/lightning-flash-370x261.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}