{
    "title": "IBM Claims No. 1 Commercial Supercomputer with Total Oil & Gas System",
    "author": "no author",
    "date": "2019-06-19 00:00:00",
    "text": "IBM can now boast not only the two most powerful supercomputers in the world, it also has claimed the top spot for a supercomputer used in a commercial setting. The Pangea III, which leverages IBM's Power9 CPU-GPU architecture, will be used by French energy conglomerate Total Group (NYSE: TOT) for oil exploration and “associated revenue opportunities” such as predicting future oil and gas production.In industry rankings, Pangea III achieved 17.9 Linpack petaflops (out of 25 theoretical petaflops), making it the 11th-fastest publicly benchmarked supercomputer. Total said that the new system expands the group’s computing power by almost five -- to 31.7 petaflops -- while boosting system storage capacity by a factor of three, to 76 petabytes. The new IBM powerhouse now becomes Total's most powerful Pangea supercomputer, displacing a 2015 system from SGI (which was acquired by HPE in 2016) as the energy giant's most powerful.As HPC systems increasingly proliferate in commercial markets (industry analyst Addison Snell of Intersect360 Research, said in his recent market update that commercial sectors comprise 58 percent of the HPC market), the energy sector has aggressively embraced supercomputing-class systems. Early last year, soon after HPE announced that one of its systems used by BP was the most powerful commercial supercomputer, Italian energy company Eni took the top spot for commercial supercomputing with an 18.6 petaflops (peak) cluster, called HPC4, also built by HPE -- and, like IBM's Power9 architecture, also incorporating Nvidia GPUs.The new system will help the company “reduce geological risks in exploration and development, accelerate project maturation and delivery and increases the value of our assets through optimized field operations,” said Arnaud Breuillac, president of Total Exploration & Production.IBM Power9-based HPC architecture was used to develop the U.S. Department of Energy’s Sierra and Summit supercomputers, the two most powerful systems in the world (see HPCwire: \"Top500 Purely Petaflops; US Maintains Performance Lead\"); the architecture leverages attached Nvidia GPU accelerators to boost performance while reducing power consumption.IBM was among several bidders seeking to build Pangea III. It teamed with GPU leader Nvidia (NASDAQ: NVDA) to develop a link between Power9 CPUs and Nvidia’s Tesla V100 Tensorcore GPUs. The NVLink connection enabled a 5.6-fold increase in memory bandwidth between CPU and GPU when compared with x86-based machines, the partners said.Total said it would use the added computing horsepower, combined with new algorithms that can handle larger data sets, to produce higher resolution images used to locate energy deposits. Pangea III also will be used by Total to run reservoir simulation methods that integrate data sets on production history to identify additional reserves from a given site. The system also can be used for early evaluation of potential sites for further energy exploration.As IBM targets its Power9 architecture at more commercial customers, David Turek, the company's VP of exascale systems, asserted that “Pangea III demonstrates that IBM Power Systems are not just for the large government or research organizations.”--Editor's note: This story has been updated to include benchmarking results. George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/oil-gas-energy-shutterstock-469457198-370x290.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}