{
    "title": "Dell EMC’s New Servers for Transition to the ‘Disaggregated,’ Software-Defined Data Center",
    "author": "Doug Black",
    "date": "2018-08-21 00:00:00",
    "text": "Dell EMC today launched a new high-performance server line, the PowerEdge MX, that the company said sits squarely in the middle of traditional and next-generation AI-oriented workloads, supporting both with a composable infrastructure that simplifies adoption of data- and compute-intensive technologies (read: GPUs and FPGAs) as they become available. The no-mid-plane design of the PowerEdge MX is built for what Dell EMC calls the disaggregated, or “kinetic,” infrastructure, enabling “optimal use of various IT resources, dynamically adjusting as workload and business needs change.” The company said the new servers will support next generations of technology releases (microprocessors, new storage types and new connectivity), making PowerEdge MX “ready to support fully disaggregated components, down to memory-centric devices such as storage class memory, GPUs and FPGAs, to offer full composability.”\"Computing platforms continue their fundamental transformation in line with the digital transformation journey that most firms have embarked on,” said Matt Eastwood, SVP, enterprise datacenter, cloud Infrastructure and developers, at industry watcher IDC. “Dell EMC PowerEdge MX is a poster child for this transformation as customers look for highly efficient and agile architectures that can easily adapt to a multitude of workloads and future technology advances.\"Designed for the software-defined data center, the PowerEdge MX ecosystem includes a newly designed chassis and “resource blocks” of servers and storage that connect to the infrastructure through a smart I/O fabric. The idea, the company said, is to support “a combination of dense virtualization, software-defined storage, software-defined networking, artificial intelligence and big data projects.” With support for low latency NVMe drives and native 25GbE connectivity, the PowerEdge MX can be configured by customers “to their own requirements and benefit from shared pools of disaggregated resources to respond to changing needs as they happen,” the company said. “By creating on-the-fly hardware capacity, overprovisioning and stranded assets are reduced as performance and efficiency are optimized.”The absence of a mid-plane enables direct compute to I/O module connections, according to Dell EMC, allowing for future technology upgrades without disrupting operations and without a mid-plane upgrade. PowerEddge MX components include: \"While emerging technologies, such as artificial intelligence, IoT and software-defined storage and networking, offer competitive benefits, their workloads can be difficult to predict and pose new challenges for IT departments,\" said Ashley Gorakhpurwalla, president and GM, Dell EMC Server and Infrastructure Systems. \"PowerEdge MX enables a modular approach to flexibly build and combine compute, storage and networking, so organizations can transform their IT in a way that optimizes resources and offers investment protection for future generations of technological advances.\"Dell EMC PowerEdge MX will be available globally beginning Sept. 12.\"The benefits of the new PowerEdge MX mirror our focus on innovation to simplify IT for our customers,” said Francisco Perez, Sr., information technology administrator, Masergy, a technology consultant. “This new architecture includes many features that reduce complexity, such as profile-based deployment and management and intelligent switch configurations. Its future-proof architecture, with a 'no mid-plane' design, eliminates bottlenecks and opens the door to easily accommodate future demands and technology.\"",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/Dell-VMware-EMC-0818-370x290.jpg",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/Dell-EMC-logo-0818.jpg"
    ]
}