{
    "title": "Startup Hedvig Emerges With Storage Platform",
    "author": "George Leopold",
    "date": "2015-03-25 00:00:00",
    "text": "Hedvig Inc., a software-defined storage startup emerging from stealth mode this week after three years of development, is rolling out a distributed storage platform it touts as helping enterprises run virtualized infrastructure as easily as a public cloud service in their datacenters.Hedvig, Santa Clara, Calif., likens its \"mature\" software-defined platform to infrastructure run internally by hyper-scalers like Amazon, Google and Facebook but \"packaged to bring that capability to any enterprise datacenter,\" claimed Hedvig CEO and Founder Avinash Lakshman, the former Amazon and Facebook engineer credited with creating the Cassandra database.The company also said Wednesday (March 25) is has so far raised $12.5 million in venture funding. Seed funding and Series A rounds were led by True Ventures and Atlantic Bridge, respectively. Redpoint Ventures joined in the $10 million Series A round, Hedvig said.The stealthy startup raised $2.5 million in seed funding from True Ventures in June 2013 but decided to remain under wraps until now. After three years of development, Hedvig claims to have come up with a disruptive software-defined storage platform intended to challenge incumbent market leaders like EMC and IBM.Along with a storage architecture designed to consolidate scattered storage resources into a virtualized pool, Hedvig is promising convenience and predictability. The startup claims its distributed storage platform \"adapts to existing storage assets as well as future storage purchases.\" That means provisioning could be reduced to a few clicks rather than hours, days or weeks.The streamlined storage platform is based on Hedvig's patented distributed systems capabilities that collapses several storage layer stacks into a single software platform. That, the startup claims, allows enterprises to decide how to allocate and provision storage resources. The software-defined platform allows storage scaling from several terabytes to petabytes while provisioning storage resources within on-premise, private or public clouds.That elasticity is designed to allow hybrid clusters to grow up to thousands of nodes by adding off-the-shelf x86 and ARM-based servers.Lakshman, who also is credited with co-inventing Amazon Dynamo (which helped fuel the NoSQL movement), said the startup decided to wait until its distributed storage platform was in production before emerging from stealth mode. The platform is currently running at a handful of customers that include Intuit, the Dutch cloud infrastructure provider Dovilo, Fabric4Clouds and others.Given the hype surrounding software-defined anything and a growing list of products that have fallen short of expectations, Hedvig is stressing that its software-defined storage architecture is \"cloud-enabled\" and up to the task of handling hyper-scale and hyper-converged datacenters. The startup also said it is also attempting to address the rising costs of datacenter storage at scale by stressing deployment flexibility. To that end, it is touting provisioning, automation and APIs built into the platform in an attempt to reduce operational costs.Stepped up innovation in the datacenter storage market reflects the enterprise trend toward hyper-scale operations. The software-defined storage market alone is estimated to be growing at a rate that could reach an estimated $13 billion by 2020. The challenge for startups like Hedvig and others is helping enterprises keep pace with scale-out applications and the sheer velocity of change.Lakshman said he launched Hedvig because \"it was apparent that you needed a fundamental change [in storage technology] in order to drive the various changes in the datacenter: the advent of server commoditization, flash [memory] becoming ubiquitous, virtualization becoming all-pervasive. Moreover, there was this cloud mentality that was coming into the picture.\"What we need now is a totally different kind of technology and an approach because the workloads are demanding that,\" Lakshman asserted.Prior to launching Hedvig, Lakshman worked on Cassandra at Facebook for four years. During a three-year stint at Amazon, he helped create its Dynamo database.Hedvig said its storage platform would be generally available during the second quarter. It did not release pricing information, but is offering a perpetual licensing option based on storage capacity and tiered for larger volumes.George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-25-at-11.08.53-AM.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Screen-Shot-2015-03-25-at-12.54.20-PM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}