{
    "title": "One Way or Another, Flash Storage Hits Datacenters",
    "text": "Flash-based storage arrays—whether all flash or hybrid—are making headway in the datacenter as storage administrators charged with coping with exponential data growth hustle to unclog network bottlenecks that remain as a barrier to greater adoption of solid-state arrays.This year has brought a steady decline in several key cost metrics widely seen as keys to greater flash storage adoption. In addition, a handful of flash and software-defined storage startups have emerged in recent months to help ease the transition to flash storage in swollen datacenters. Among them are software-defined storage startup Hedvig Inc., scale-out intelligent storage newcomer Qumulo Inc. and, on the hardware side, all-flash array vendor Violin Memory.Violin's strategy, for example, reflects those of established vendors who claim the price per gigabyte of storage is declining, justifying the investment in the emerging technology and making it, they hope, the storage technology of choice in the datacenter.Skeptics note that the cost of spinning storage media also is declining. While all-flash arrays are well suited to some workloads, hybrid array and architecture vendors insist the solid-state technology still evolving and that fairly sophisticated software is still needed to fully utilize all-flash memory. Hence, questions remain about how long it will take to see a return on relatively pricey all-flash investments.That reality may mean that hybrid arrays that combine flash with spinning media storage represents less risk as a transitional storage technology. That's the pitch of vendors like Infinio Systems Inc., which focuses on virtualized storage. The company's latest hybrid storage architecture released in May seeks to deliver the equivalent of all-flash performance without the higher price tag.The strategy of Infinio (as in \"infinite I/O\") is to leverage existing storage, then \"we bring it back to where it was [when] new at a lower cost,\" explained Scott Davis, Infinio's CTO and former VMWare CTO.Davis also argues that the fastest all-flash arrays have to factor for network latency. \"The network is the bottleneck for flash\" arrays, he stressed. Hence, the four-year-old company based in Cambridge, Mass., argues that storage performance must be brought closer to virtual machines in the datacenter as a way to reduce latency.Still, market watchers remain bullish on the overall \"flash-based\" array market that was predicted to take off this year. For example, IDC reported in January that the global \"flash-based\" array market hit $11.3 billion in 2014 as storage arrays evolved to handle a broader range of complex workloads in the datacenter. Hybrid flash arrays accounted for $10 billion last year while emerging all-flash arrays made up the other $1.3 billion, IDC said.\"The impact that flash-based arrays will have on the datacenter is undeniable as more flash-based platforms are delivering enterprise-class data services, including snapshots, clones, encryption, replication, and quality of service as well as storage efficiency features,\" IDC reported.\"The most successful vendors will be those that can make a smooth transition from the traditional, dedicated application model to mixed workload consolidation,\" added Eric Burgener, IDC's research director for storage systems.The bottom line, the market watcher said, is that datacenter operators should consider some form of flash memory when replacing current storage platforms.The other part of the flash equation is software-defined storage in datacenters. That market is expected to reach $77 billion by 2020, compared with $21.78 billion this year, according to MarketsandMarkets. Between 2014 and 2020, software-defined storage for capacity-driven storage is expected to grow to $40 billion from $13 billion, San Francisco-based software developer Scality estimates. Of that total, $27 billion will be spent on OEM servers while the remainder will go toward software, Scality reckons.Meanwhile, enterprise storage vendors like Dell, EMC, HP and flash array spinoffs like SanDisk Corp.'s NexGen Storage are rolling out \"flash-optimized\" hybrid and all-flash arrays. HP claimed earlier this month its all-flash 3PAR StoreServ family lowers the cost of flash capacity by 25 percent to $1.50 per usable gigabyte of storage.In January, Dell rolled out a pair of all-flash storage arrays priced as low as $25,000. The entry-level arrays are among the early attempts to overcome cost barriers that have slowed broader adoption of flash storage arrays in datacenters.All-flash arrays, hybrid arrays and software-defined storage all represent disruptive technologies in the datacenter and \"all have their uses cases,\" noted Davis of Infinio. Despite the steady drop in the cost of all-flash arrays from traditional storage vendors like Dell and HP, Davis asserted, \"It's not all there yet.\"George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).George,SanDisk spun NexGen out as an independent company in Jan.",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2015-06-25 00:00:00",
    "cats": [
        "Editor's Picks: Front Page",
        "Editor's Picks: Storage",
        "Slider: Front Page",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/editors-pick/",
        "https://www.enterpriseai.news/category/editors-picks-storage/",
        "https://www.enterpriseai.news/category/slider/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "All-flash storage",
        "enterprise datacenters",
        "flash arrays",
        "hybrid storage",
        "Software-defined storage"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-storage/",
        "https://www.enterpriseai.news/tag/enterprise-datacenters/",
        "https://www.enterpriseai.news/tag/flash-arrays/",
        "https://www.enterpriseai.news/tag/hybrid-storage/",
        "https://www.enterpriseai.news/tag/software-defined-storage/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Screen-Shot-2015-06-25-at-12.31.55-PM-370x281.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2015/06/Screen-Shot-2015-06-25-at-11.14.51-AM.png",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g",
        "https://secure.gravatar.com/avatar/154537879cb23bc72bf9f2177f1cffae?s=60&r=g"
    ]
}