{
    "title": "Hyperion: AI-driven HPC Industry Continues to Push Growth Projections",
    "author": "Doug Black",
    "date": "2019-11-21 00:00:00",
    "text": "Three major forces – AI, cloud and exascale – are combining to raise the HPC industry to heights exceeding expectations. According to market study results released this week by Hyperion Research at SC19 in Denver, HPC server sales in the first half of the year totaled $6.7 billion, while 2018 sales grew 15 percent overall, totaling $13.7 billion. Growth has been driven primarily by new buyers from the enterprise moving into HPC for AI-related workloads, such as fraud detection, business intelligence, affinity marketing, personalized medicine, smart cities and IoT, the firm said.Hyperion expects the good times to keep rolling for HPC server vendors, with that industry sector projected to reach just under $20 billion by 2023 for a 2018-2023 CAGR of 7.8 percent. For the broader HPC market, encompassing servers, storage, middleware, applications and services, revenue is expected to reach slightly less than $40 billion for a CAGR of 7.2 percent.Other key takeaways from Hyperion’s industry update:Yet for all that, Hyperion Senior Research VP Steve Conway said AI is just starting.“There's pretty good consensus that we are at a period that we're still near the beginning with AI as far as capability goes,\" he said. \"Lots of emphasis has been on training and there’s been lots of progress there. Just more recently, the emphasis is starting to shift to inferencing, the ability of the machines to guess better and to make better intelligence, intuition. But that's still not so far along.”Based on recent surveys of HPC cloud users reporting that they run 33 percent of their HPC workloads in 3rd-party clouds, Hyperion said the HPC community runs 20 percent of workloads in cloud environments.“That is a very big jump from 18 to 24 months ago, that number started at just under 10 percent,” Conway said. Having said that, however, he cautioned that HPC in clouds has limitations, including moving mission critical workloads off-prem and high costs associated with data locality where large volumes of data are involved.“It is unclear to what extent future (beyond 2025) large supercomputers will continue to be purchased in the $500 million-plus price range,” the firm said, “or will return to more ‘modest’ price levels in the $100 to $250 million price range per system.”As for the international exascale race, Hyperion sees the U.S. and China installing the first exascale systems in similar timeframes – by 2022 – followed by the EU and then Japan.Hyperion also announced winners of its annual Innovation Excellence Awards, including:",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Hyperion-SC19-1st-half-2019-hpc-server-sales-370x290.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Hyperion-SC19-server-sales-by-vendor.png",
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/Hyperion-SC19-updated-cloud-forecast.pdf.png"
    ]
}