{
    "title": "Brocade Upgrades Storage Switch for All-Flash Datacenters",
    "text": "As all-flash arrays make inroads in the datacenter, switch makers are coming up with new access approaches leveraging all-flash storage as a way to break through network bottlenecks while adapting to data-driven workloads.With that in mind, networking switch specialist Brocade has upgraded its Fibre Channel switch technology to 32 gigabits per second performance while adding a monitoring feature designed to track and optimize the performance of individual virtual machines.Brocade (NASDAQ: BRCD) said Tuesday (March 28) its storage switch based on its sixth generation Fibre Channel technology is designed to connect servers and VMs in all-flash datacenters. The performance boost targets more demanding application workloads.The San Jose-based switch maker noted that rapid adoption of flash storage and the emergence of Non-Volatile Memory Express (NVMe) are \"driving new requirements for a modern infrastructure that can optimize application performance….\" Hence, its Gen 6 Fibre Channel storage area network aims to deliver \"non-stop availability and built-in NVMe for all-flash datacenters.\"The new switch also targets uses ranging from small, shared storage fabrics to network edge deployments in datacenters. It can be expanded from eight to 24 ports, the company said.The networking switch looks to leverage enterprise deployment of all-flash arrays in datacenters that also incorporate NVMe technology. Those emerging all-flash storage platforms seek to eliminate performance bottlenecks in datacenters often associated with disk-based hardware. Networking protocols are emerging that allow software and hardware within flash arrays to communicate directly, thereby boosting performance.In terms of performance, Brocade asserts its latest Fibre Channel implementation combined with NVMe reduces network latency by up to 55 percent. Hence, its \"purpose-built fabric\" targets data-intensive workloads with heavy storage requirements.Along with leveraging NVM Express, the Gen 6 switch monitors storage IO performance. It also tracks VM performance across the storage fabric using a standard VM tagging approach. Based on performance metrics, network administrators could, for example, use the monitoring capability to set thresholds for VM flows, and then provision storage networks based on VM requirements. That capability would provide visibility into application performance at the VM level within a storage network, according to Jack Rondoni, Brocade's senior vice president of storage networking.The G610 switch is available now through Brocade and its channel partners. Its manufacturing partners plan to start shipping the new switch in the second quarter of 2017. The VM monitoring capability also is available now.The switch maker is working with a growing list of datacenter infrastructure providers, including Dell EMC, Fujitsu, Hitachi Data Systems, Hewlett Packard Enterprise, Huawei, Lenovo, Pure Storage and VMware.HPE (NYSE: HPE) said it is shipping the Brocade switch now with its 3PAR all-flash data storage platform.  George Leopold has written about science and technology for more than 30 years, focusing on electronics and aerospace technology. He previously served as executive editor of Electronic Engineering Times. Leopold is the author of \"Calculated Risk: The Supersonic Life and Times of Gus Grissom\" (Purdue University Press, 2016).",
    "author": [
        "George Leopold",
        "https://www.enterpriseai.news/author/george/"
    ],
    "date": "2017-03-28 00:00:00",
    "cats": [
        "Networks",
        "Slider: Networks",
        "Slider: Storage",
        "Storage"
    ],
    "cat_urls": [
        "https://www.enterpriseai.news/category/networks/",
        "https://www.enterpriseai.news/category/slider-networks/",
        "https://www.enterpriseai.news/category/slider-storage/",
        "https://www.enterpriseai.news/category/storage/"
    ],
    "tags": [
        "all-flash storage arrays",
        "Brocade",
        "Fibre Channel",
        "NVMe",
        "storage fabric",
        "VM"
    ],
    "tag_urls": [
        "https://www.enterpriseai.news/tag/all-flash-storage-arrays/",
        "https://www.enterpriseai.news/tag/brocade/",
        "https://www.enterpriseai.news/tag/fibre-channel/",
        "https://www.enterpriseai.news/tag/nvme/",
        "https://www.enterpriseai.news/tag/storage-fabric/",
        "https://www.enterpriseai.news/tag/vm/"
    ],
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/shutterstock_network-370x228.jpg",
        "https://secure.gravatar.com/avatar/4b7d4d569774f21b5db4f21ac8c19c8d?s=80&r=g"
    ]
}