{
    "title": "IBM Storage Breakthrough Paves Way for 330TB Tape Cartridges",
    "author": "Tiffany Trader",
    "date": "2017-08-04 00:00:00",
    "text": "IBM has announced a new record for magnetic tape storage that it says will keep tape storage density on a Moore’s Law-like path far into the next decade. In collaboration with Sony, IBM scientists recorded 201 gigabits on one square inch of prototype magnetic tape, achieving a 20x improvement over the areal density used in current state of the art enterprise tape drives. This works out to a potential standard cartridge capacity of 330 terabytes (TB) of uncompressed data.The demonstration device combines Sony’s new magnetic tape technology with IBM Research’s newly developed write/read heads and its next-generation servo and signal processing technologies, detailed in the IBM announcement:+ Innovative signal-processing algorithms for the data channel, based on noise-predictive detection principles, which enable reliable operation at a linear density of 818,000 bits per inch with an ultra-narrow 48nm wide tunneling magneto-resistive (TMR) reader.+ A set of advanced servo control technologies that when combined enable head positioning with an accuracy of better than 7 nanometers. This combined with a 48nm wide (TMR) hard disk drive read head enables a track density of 246,200 tracks per inch, a 13-fold increase over a state of the art TS1155 drive.+ A novel low friction tape head technology that permits the use of very smooth tape media.It’s the first time that IBM has used sputtered magnetic tape instead of the traditional barium ferrite technology.As explained by IBM Scientist Mark Lantz (see video at end of article) “sputter tape uses several layers of thin metal films that are coated onto the tape using vacuum sputter technology that’s similar technology as is that used for integrated circuits.”In current generation tape drives, a thin film of nanoscale barium ferrite particles are applied to the tape in liquid form, like a thin layer of paint.“While sputtered tape is expected to cost a little more to manufacture than current commercial tape that uses Barium ferrite (BaFe), the potential for very high capacity will make the cost per TB very attractive,” said IBM Fellow Evangelos Eleftheriou.IBM envisions tape becoming a viable storage media for cloud, both as a back-up application and an archival tier for infrequently-accessed data. Of course, spinning disc and flash storage have their advantages, but tape’s economics for massive data archives are hard to argue with.IBM believes that this latest achievement puts the company on track to continue scaling tape technology at near-historic rates, doubling the storage capacity every two years for at least the next ten years.IBM’s legacy of tape storage innovations stretches back more than 60 years. The company launched its first commercial tape product, the 726 Magnetic Tape Unit, in 1952, providing a speed and capacity advantage over existing cathode ray tube and drum storage devices. The 726 used an oxide-coated, non-metallic tape, approximately a half-inch wide with a density of 100 bits per linear inch.IBM and Sony presented the results of their collaboration this week at the 28th Magnetic Recording Conference in Japan. Neither company indicated when we might actually see a 330 TB tape drive in the wild. Leading conventional technology can only handle 15 TB per data cartridge.Feature image caption: IBM scientist Dr. Mark Lantz holds a one square inch piece of Sony Storage Media Solutions sputtered tape, which can hold 201 Gigabytes (Photo credit: IBM Research)With over a decade’s experience covering the HPC space, Tiffany Trader is one of the preeminent voices reporting on advanced scale computing today.",
    "pic_urls": [
        "https://2pggys3b7fd63bfvol1w51zt-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/IBM-magnetic-tape-3-370x290.jpg",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/Sony-sputter-tape-2017-1152x.png",
        "https://6lli539m39y3hpkelqsm3c2fg-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/IBM-tape-innovation-slide-Aug-2017.png",
        "https://secure.gravatar.com/avatar/710729879b3d3843127577cf720a1382?s=80&r=g"
    ]
}